Smethan/projectZero/ESP32C5/main/main.c
// Sniffer data structures
typedef struct {
    uint8_t mac[6];
    int rssi;
    uint32_t last_seen;
} sniffer_client_t;

typedef struct {
    uint8_t bssid[6];
    char ssid[33];
    uint8_t channel;
    wifi_auth_mode_t authmode;
    int rssi;
    sniffer_client_t clients[MAX_CLIENTS_PER_AP];
    int client_count;
    uint32_t last_seen;
} sniffer_ap_t;

// GPS data structure
typedef struct {
    float latitude;
    float longitude;
    float altitude;
    float accuracy;
    int satellites;
    bool valid;
} gps_data_t;

typedef enum {
    GPS_MODULE_ATGM336H = 0,
    GPS_MODULE_M5STACK_GPS_V11 = 1,
    GPS_MODULE_EXTERNAL = 2,
    GPS_MODULE_EXTERNAL_CAP = 3,
    // Backward compatibility alias for previously exposed name.
    GPS_MODULE_USB_TAB = GPS_MODULE_EXTERNAL,
    GPS_MODULE_CAP = GPS_MODULE_EXTERNAL_CAP,
} gps_module_t;

// Wardrive state
static bool wardrive_active = false;
static int wardrive_file_counter = 1;
static gps_data_t current_gps = {0};
static gps_data_t external_gps_position = {0};
static gps_data_t external_cap_gps_position = {0};
static bool gps_uart_initialized = false;
static gps_module_t current_gps_module = GPS_MODULE_ATGM336H;
static volatile bool gps_raw_active = false;
static bool wardrive_promisc_trace_enabled = false;
static char wardrive_promisc_trace_path[96] = "";

// Global stop flag for all operations
static volatile bool operation_stop_requested = false;

// wifi_connect command state: 0 = pending, 1 = success, -1 = failed
static volatile int wifi_connect_result = 0;
// Last disconnect/fail reason captured while a wifi_connect is waiting (esp_wifi reason code)
static volatile int wifi_connect_fail_reason = 0;

// WPA-SEC API key (loaded from NVS on boot)
static char wpasec_api_key[WPASEC_KEY_MAX_LEN] = "";
static char wigle_api_name[WIGLE_KEY_MAX_LEN] = "";
static char wigle_api_token[WIGLE_KEY_MAX_LEN] = "";
static char wdgwars_api_key[WDGWARS_KEY_MAX_LEN] = "";
static int64_t wdgwars_circuit_open_until_us = 0;
static int wdgwars_rate_limit_streak = 0;
static esp_err_t sd_last_init_error = ESP_OK;

// ARP ban state
static volatile bool arp_ban_active = false;
static TaskHandle_t arp_ban_task_handle = NULL;
static uint8_t arp_ban_target_mac[6];
static ip4_addr_t arp_ban_target_ip;
static uint8_t arp_ban_gateway_mac[6];
static ip4_addr_t arp_ban_gateway_ip;

// Sniffer state (allocated in PSRAM)
static sniffer_ap_t *sniffer_aps = NULL;                    // ~75 KB in PSRAM
static int sniffer_ap_count = 0;
static volatile bool sniffer_active = false;
static volatile bool sniffer_scan_phase = false;
static int sniff_debug = 0; // Debug flag for detailed packet logging
static bool sniffer_selected_mode = false; // Flag for selected networks mode
static int sniffer_selected_channels[MAX_AP_CNT]; // Unique channels from selected networks
static int sniffer_selected_channels_count = 0; // Number of unique channels

// Packet monitor state
static volatile bool packet_monitor_active = false;
static volatile uint32_t packet_monitor_total = 0;
static TaskHandle_t packet_monitor_task_handle = NULL;
static uint8_t packet_monitor_prev_primary = 1;
static wifi_second_chan_t packet_monitor_prev_secondary = WIFI_SECOND_CHAN_NONE;
static bool packet_monitor_has_prev_channel = false;
static bool packet_monitor_promiscuous_owned = false;
static bool packet_monitor_callback_installed = false;

// AP locator state
static volatile bool ap_locator_active = false;
static volatile int ap_locator_last_rssi = 0;
static volatile bool ap_locator_beacon_seen = false;
static volatile uint32_t ap_locator_beacon_total = 0;
static volatile int64_t ap_locator_last_seen_us = 0;
static TaskHandle_t ap_locator_task_handle = NULL;
static uint8_t ap_locator_target_bssid[6] = {0};
static char ap_locator_target_ssid[33] = {0};
static uint8_t ap_locator_target_channel = 1;
static uint8_t ap_locator_prev_primary = 1;
static wifi_second_chan_t ap_locator_prev_secondary = WIFI_SECOND_CHAN_NONE;
static bool ap_locator_has_prev_channel = false;
static bool ap_locator_promiscuous_owned = false;
static bool ap_locator_callback_installed = false;
static int cmd_start_ap_locator(int argc, char **argv);
static const esp_console_cmd_t ap_locator_cmd = {
    .command = "start_ap_locator",
    .help = "Track beacon RSSI of exactly one selected AP: start_ap_locator",
    .hint = NULL,
    .func = &cmd_start_ap_locator,
    .argtable = NULL
};

// Channel view monitor state
static volatile bool channel_view_active = false;
static volatile bool channel_view_scan_mode = false;
static TaskHandle_t channel_view_task_handle = NULL;

// Probe request storage (allocated in PSRAM)
static probe_request_t *probe_requests = NULL;              // ~9.4 KB in PSRAM
static int probe_request_count = 0;

// Channel hopping for sniffer (like Marauder dual-band)
static int sniffer_current_channel = 1;
static int sniffer_channel_index = 0;
static int64_t sniffer_last_channel_hop = 0;
static const int sniffer_channel_hop_delay_ms = 250; // 250ms per channel like Marauder
// Sniffer OLED shared state (callback -> task)
static volatile uint32_t sniff_oled_packets = 0;
static volatile bool sniff_oled_dirty = false;
static TaskHandle_t sniffer_channel_task_handle = NULL;
static uint32_t sniffer_packet_counter = 0;
static uint32_t sniffer_last_debug_packet = 0;

// PCAP capture state
typedef enum {
    PCAP_MODE_NONE = 0,
    PCAP_MODE_RADIO,
    PCAP_MODE_NET
} pcap_capture_mode_t;

typedef struct {
    uint16_t len;
    int64_t timestamp_us;
    uint8_t data[];
} pcap_queued_frame_t;

static volatile bool pcap_capture_active = false;
static pcap_capture_mode_t pcap_capture_mode = PCAP_MODE_NONE;
static FILE *pcap_capture_file = NULL;
static TaskHandle_t pcap_writer_task_handle = NULL;
static QueueHandle_t pcap_packet_queue = NULL;
static uint32_t pcap_capture_frame_count = 0;
static uint32_t pcap_capture_drop_count = 0;
static char pcap_capture_filepath[64];
static netif_input_fn pcap_original_input = NULL;
static netif_linkoutput_fn pcap_original_linkoutput = NULL;

