Smethan/projectZero/ESP32C5/main/main.c
// PCAP ARP spoofing state (net mode MITM)
#define PCAP_ARP_MAX_HOSTS 64

typedef struct {
    uint8_t mac[6];
    uint32_t ip;
} pcap_arp_host_t;

static TaskHandle_t pcap_arp_task_handle = NULL;
static volatile bool pcap_arp_active = false;
static pcap_arp_host_t pcap_arp_hosts[PCAP_ARP_MAX_HOSTS];
static int pcap_arp_host_count = 0;
static uint8_t pcap_arp_gateway_mac[6];
static uint32_t pcap_arp_gateway_ip = 0;
static uint8_t pcap_arp_own_mac[6];

// Deauth/Evil Twin attack task
static TaskHandle_t deauth_attack_task_handle = NULL;
static volatile bool deauth_attack_active = false;

// Blackout attack task
static TaskHandle_t blackout_attack_task_handle = NULL;
static volatile bool blackout_attack_active = false;

// Target BSSID monitoring (allocated in PSRAM)
#define MAX_TARGET_BSSIDS 50
static target_bssid_t *target_bssids = NULL;                // ~2.3 KB in PSRAM
static int target_bssid_count = 0;

// Selected stations for targeted deauth (allocated in PSRAM)
#define MAX_SELECTED_STATIONS 32
static selected_station_t *selected_stations = NULL;
static int selected_stations_count = 0;
static uint32_t last_channel_check_time = 0;
static const uint32_t CHANNEL_CHECK_INTERVAL_MS = 5 * 60 * 1000; // 5 minutes
static volatile bool periodic_rescan_in_progress = false; // Flag to suppress logs during periodic re-scans

// Client tracking for Evil Twin portal
static volatile int portal_connected_clients = 0;

// SAE Overflow attack task
static TaskHandle_t sae_attack_task_handle = NULL;
static volatile bool sae_attack_active = false;

// Sniffer Dog attack task
static TaskHandle_t sniffer_dog_task_handle = NULL;
static volatile bool sniffer_dog_active = false;
static int sniffer_dog_current_channel = 1;
static int sniffer_dog_channel_index = 0;
static int64_t sniffer_dog_last_channel_hop = 0;
// Sniffer Dog OLED shared state (callback -> task)
static volatile char sd_oled_ap[18] = {0};
static volatile char sd_oled_sta[18] = {0};
static volatile int  sd_oled_ch = 0;
static volatile int  sd_oled_rssi = 0;
static volatile uint32_t sd_oled_count = 0;
static volatile bool sd_oled_dirty = false;

// Deauth detector task
static TaskHandle_t deauth_detector_task_handle = NULL;
static volatile bool deauth_detector_active = false;
static int deauth_detector_current_channel = 1;
static int deauth_detector_channel_index = 0;
static int64_t deauth_detector_last_channel_hop = 0;
// Deauth detector OLED shared state (callback -> task)
static volatile char dd_oled_ssid[22] = {0};
static volatile char dd_oled_bssid[18] = {0};
static volatile int  dd_oled_ch = 0;
static volatile int  dd_oled_rssi = 0;
static volatile uint32_t dd_oled_count = 0;
static volatile bool dd_oled_dirty = false;
// Deauth detector selected mode
static bool deauth_detector_selected_mode = false;
static int deauth_detector_selected_channels[MAX_AP_CNT];
static int deauth_detector_selected_channels_count = 0;

// Wardrive task
static TaskHandle_t gps_raw_task_handle = NULL;
static TaskHandle_t wardrive_task_handle = NULL;

// Handshake attack task
static TaskHandle_t handshake_attack_task_handle = NULL;
static volatile bool handshake_attack_active = false;
static bool handshake_selected_mode = false; // true if networks were selected, false for scan-all mode
static bool handshake_serial_mode = false;   // true = dump pcap/hccapx via serial (base64) instead of SD
static wifi_ap_record_t *handshake_targets = NULL;          // ~6.4 KB in PSRAM
static int handshake_target_count = 0;
static bool handshake_captured[MAX_AP_CNT]; // Track which networks have captured handshakes
static int handshake_current_index = 0;

// ============================================================================
// Sniffer-based Handshake Attack with D-UCB Channel Selection (scan-all mode)
// ============================================================================

#define HS_MAX_APS      64
#define HS_MAX_CLIENTS  128
#define DUCB_GAMMA      0.99    // Discount factor (recent observations matter more)
#define DUCB_C          1.0     // Exploration constant
#define HS_DEAUTH_COOLDOWN_US  (10 * 1000000LL)  // 10s cooldown between deauths per client
#define HS_DWELL_TIME_MS       400                // Time spent on each channel
#define HS_STATS_INTERVAL_US   (30 * 1000000LL)   // Log stats every 30s

// D-UCB state per channel
typedef struct {
    int channel;
    double discounted_reward;   // Σ γ^(t-s) * reward_s
    double discounted_pulls;    // Σ γ^(t-s) * 1 (for this arm)
    int total_pulls;            // total times this channel was selected
} ducb_channel_t;

// Multi-AP handshake target (discovered from sniffing)
typedef struct {
    uint8_t bssid[6];
    char ssid[33];
    uint8_t channel;
    wifi_auth_mode_t authmode;
    int rssi;
    bool captured_m1, captured_m2, captured_m3, captured_m4;
    bool complete;
    bool beacon_captured;
    bool has_existing_file;     // Already captured on SD
    int64_t last_deauth_us;
} hs_ap_target_t;

// Client discovered by sniffing
typedef struct {
    uint8_t mac[6];
    int hs_ap_index;            // index into hs_ap_targets[]
    int rssi;
    int64_t last_seen_us;
    int64_t last_deauth_us;
    bool deauthed;
} hs_client_entry_t;

// Sniffer handshake state
static hs_ap_target_t *hs_ap_targets = NULL;     // PSRAM
static int hs_ap_count = 0;
static hs_client_entry_t *hs_clients = NULL;      // PSRAM
static int hs_client_count = 0;
static ducb_channel_t *ducb_channels = NULL;       // PSRAM
static int ducb_channel_count = 0;
static double ducb_discounted_total = 0.0;         // Σ γ^(t-s) across all arms

// Per-dwell reward counters (reset each dwell)
static volatile int hs_dwell_new_clients = 0;
static volatile int hs_dwell_eapol_frames = 0;

// Beacon spam task
static TaskHandle_t beacon_spam_task_handle = NULL;
static volatile bool beacon_spam_active = false;
#define MAX_BEACON_SSIDS 32
static char beacon_ssids[MAX_BEACON_SSIDS][33];
static int beacon_ssid_count = 0;

// Channel lists for 2.4GHz and 5GHz
static const uint8_t channels_24ghz[] = {1, 6, 11, 2, 7, 3, 8, 4, 9, 5, 10, 12, 13};
static const uint8_t channels_5ghz[] = {36, 40, 44, 48, 52, 56, 60, 64, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 149, 153, 157, 161, 165};
#define NUM_CHANNELS_24GHZ (sizeof(channels_24ghz) / sizeof(channels_24ghz[0]))
#define NUM_CHANNELS_5GHZ (sizeof(channels_5ghz) / sizeof(channels_5ghz[0]))

// Portal state
static httpd_handle_t portal_server = NULL;
static volatile bool portal_active = false;
static volatile bool karma_mode_active = false;
static volatile bool rogueap_mode_active = false;
static TaskHandle_t dns_server_task_handle = NULL;
static int dns_server_socket = -1;

// DarkSword state
static volatile bool darksword_active = false;
static TaskHandle_t darksword_exfil_task_handle = NULL;
static int darksword_exfil_socket = -1;
static char *darksword_html = NULL;
static size_t darksword_html_len = 0;
static bool darksword_html_gzipped = false;

static TaskHandle_t boot_button_task_handle = NULL;
static TaskHandle_t boot_action_task_handle = NULL;

// DNS server configuration
#define DNS_PORT 53
#define DNS_MAX_PACKET_SIZE 512

// Dual-band channel list (2.4GHz + 5GHz like Marauder)
static const int dual_band_channels[] = {
    // 2.4GHz channels
    1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14,
    // 5GHz channels
    36, 40, 44, 48, 52, 56, 60, 64, 100, 104, 108, 112, 116, 120, 124, 128,
    132, 136, 140, 144, 149, 153, 157, 161, 165
};
