Smethan/projectZero/ESP32C5/main/main.c
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WD_CFG_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;   // first boot: keep defaults
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Wardrive cfg NVS read open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t u8;
    if (nvs_get_u8(handle, WD_CFG_NVS_KEY_BANDS, &u8) == ESP_OK && (u8 & WD_BAND_ALL)) {
        g_wd_cfg.bands = u8 & WD_BAND_ALL;
    }
    if (nvs_get_u8(handle, WD_CFG_NVS_KEY_CHMODE, &u8) == ESP_OK && u8 <= WD_CH_CUSTOM) {
        g_wd_cfg.ch_mode = u8;
    }

    uint8_t tmp[WD_CUSTOM_CH_MAX];
    size_t blob_len = sizeof(tmp);
    if (nvs_get_blob(handle, WD_CFG_NVS_KEY_CUSTOM, tmp, &blob_len) == ESP_OK &&
        blob_len <= WD_CUSTOM_CH_MAX) {
        memcpy(g_wd_cfg.custom_ch, tmp, blob_len);
        g_wd_cfg.custom_ch_count = (uint8_t)blob_len;
    }

    int8_t i8;
    if (nvs_get_i8(handle, WD_CFG_NVS_KEY_WDELTA, &i8) == ESP_OK && i8 >= 0 && i8 <= 50) {
        g_wd_cfg.wifi_rssi_delta = i8;
    }
    if (nvs_get_i8(handle, WD_CFG_NVS_KEY_BDELTA, &i8) == ESP_OK && i8 >= 0 && i8 <= 50) {
        g_wd_cfg.ble_rssi_delta = i8;
    }

    uint16_t u16;
    if (nvs_get_u16(handle, WD_CFG_NVS_KEY_COOLDOWN, &u16) == ESP_OK) {
        g_wd_cfg.startup_cooldown_s = u16;
    }

    uint32_t u32;
    if (nvs_get_u32(handle, WD_CFG_NVS_KEY_MEMCAP, &u32) == ESP_OK && u32 >= 1000) {
        g_wd_cfg.mem_cap = u32;
    }

    if (nvs_get_u8(handle, WD_CFG_NVS_KEY_ASSENS, &u8) == ESP_OK && u8 <= WD_AS_HIGH) {
        g_wd_cfg.antisurv_sensitivity = u8;
    }

    nvs_close(handle);
}

// Format the active band mask into "wifi24,wifi5,ble" (caller buffer >= 24 bytes).
static void wardrive_config_format_bands(char *out, size_t out_sz) {
    snprintf(out, out_sz, "%s%s%s",
             (g_wd_cfg.bands & WD_BAND_24)  ? "wifi24," : "",
             (g_wd_cfg.bands & WD_BAND_5)   ? "wifi5,"  : "",
             (g_wd_cfg.bands & WD_BAND_BLE) ? "ble,"    : "");
    size_t len = strlen(out);
    if (len > 0 && out[len - 1] == ',') out[len - 1] = '\0';   // strip trailing comma
}

// Format the custom channel list into "1:6:11:36" (caller buffer should be large).
static void wardrive_config_format_custom(char *out, size_t out_sz) {
    out[0] = '\0';
    for (int i = 0; i < g_wd_cfg.custom_ch_count; i++) {
        char part[6];
        snprintf(part, sizeof(part), "%s%d", (i == 0) ? "" : ":", g_wd_cfg.custom_ch[i]);
        size_t len = strlen(out);
        if (len + strlen(part) + 1 >= out_sz) break;
        strcpy(out + len, part);
    }
}

static void wardrive_config_print(void) {
    char bands_str[24];
    wardrive_config_format_bands(bands_str, sizeof(bands_str));

    const char *chmode_str = (g_wd_cfg.ch_mode == WD_CH_POPULAR) ? "popular" :
                             (g_wd_cfg.ch_mode == WD_CH_CUSTOM)  ? "custom"  : "all";

    char custom_str[WD_CUSTOM_CH_MAX * 4];
    wardrive_config_format_custom(custom_str, sizeof(custom_str));

    printf("[WDCFG] bands=%s\n", bands_str);
    printf("[WDCFG] channels=%s\n", chmode_str);
    printf("[WDCFG] custom=%s\n", custom_str);
    printf("[WDCFG] wifi_rssi_delta=%d\n", g_wd_cfg.wifi_rssi_delta);
    printf("[WDCFG] ble_rssi_delta=%d\n", g_wd_cfg.ble_rssi_delta);
    printf("[WDCFG] startup_cooldown=%u\n", (unsigned)g_wd_cfg.startup_cooldown_s);
    printf("[WDCFG] mem_cap=%u\n", (unsigned)g_wd_cfg.mem_cap);
    printf("[WDCFG] antisurv_sensitivity=%s\n",
           (g_wd_cfg.antisurv_sensitivity == WD_AS_LOW)  ? "low" :
           (g_wd_cfg.antisurv_sensitivity == WD_AS_HIGH) ? "high" : "med");
    printf("[WDCFG] END\n");
}

// get_wardrive_config: dump active config (machine-parseable, "[WDCFG] END" marker).
static int cmd_get_wardrive_config(int argc, char **argv) {
    (void)argc; (void)argv;
    wardrive_config_print();
    return 0;
}

// Defined later with the wardrive-promisc helpers; needed by the set command below.
static bool wdp_channel_is_known(int ch);

// set_wardrive_bands wifi24,wifi5,ble — choose which radios the wardrive uses.
static int cmd_set_wardrive_bands(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: set_wardrive_bands <wifi24|wifi5|ble>[,...]  (e.g. wifi24,ble)\n");
        return 1;
    }
    char buf[64];
    strncpy(buf, argv[1], sizeof(buf) - 1);
    buf[sizeof(buf) - 1] = '\0';

    uint8_t mask = 0;
    char *tok = strtok(buf, ",");
    while (tok != NULL) {
        if (strcmp(tok, "wifi24") == 0 || strcmp(tok, "24") == 0 || strcmp(tok, "2.4") == 0)
            mask |= WD_BAND_24;
        else if (strcmp(tok, "wifi5") == 0 || strcmp(tok, "5") == 0 || strcmp(tok, "5g") == 0)
            mask |= WD_BAND_5;
        else if (strcmp(tok, "ble") == 0 || strcmp(tok, "bt") == 0)
            mask |= WD_BAND_BLE;
        else {
            printf("Unknown band '%s'. Valid: wifi24, wifi5, ble\n", tok);
            return 1;
        }
        tok = strtok(NULL, ",");
    }
    if (mask == 0) {
        printf("No valid bands given.\n");
        return 1;
    }
    g_wd_cfg.bands = mask;
    wardrive_config_persist();

    char bands_str[24];
    wardrive_config_format_bands(bands_str, sizeof(bands_str));
    printf("Wardrive bands set: %s\n", bands_str);
    wardrive_config_print();
    return 0;
}

// set_wardrive_channels <popular|all|custom> [1:6:11:36] — channel selection.
static int cmd_set_wardrive_channels(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: set_wardrive_channels <popular|all|custom> [1:6:11:36]\n");
        return 1;
    }
    if (strcmp(argv[1], "popular") == 0) {
        g_wd_cfg.ch_mode = WD_CH_POPULAR;
        g_wd_cfg.custom_ch_count = 0;
    } else if (strcmp(argv[1], "all") == 0) {
        g_wd_cfg.ch_mode = WD_CH_ALL;
        g_wd_cfg.custom_ch_count = 0;
    } else if (strcmp(argv[1], "custom") == 0) {
        if (argc < 3) {
            printf("custom needs a list, e.g. set_wardrive_channels custom 1:6:11:36\n");
            return 1;
        }
        char buf[256];
        strncpy(buf, argv[2], sizeof(buf) - 1);
        buf[sizeof(buf) - 1] = '\0';

        uint8_t list[WD_CUSTOM_CH_MAX];
        int count = 0;
        char *tok = strtok(buf, ":");
        while (tok != NULL) {
            int ch = atoi(tok);
            if (!wdp_channel_is_known(ch)) {
                printf("Channel %d is not a supported channel, ignoring.\n", ch);
            } else if (count >= WD_CUSTOM_CH_MAX) {
                printf("Too many channels (max %d), ignoring rest.\n", WD_CUSTOM_CH_MAX);
                break;
            } else {
                bool dup = false;
                for (int i = 0; i < count; i++) if (list[i] == ch) { dup = true; break; }
                if (!dup) list[count++] = (uint8_t)ch;
            }
            tok = strtok(NULL, ":");
        }
        if (count == 0) {
            printf("No valid channels parsed.\n");
            return 1;
        }
        memcpy(g_wd_cfg.custom_ch, list, (size_t)count);
        g_wd_cfg.custom_ch_count = (uint8_t)count;
        g_wd_cfg.ch_mode = WD_CH_CUSTOM;
    } else {
        printf("Unknown mode '%s'. Valid: popular, all, custom\n", argv[1]);
        return 1;
    }
    wardrive_config_persist();

    const char *chmode_str = (g_wd_cfg.ch_mode == WD_CH_POPULAR) ? "popular" :
                             (g_wd_cfg.ch_mode == WD_CH_CUSTOM)  ? "custom"  : "all";
    if (g_wd_cfg.ch_mode == WD_CH_CUSTOM) {
        char custom_str[WD_CUSTOM_CH_MAX * 4];
        wardrive_config_format_custom(custom_str, sizeof(custom_str));
        printf("Wardrive channels set: custom %s\n", custom_str);
    } else {
        printf("Wardrive channels set: %s\n", chmode_str);
    }
    wardrive_config_print();
    return 0;
}

