Smethan/projectZero/ESP32C5/main/main.c
// set_wardrive_rssi_delta <wifi|ble> <0-50> — re-log threshold in dBm (0 = log once).
static int cmd_set_wardrive_rssi_delta(int argc, char **argv) {
    if (argc < 3) {
        printf("Usage: set_wardrive_rssi_delta <wifi|ble> <0-50>  (0 = log once)\n");
        return 1;
    }
    int val = atoi(argv[2]);
    if (val < 0 || val > 50) {
        printf("Delta must be 0-50 dBm.\n");
        return 1;
    }
    if (strcmp(argv[1], "wifi") == 0) {
        g_wd_cfg.wifi_rssi_delta = (int8_t)val;
    } else if (strcmp(argv[1], "ble") == 0) {
        g_wd_cfg.ble_rssi_delta = (int8_t)val;
    } else {
        printf("Unknown target '%s'. Valid: wifi, ble\n", argv[1]);
        return 1;
    }
    wardrive_config_persist();
    printf("Wardrive RSSI delta set: wifi=%d ble=%d (0=log once)\n",
           g_wd_cfg.wifi_rssi_delta, g_wd_cfg.ble_rssi_delta);
    wardrive_config_print();
    return 0;
}

// set_wardrive_memcap <1000-200000> — max WiFi entries in RAM before oldest are evicted.
static int cmd_set_wardrive_memcap(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: set_wardrive_memcap <1000-200000>\n");
        return 1;
    }
    long val = atol(argv[1]);
    if (val < 1000 || val > 200000) {
        printf("Memory cap must be 1000-200000 entries.\n");
        return 1;
    }
    g_wd_cfg.mem_cap = (uint32_t)val;
    wardrive_config_persist();
    printf("Wardrive memory cap set: %u entries\n", (unsigned)g_wd_cfg.mem_cap);
    wardrive_config_print();
    return 0;
}

// set_wardrive_cooldown <0-600> — drop scans during the first N seconds (hide start area).
static int cmd_set_wardrive_cooldown(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: set_wardrive_cooldown <0-600>  (seconds, 0 = off)\n");
        return 1;
    }
    int val = atoi(argv[1]);
    if (val < 0 || val > 600) {
        printf("Cooldown must be 0-600 seconds.\n");
        return 1;
    }
    g_wd_cfg.startup_cooldown_s = (uint16_t)val;
    wardrive_config_persist();
    printf("Wardrive startup cooldown set: %u s\n", (unsigned)g_wd_cfg.startup_cooldown_s);
    wardrive_config_print();
    return 0;
}

// ============================================================================
// Wardrive device blacklist — MACs excluded from results and WiGLE exports (NVS-backed)
// ============================================================================
#define WD_BLACKLIST_MAX     64
#define WD_BL_NVS_NAMESPACE  "wdbl"
#define WD_BL_NVS_KEY        "macs"

static uint8_t g_wd_blacklist[WD_BLACKLIST_MAX][6];
static int     g_wd_blacklist_count = 0;

static bool wardrive_blacklist_contains(const uint8_t *mac) {
    for (int i = 0; i < g_wd_blacklist_count; i++) {
        if (memcmp(g_wd_blacklist[i], mac, 6) == 0) return true;
    }
    return false;
}

static void wardrive_blacklist_load(void) {
    g_wd_blacklist_count = 0;
    nvs_handle_t handle;
    if (nvs_open(WD_BL_NVS_NAMESPACE, NVS_READONLY, &handle) != ESP_OK) return;
    size_t len = sizeof(g_wd_blacklist);
    if (nvs_get_blob(handle, WD_BL_NVS_KEY, g_wd_blacklist, &len) == ESP_OK) {
        g_wd_blacklist_count = (int)(len / 6);
        if (g_wd_blacklist_count > WD_BLACKLIST_MAX) g_wd_blacklist_count = WD_BLACKLIST_MAX;
    }
    nvs_close(handle);
}

static void wardrive_blacklist_save(void) {
    nvs_handle_t handle;
    if (nvs_open(WD_BL_NVS_NAMESPACE, NVS_READWRITE, &handle) != ESP_OK) {
        ESP_LOGW(TAG, "Blacklist NVS open failed");
        return;
    }
    nvs_set_blob(handle, WD_BL_NVS_KEY, g_wd_blacklist, (size_t)g_wd_blacklist_count * 6);
    nvs_commit(handle);
    nvs_close(handle);
}

// Parse "AA:BB:CC:DD:EE:FF" into 6 bytes. Returns true on success.
static bool wardrive_parse_mac(const char *s, uint8_t *out) {
    unsigned v[6];
    if (sscanf(s, "%2x:%2x:%2x:%2x:%2x:%2x",
               &v[0], &v[1], &v[2], &v[3], &v[4], &v[5]) != 6) return false;
    for (int i = 0; i < 6; i++) out[i] = (uint8_t)v[i];
    return true;
}

// wardrive_blacklist <add|remove|list|clear> [MAC]
static int cmd_wardrive_blacklist(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: wardrive_blacklist <add|remove|list|clear> [MAC]\n");
        return 1;
    }
    if (strcmp(argv[1], "list") == 0) {
        printf("Blacklist: %d/%d entries\n", g_wd_blacklist_count, WD_BLACKLIST_MAX);
        for (int i = 0; i < g_wd_blacklist_count; i++) {
            printf("  %02X:%02X:%02X:%02X:%02X:%02X\n",
                   g_wd_blacklist[i][0], g_wd_blacklist[i][1], g_wd_blacklist[i][2],
                   g_wd_blacklist[i][3], g_wd_blacklist[i][4], g_wd_blacklist[i][5]);
        }
        printf("Blacklist END\n");
        return 0;
    }
    if (strcmp(argv[1], "clear") == 0) {
        g_wd_blacklist_count = 0;
        wardrive_blacklist_save();
        printf("Blacklist cleared.\n");
        return 0;
    }
    if (argc < 3) {
        printf("'%s' needs a MAC, e.g. wardrive_blacklist add AA:BB:CC:DD:EE:FF\n", argv[1]);
        return 1;
    }
    uint8_t mac[6];
    if (!wardrive_parse_mac(argv[2], mac)) {
        printf("Invalid MAC: %s\n", argv[2]);
        return 1;
    }
    if (strcmp(argv[1], "add") == 0) {
        if (wardrive_blacklist_contains(mac)) {
            printf("Already blacklisted.\n");
            return 0;
        }
        if (g_wd_blacklist_count >= WD_BLACKLIST_MAX) {
            printf("Blacklist full (max %d).\n", WD_BLACKLIST_MAX);
            return 1;
        }
        memcpy(g_wd_blacklist[g_wd_blacklist_count++], mac, 6);
        wardrive_blacklist_save();
        printf("Blacklisted %s (%d total)\n", argv[2], g_wd_blacklist_count);
        return 0;
    }
    if (strcmp(argv[1], "remove") == 0) {
        for (int i = 0; i < g_wd_blacklist_count; i++) {
            if (memcmp(g_wd_blacklist[i], mac, 6) == 0) {
                for (int j = i; j < g_wd_blacklist_count - 1; j++)
                    memcpy(g_wd_blacklist[j], g_wd_blacklist[j + 1], 6);
                g_wd_blacklist_count--;
                wardrive_blacklist_save();
                printf("Removed %s (%d total)\n", argv[2], g_wd_blacklist_count);
                return 0;
            }
        }
        printf("Not found in blacklist.\n");
        return 1;
    }
    printf("Unknown subcommand '%s'. Valid: add, remove, list, clear\n", argv[1]);
    return 1;
}

