Smethan/projectZero/ESP32C5/main/main.c
                // Start channel hopping task for time-based hopping
                if (sniffer_channel_task_handle == NULL) {
                    xTaskCreate(sniffer_channel_task, "sniffer_channel", 2048, NULL, 5, &sniffer_channel_task_handle);
                    MY_LOG_INFO(TAG, "Started sniffer channel hopping task");
                }
                
                // Change LED to green for active sniffing
                esp_err_t led_err = led_set_color(0, 255, 0); // Green
                if (led_err != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to set sniffer LED: %s", esp_err_to_name(led_err));
                }
                
                MY_LOG_INFO(TAG, "Sniffer: Scan complete, now monitoring client traffic with dual-band channel hopping (2.4GHz + 5GHz)...");
            } else if (!wardrive_active) {
                // Return LED to idle when normal scan is complete
                esp_err_t led_err = led_set_idle();
                if (led_err != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to restore idle LED after scan: %s", esp_err_to_name(led_err));
                }
            }
            break;
        }
        case WIFI_EVENT_STA_DISCONNECTED: {
            const wifi_event_sta_disconnected_t *e = (const wifi_event_sta_disconnected_t *)event_data;
            ESP_LOGW(TAG, "Wi-Fi: connection to AP failed. SSID='%s', reason=%d",
                     (const char*)e->ssid, (int)e->reason);
            
            // Signal wifi_connect command that connection failed (only if waiting)
            if (wifi_connect_result == 0) {
                wifi_connect_result = -1;
                wifi_connect_fail_reason = (int)e->reason;
            }
            
            if (applicationState == EVIL_TWIN_PASS_CHECK) {
                ESP_LOGW(TAG, "Evil twin: connection failed, wrong password? Btw connectAttemptCount: %d", connectAttemptCount);
                if (connectAttemptCount >= 3) {
                    ESP_LOGW(TAG, "Evil twin: Too many failed attempts, giving up and going to DEAUTH_EVIL_TWIN. Btw connectAttemptCount: %d ", connectAttemptCount);
                    {
                        char et_l2[64];
                        snprintf(et_l2, sizeof(et_l2), ">> %s", evilTwinSSID ? evilTwinSSID : "?");
                        oled_display_update_full("> Evil Twin", et_l2, "  Wrong password!", "  Resuming...");
                    }
                    applicationState = DEAUTH_EVIL_TWIN; //go back to deauth
                    
                    // Mark password as wrong for portal feedback
                    last_password_wrong = true;
                    
                    // Resume deauth attack since password was wrong
                    if (!deauth_attack_active && deauth_attack_task_handle == NULL) {
                        MY_LOG_INFO(TAG, "Resuming deauth attack - password was incorrect.");
                        
                        // Set LED to red for deauth
                        esp_err_t led_err = led_set_color(255, 0, 0);
                        if (led_err != ESP_OK) {
                            ESP_LOGW(TAG, "Failed to set LED for deauth resume: %s", esp_err_to_name(led_err));
                        }
                        
                        // Start deauth attack in background task
                        deauth_attack_active = true;
                        BaseType_t result = xTaskCreate(
                            deauth_attack_task,
                            "deauth_task",
                            4096,  // Stack size
                            NULL,
                            5,     // Priority
                            &deauth_attack_task_handle
                        );
                        
                        if (result != pdPASS) {
                            MY_LOG_INFO(TAG, "Failed to create deauth attack task!");
                            deauth_attack_active = false;
                        } else {
                            MY_LOG_INFO(TAG, "Deauth attack resumed successfully.");
                        }
                    }
                } else {
                    ESP_LOGW(TAG, "Evil twin: This is just a disconnect, connectAttemptCount: %d, will try again", connectAttemptCount);
                    connectAttemptCount++;
                    esp_wifi_connect();
                }
            } else if (applicationState == DEAUTH_EVIL_TWIN) {
                ESP_LOGW(TAG, "Evil twin: STA disconnect while attack active, keeping state");
            } else {
                ESP_LOGW(TAG, "Set app state to IDLE");
                applicationState = IDLE;
            }
            break;
        }
        default:
            break;
        }
    }
}

static bool ota_parse_version(const char *version, int *major, int *minor, int *patch) {
    if (!version || !major || !minor || !patch) {
        return false;
    }

    while (*version == 'v' || *version == 'V' || isspace((unsigned char)*version)) {
        version++;
    }

    int maj = 0;
    int min = 0;
    int pat = 0;
    int parsed = sscanf(version, "%d.%d.%d", &maj, &min, &pat);
    if (parsed < 1) {
        return false;
    }

    *major = maj;
    *minor = (parsed >= 2) ? min : 0;
    *patch = (parsed >= 3) ? pat : 0;
    return true;
}

static bool ota_is_newer_version(const char *current, const char *latest) {
    int cur_maj = 0;
    int cur_min = 0;
    int cur_pat = 0;
    int lat_maj = 0;
    int lat_min = 0;
    int lat_pat = 0;

    if (!ota_parse_version(current, &cur_maj, &cur_min, &cur_pat) ||
        !ota_parse_version(latest, &lat_maj, &lat_min, &lat_pat)) {
        MY_LOG_INFO(TAG, "OTA: version parse failed (current=%s, latest=%s)", current, latest);
        return false;
    }

    if (lat_maj != cur_maj) {
        return lat_maj > cur_maj;
    }
    if (lat_min != cur_min) {
        return lat_min > cur_min;
    }
    return lat_pat > cur_pat;
}

static esp_err_t ota_http_get(const char *url, char **out_buf, size_t *out_len) {
    if (!url || !out_buf || !out_len) {
        return ESP_ERR_INVALID_ARG;
    }

    *out_buf = NULL;
    *out_len = 0;

    esp_http_client_config_t config = {
        .url = url,
        .timeout_ms = 10000,
        .crt_bundle_attach = esp_crt_bundle_attach,
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        return ESP_FAIL;
    }

    esp_http_client_set_header(client, "User-Agent", "projectZero-ota");
    esp_http_client_set_header(client, "Accept", "application/vnd.github+json");

    esp_err_t err = esp_http_client_open(client, 0);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: http open failed: %s", esp_err_to_name(err));
        esp_http_client_cleanup(client);
        return err;
    }

    esp_http_client_fetch_headers(client);
    int status = esp_http_client_get_status_code(client);
    if (status != 200) {
        MY_LOG_INFO(TAG, "OTA: http status %d for %s", status, url);
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_FAIL;
    }

    char *buf = heap_caps_calloc(1, OTA_HTTP_MAX_BODY + 1, MALLOC_CAP_SPIRAM);
    if (!buf) {
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_ERR_NO_MEM;
    }

    size_t total = 0;
    while (total < OTA_HTTP_MAX_BODY) {
        int read_len = esp_http_client_read(client, buf + total, OTA_HTTP_MAX_BODY - total);
        if (read_len < 0) {
            MY_LOG_INFO(TAG, "OTA: http read failed");
            free(buf);
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            return ESP_FAIL;
        }
        if (read_len == 0) {
            break;
        }
        total += (size_t)read_len;
    }

    if (total >= OTA_HTTP_MAX_BODY) {
        MY_LOG_INFO(TAG, "OTA: response too large");
        free(buf);
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_ERR_NO_MEM;
    }

    buf[total] = '\0';
    *out_buf = buf;
    *out_len = total;

    esp_http_client_close(client);
    esp_http_client_cleanup(client);
    return ESP_OK;
}

