Smethan/projectZero/ESP32C5/main/main.c
static esp_err_t ota_fetch_latest_release(char *url_out, size_t url_len,
                                          char *tag_out, size_t tag_len) {
    char api_url[256];
    int res = snprintf(api_url, sizeof(api_url),
                       "https://api.github.com/repos/%s/%s/releases/latest",
                       OTA_GITHUB_OWNER, OTA_GITHUB_REPO);
    if (res < 0 || res >= (int)sizeof(api_url)) {
        return ESP_ERR_INVALID_SIZE;
    }

    char *body = NULL;
    size_t body_len = 0;
    esp_err_t err = ota_http_get(api_url, &body, &body_len);
    if (err != ESP_OK) {
        return err;
    }
    (void)body_len;

    cJSON *root = cJSON_Parse(body);
    if (!root) {
        free(body);
        return ESP_FAIL;
    }

    cJSON *tag = cJSON_GetObjectItem(root, "tag_name");
    cJSON *assets = cJSON_GetObjectItem(root, "assets");
    if (!cJSON_IsString(tag) || !cJSON_IsArray(assets)) {
        cJSON_Delete(root);
        free(body);
        return ESP_FAIL;
    }

    cJSON *asset = NULL;
    cJSON_ArrayForEach(asset, assets) {
        cJSON *name = cJSON_GetObjectItem(asset, "name");
        if (cJSON_IsString(name) && strcmp(name->valuestring, OTA_ASSET_NAME) == 0) {
            break;
        }
    }

    if (!asset) {
        MY_LOG_INFO(TAG, "OTA: asset %s not found in release", OTA_ASSET_NAME);
        cJSON_Delete(root);
        free(body);
        return ESP_ERR_NOT_FOUND;
    }

    cJSON *download = cJSON_GetObjectItem(asset, "browser_download_url");
    cJSON *size = cJSON_GetObjectItem(asset, "size");
    cJSON *updated = cJSON_GetObjectItem(asset, "updated_at");
    if (!cJSON_IsString(download)) {
        cJSON_Delete(root);
        free(body);
        return ESP_FAIL;
    }

    snprintf(tag_out, tag_len, "%s", tag->valuestring);
    snprintf(url_out, url_len, "%s", download->valuestring);
    if (cJSON_IsNumber(size)) {
        MY_LOG_INFO(TAG, "OTA: asset size=%lu bytes", (unsigned long)size->valuedouble);
    }
    if (cJSON_IsString(updated)) {
        MY_LOG_INFO(TAG, "OTA: asset updated_at=%s", updated->valuestring);
    }

    cJSON_Delete(root);
    free(body);
    return ESP_OK;
}

static esp_err_t ota_fetch_release_by_tag(const char *tag,
                                          char *url_out, size_t url_len,
                                          char *tag_out, size_t tag_len) {
    if (!tag || !*tag) {
        return ESP_ERR_INVALID_ARG;
    }

    char api_url[256];
    int res = snprintf(api_url, sizeof(api_url),
                       "https://api.github.com/repos/%s/%s/releases/tags/%s",
                       OTA_GITHUB_OWNER, OTA_GITHUB_REPO, tag);
    if (res < 0 || res >= (int)sizeof(api_url)) {
        return ESP_ERR_INVALID_SIZE;
    }

    char *body = NULL;
    size_t body_len = 0;
    esp_err_t err = ota_http_get(api_url, &body, &body_len);
    if (err != ESP_OK) {
        return err;
    }
    (void)body_len;

    cJSON *root = cJSON_Parse(body);
    if (!root) {
        free(body);
        return ESP_FAIL;
    }

    cJSON *tag_json = cJSON_GetObjectItem(root, "tag_name");
    cJSON *assets = cJSON_GetObjectItem(root, "assets");
    if (!cJSON_IsString(tag_json) || !cJSON_IsArray(assets)) {
        cJSON_Delete(root);
        free(body);
        return ESP_FAIL;
    }

    cJSON *asset = NULL;
    cJSON_ArrayForEach(asset, assets) {
        cJSON *name = cJSON_GetObjectItem(asset, "name");
        if (cJSON_IsString(name) && strcmp(name->valuestring, OTA_ASSET_NAME) == 0) {
            break;
        }
    }

    if (!asset) {
        MY_LOG_INFO(TAG, "OTA: asset %s not found for tag %s", OTA_ASSET_NAME, tag);
        cJSON_Delete(root);
        free(body);
        return ESP_ERR_NOT_FOUND;
    }

    cJSON *download = cJSON_GetObjectItem(asset, "browser_download_url");
    cJSON *size = cJSON_GetObjectItem(asset, "size");
    cJSON *updated = cJSON_GetObjectItem(asset, "updated_at");
    if (!cJSON_IsString(download)) {
        cJSON_Delete(root);
        free(body);
        return ESP_FAIL;
    }

    snprintf(tag_out, tag_len, "%s", tag_json->valuestring);
    snprintf(url_out, url_len, "%s", download->valuestring);
    if (cJSON_IsNumber(size)) {
        MY_LOG_INFO(TAG, "OTA: asset size=%lu bytes", (unsigned long)size->valuedouble);
    }
    if (cJSON_IsString(updated)) {
        MY_LOG_INFO(TAG, "OTA: asset updated_at=%s", updated->valuestring);
    }

    cJSON_Delete(root);
    free(body);
    return ESP_OK;
}

static esp_err_t ota_build_branch_url(char *url_out, size_t url_len) {
    /* Fork builds are published as versioned release assets, never mutable
     * binaries committed to a development branch. */
    MY_LOG_INFO(TAG, "OTA: development channel unavailable; select stable or a release tag");
    return ESP_ERR_NOT_SUPPORTED;
}

static bool ota_is_expected_project(const esp_app_desc_t *desc) {
    if (!desc) {
        return false;
    }

    if (strncmp(desc->project_name, OTA_PROJECT_NAME, sizeof(desc->project_name)) != 0) {
        MY_LOG_INFO(TAG, "OTA: unexpected project '%s'", desc->project_name);
        return false;
    }
    return true;
}

static void ota_log_resources(const char *phase) {
    MY_LOG_INFO(TAG, "OTA: %s heap internal=%lu psram=%lu stack_free=%u",
                phase ? phase : "resources",
                (unsigned long)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                (unsigned long)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
                (unsigned)uxTaskGetStackHighWaterMark(NULL));
}

static esp_err_t ota_perform_https_update(const char *download_url) {
    if (!download_url || !*download_url) {
        return ESP_ERR_INVALID_ARG;
    }

    ota_log_resources("before begin");
    esp_http_client_config_t http_cfg = {
        .url = download_url,
        .timeout_ms = 15000,
        .buffer_size = OTA_HTTP_RX_BUFFER_SIZE,
        .buffer_size_tx = OTA_HTTP_TX_BUFFER_SIZE,
        .crt_bundle_attach = esp_crt_bundle_attach,
    };
    esp_https_ota_config_t ota_cfg = {
        .http_config = &http_cfg,
    };

    esp_https_ota_handle_t ota_handle = NULL;
    esp_err_t err = esp_https_ota_begin(&ota_cfg, &ota_handle);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: begin failed: %s", esp_err_to_name(err));
        return err;
    }

    esp_app_desc_t app_desc = {0};
    err = esp_https_ota_get_img_desc(ota_handle, &app_desc);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: image desc failed: %s", esp_err_to_name(err));
        esp_https_ota_abort(ota_handle);
        return err;
    }

    MY_LOG_INFO(TAG, "OTA: image project=%s version=%s idf=%s",
                app_desc.project_name, app_desc.version, app_desc.idf_ver);
    if (!ota_is_expected_project(&app_desc)) {
        esp_https_ota_abort(ota_handle);
        return ESP_ERR_INVALID_STATE;
    }

    ota_log_resources("before perform");
    int last_pct = -1;
    int last_kb = -1;
    int last_read = -1;
    TickType_t last_progress_tick = xTaskGetTickCount();
    int image_size = esp_https_ota_get_image_size(ota_handle);
    while ((err = esp_https_ota_perform(ota_handle)) == ESP_ERR_HTTPS_OTA_IN_PROGRESS) {
        int read = esp_https_ota_get_image_len_read(ota_handle);
        int pct = (image_size > 0) ? ((read * 100) / image_size) : -1;
        int kb = read / 1024;
        if (read > last_read) {
            last_read = read;
            last_progress_tick = xTaskGetTickCount();
        } else if ((xTaskGetTickCount() - last_progress_tick) > pdMS_TO_TICKS(60000)) {
            MY_LOG_INFO(TAG, "OTA: download stalled at %d/%d bytes", read, image_size);
            esp_https_ota_abort(ota_handle);
            return ESP_ERR_TIMEOUT;
        }
        if ((pct >= 0 && pct >= last_pct + 10) || kb >= last_kb + 256) {
            if (pct >= 0) {
                MY_LOG_INFO(TAG, "OTA: progress %d%% (%d/%d bytes)", pct, read, image_size);
            } else {
                MY_LOG_INFO(TAG, "OTA: progress %d bytes", read);
            }
            last_pct = pct;
            last_kb = kb;
            ota_log_resources("during perform");
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: perform failed: %s", esp_err_to_name(err));
        esp_https_ota_abort(ota_handle);
        return err;
    }
    MY_LOG_INFO(TAG, "OTA: download complete (%d bytes)",
                esp_https_ota_get_image_len_read(ota_handle));
    ota_log_resources("before finish");

    if (!esp_https_ota_is_complete_data_received(ota_handle)) {
        MY_LOG_INFO(TAG, "OTA: incomplete image");
        esp_https_ota_abort(ota_handle);
        return ESP_FAIL;
    }

