Smethan/projectZero/ESP32C5/main/main.c
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && deauth_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (deauth_attack_task_handle != NULL) {
            vTaskDelete(deauth_attack_task_handle);
            deauth_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Deauth attack task forcefully stopped.");
        }
        
        // Restore LED to idle
        esp_err_t led_err = led_set_idle();
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to restore idle LED after stopping deauth: %s", esp_err_to_name(led_err));
        }
        
        MY_LOG_INFO(TAG, "Deauth attack stopped.");
    }

    //Now, let's check if it's a password for Evil Twin:
    applicationState = EVIL_TWIN_PASS_CHECK;

    //set up STA properties and try to connect to a network:
    wifi_config_t sta_config = { 0 };  
    strncpy((char *)sta_config.sta.ssid, evilTwinSSID, sizeof(sta_config.sta.ssid));
    sta_config.sta.ssid[sizeof(sta_config.sta.ssid) - 1] = '\0'; // null-terminate
    strncpy((char *)sta_config.sta.password, password, sizeof(sta_config.sta.password));
    sta_config.sta.password[sizeof(sta_config.sta.password) - 1] = '\0'; // null-terminate
    esp_wifi_set_config(WIFI_IF_STA, &sta_config);
    vTaskDelay(pdMS_TO_TICKS(500));
    MY_LOG_INFO(TAG, "Attempting to connect to SSID='%s' with password='%s'", evilTwinSSID, password);
    connectAttemptCount = 0;
    MY_LOG_INFO(TAG, "Attempting to connect, connectAttemptCount=%d", connectAttemptCount);
    esp_wifi_connect();
}

static void ota_load_channel_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(OTA_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return;
    }

    size_t len = sizeof(ota_channel);
    err = nvs_get_str(handle, OTA_NVS_KEY_CHANNEL, ota_channel, &len);
    if (err != ESP_OK) {
        nvs_close(handle);
        return;
    }

    if (strcasecmp(ota_channel, "main") != 0 && strcasecmp(ota_channel, "dev") != 0) {
        snprintf(ota_channel, sizeof(ota_channel), "main");
    }

    nvs_close(handle);
}

static bool ota_save_channel_to_nvs(const char *channel) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(OTA_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return false;
    }

    err = nvs_set_str(handle, OTA_NVS_KEY_CHANNEL, channel);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err == ESP_OK;
}

// --------------- WPA-SEC NVS helpers ---------------

static void wpasec_load_key_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WPASEC_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return;
    }

    size_t len = sizeof(wpasec_api_key);
    err = nvs_get_str(handle, WPASEC_NVS_KEY, wpasec_api_key, &len);
    if (err != ESP_OK) {
        wpasec_api_key[0] = '\0';
    }
    nvs_close(handle);
}

static bool wpasec_save_key_to_nvs(const char *key) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WPASEC_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return false;
    }

    err = nvs_set_str(handle, WPASEC_NVS_KEY, key);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err == ESP_OK;
}

static void wigle_load_key_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WIGLE_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return;
    }

    size_t name_len = sizeof(wigle_api_name);
    size_t token_len = sizeof(wigle_api_token);
    err = nvs_get_str(handle, WIGLE_NVS_KEY_NAME, wigle_api_name, &name_len);
    if (err != ESP_OK) {
        wigle_api_name[0] = '\0';
    }
    err = nvs_get_str(handle, WIGLE_NVS_KEY_TOKEN, wigle_api_token, &token_len);
    if (err != ESP_OK) {
        wigle_api_token[0] = '\0';
    }
    nvs_close(handle);
}

static bool wigle_save_key_to_nvs(const char *api_name, const char *api_token) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WIGLE_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return false;
    }

    err = nvs_set_str(handle, WIGLE_NVS_KEY_NAME, api_name);
    if (err == ESP_OK) {
        err = nvs_set_str(handle, WIGLE_NVS_KEY_TOKEN, api_token);
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err == ESP_OK;
}

static bool wigle_clear_key_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WIGLE_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (err != ESP_OK) {
        return false;
    }

    esp_err_t err_name = nvs_erase_key(handle, WIGLE_NVS_KEY_NAME);
    esp_err_t err_token = nvs_erase_key(handle, WIGLE_NVS_KEY_TOKEN);
    if (err_name == ESP_ERR_NVS_NOT_FOUND) err_name = ESP_OK;
    if (err_token == ESP_ERR_NVS_NOT_FOUND) err_token = ESP_OK;

    err = (err_name == ESP_OK && err_token == ESP_OK) ? nvs_commit(handle) : ESP_FAIL;
    nvs_close(handle);
    return err == ESP_OK;
}

static void wdgwars_load_key_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WDGWARS_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return;
    }

    size_t len = sizeof(wdgwars_api_key);
    err = nvs_get_str(handle, WDGWARS_NVS_KEY, wdgwars_api_key, &len);
    if (err != ESP_OK) {
        wdgwars_api_key[0] = '\0';
    }
    nvs_close(handle);
}

static bool wdgwars_save_key_to_nvs(const char *key) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WDGWARS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return false;
    }

    err = nvs_set_str(handle, WDGWARS_NVS_KEY, key);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err == ESP_OK;
}

static bool wdgwars_clear_key_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WDGWARS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (err != ESP_OK) {
        return false;
    }

    err = nvs_erase_key(handle, WDGWARS_NVS_KEY);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        err = ESP_OK;
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err == ESP_OK;
}

