Smethan/projectZero/ESP32C5/main/main.c
static bool wigle_load_key_from_sd(void) {
    FILE *wf = fopen("/sdcard/lab/wigle.txt", "r");
    if (!wf) {
        return false;
    }

    char line[256] = {0};
    char api_name[WIGLE_KEY_MAX_LEN] = {0};
    char api_token[WIGLE_KEY_MAX_LEN] = {0};
    bool loaded = false;

    if (fgets(line, sizeof(line), wf) &&
        wigle_split_key_pair(line, api_name, sizeof(api_name), api_token, sizeof(api_token))) {
        snprintf(wigle_api_name, sizeof(wigle_api_name), "%s", api_name);
        snprintf(wigle_api_token, sizeof(wigle_api_token), "%s", api_token);
        MY_LOG_INFO(TAG, "WiGLE key loaded from SD for this session.");
        loaded = true;
    } else {
        MY_LOG_INFO(TAG, "Invalid /sdcard/lab/wigle.txt format. Expected: api_name:api_token");
    }

    fclose(wf);
    return loaded;
}

static bool wdgwars_load_key_from_sd(void) {
    FILE *wf = fopen("/sdcard/lab/wdgwars.txt", "r");
    if (!wf) {
        return false;
    }

    char line[128] = {0};
    bool loaded = false;

    if (fgets(line, sizeof(line), wf)) {
        size_t ln = strlen(line);
        while (ln > 0 && (line[ln - 1] == '\n' || line[ln - 1] == '\r' || isspace((unsigned char)line[ln - 1]))) {
            line[--ln] = '\0';
        }
        char *start = line;
        while (*start && isspace((unsigned char)*start)) {
            start++;
        }
        if (start[0] != '\0' && strlen(start) < WDGWARS_KEY_MAX_LEN) {
            strncpy(wdgwars_api_key, start, sizeof(wdgwars_api_key) - 1);
            wdgwars_api_key[sizeof(wdgwars_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key loaded from SD for this session.");
            loaded = true;
        } else if (start[0] != '\0') {
            MY_LOG_INFO(TAG, "Invalid /sdcard/lab/wdgwars.txt format. Expected one API key (max %d chars).",
                        WDGWARS_KEY_MAX_LEN - 1);
        }
    }

    fclose(wf);
    return loaded;
}

// ---------------------------------------------------

static void ota_mark_valid_if_pending(void) {
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (!running) {
        return;
    }

    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    esp_err_t err = esp_ota_get_state_partition(running, &state);
    if (err != ESP_OK) {
        return;
    }

    if (state == ESP_OTA_IMG_PENDING_VERIFY) {
        MY_LOG_INFO(TAG, "OTA: pending verify on %s, marking app valid", running->label);
        err = esp_ota_mark_app_valid_cancel_rollback();
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "OTA: mark valid failed: %s", esp_err_to_name(err));
        } else {
            MY_LOG_INFO(TAG, "OTA: app marked valid");
        }
    } else {
        MY_LOG_INFO(TAG, "OTA: running state=%d, no mark needed", (int)state);
    }
}

static void ota_log_boot_info(void) {
    /*const esp_partition_t *boot = */esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
    const esp_partition_t *invalid = esp_ota_get_last_invalid_partition();
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;

    if (running) {
        esp_err_t err = esp_ota_get_state_partition(running, &state);
        if (err != ESP_OK) {
            state = ESP_OTA_IMG_UNDEFINED;
        }
    }

    MY_LOG_INFO(TAG, "OTA: run=%s state=%d next=%s",
                running ? running->label : "n/a",
                (int)state,
                next ? next->label : "n/a");
    if (invalid) {
        MY_LOG_INFO(TAG, "OTA: last invalid partition=%s offset=0x%lx",
                    invalid->label,
                    (unsigned long)invalid->address);
        MY_LOG_INFO(TAG, "OTA: rollback detected (booted from %s)",
                    running ? running->label : "n/a");
    }
}

// --- Wi-Fi initialization (STA only - uses less memory) ---
// AP mode will be enabled dynamically when needed (Evil Twin, Portal)
static esp_err_t wifi_init_ap_sta(void) {
    esp_err_t ret = ESP_OK;
    bool driver_ready = false, new_sta = false;
    capture_memory_log("wifi_init_begin");
    /* These operations allocate memory. Return failures to the caller instead
     * of converting an ordinary low-memory condition into a panic/reboot. */
#define WIFI_TRY(operation) do { \
    ret = (operation); \
    if (ret != ESP_OK) { \
        ESP_LOGE(TAG, "%s failed: %s", #operation, esp_err_to_name(ret)); \
        goto failed; \
    } \
} while (0)
    if (!netif_initialized) {
        WIFI_TRY(esp_netif_init());
        netif_initialized = true;
    }
    if (!event_loop_initialized) {
        WIFI_TRY(esp_event_loop_create_default());
        event_loop_initialized = true;
    }
    if (sta_netif_handle == NULL) {
        /* The default convenience constructor asserts on allocation failure.
         * Use its underlying public APIs with explicit cleanup instead. */
        esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_WIFI_STA();
        sta_netif_handle = esp_netif_new(&netif_cfg);
        if (!sta_netif_handle) { ret = ESP_ERR_NO_MEM; goto failed; }
        new_sta = true;
        WIFI_TRY(esp_netif_attach_wifi_station(sta_netif_handle));
        WIFI_TRY(esp_wifi_set_default_wifi_sta_handlers());
    }
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    WIFI_TRY(esp_wifi_init(&cfg));
    driver_ready = true;
    if (!wifi_event_handler_registered) {
        WIFI_TRY(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                      &wifi_event_handler, NULL, NULL));
        wifi_event_handler_registered = true;
    }
    if (!ip_event_handler_registered) {
        WIFI_TRY(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                                      &ip_event_handler, NULL, NULL));
        ip_event_handler_registered = true;
    }
    wifi_config_t wifi_config = { 0 };
    WIFI_TRY(esp_wifi_set_mode(WIFI_MODE_STA));
    WIFI_TRY(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    WIFI_TRY(esp_wifi_start());
#undef WIFI_TRY
    uint8_t mac[6];
    if (esp_wifi_get_mac(WIFI_IF_STA, mac) == ESP_OK) {
        MY_LOG_INFO("MAC", "MAC Address: %02X:%02X:%02X:%02X:%02X:%02X",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    }
    capture_memory_log("wifi_init_ready");
    return ESP_OK;

failed:
    if (driver_ready) { esp_wifi_stop(); esp_wifi_deinit(); }
    if (new_sta) {
        esp_netif_destroy_default_wifi(sta_netif_handle);
        sta_netif_handle = NULL;
    }
    capture_memory_log("wifi_init_failed");
    ESP_LOGE(TAG, "WiFi initialization failed: %s; retry after freeing resources", esp_err_to_name(ret));
    return ret;
}

