Smethan/projectZero/ESP32C5/main/main.c
static esp_err_t wifi_apply_extended_country(void)
{
    wifi_country_t wifi_country = {
        .cc = "PH",
        .schan = 1,
        .nchan = 14,
        .policy = WIFI_COUNTRY_POLICY_AUTO,
    };

    esp_err_t err = esp_wifi_set_country(&wifi_country);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set WiFi country for channels 1-13: %s", esp_err_to_name(err));
    }
    return err;
}

static void wifi_get_24ghz_channel_bounds(uint8_t *first_channel, uint8_t *last_channel)
{
    uint8_t first = 1;
    uint8_t last = 11;
    wifi_country_t wifi_country = { 0 };

    if (esp_wifi_get_country(&wifi_country) == ESP_OK && wifi_country.nchan > 0) {
        int country_first = wifi_country.schan;
        int country_last = wifi_country.schan + wifi_country.nchan - 1;

        if (country_first < 1) {
            country_first = 1;
        }
        if (country_last > 13) {
            country_last = 13;
        }
        if (country_first <= country_last) {
            first = (uint8_t)country_first;
            last = (uint8_t)country_last;
        }
    }

    if (first_channel != NULL) {
        *first_channel = first;
    }
    if (last_channel != NULL) {
        *last_channel = last;
    }
}

// ============================================================================
// Radio Mode Switching (lazy initialization)
// ============================================================================

/**
 * Ensure WiFi mode is active. If BLE is active, reboots to switch.
 * Returns true if WiFi is ready to use, false if switching (will reboot).
 */
static bool ensure_wifi_mode(void)
{
    switch (current_radio_mode) {
        case RADIO_MODE_WIFI:
            // Already in WiFi mode
            return true;
            
        case RADIO_MODE_NONE:
            // Initialize WiFi
            MY_LOG_INFO(TAG, "Initializing WiFi...");
            esp_err_t ret = wifi_init_ap_sta();
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "WiFi init failed: %d", ret);
                return false;
            }
            
            wifi_apply_extended_country();
            
            current_radio_mode = RADIO_MODE_WIFI;
            wifi_initialized = true;
            MY_LOG_INFO(TAG, "WiFi initialized OK");
            return true;
            
        case RADIO_MODE_BLE:
            // Deinitialize BLE and switch to WiFi
            MY_LOG_INFO(TAG, "Switching from BLE to WiFi mode...");
            bt_nimble_deinit();
            current_radio_mode = RADIO_MODE_NONE;
            // Now initialize WiFi (recursive call with RADIO_MODE_NONE)
            return ensure_wifi_mode();

        case RADIO_MODE_IEEE802154:
            MY_LOG_INFO(TAG, "Switching from 802.15.4 to WiFi mode...");
            zig_recon_stop();
            current_radio_mode = RADIO_MODE_NONE;
            return ensure_wifi_mode();
    }
    return false;
}

/**
 * Wait for an in-progress WiFi scan to finish cleanly before tearing down the
 * WiFi driver for a radio-mode switch. If the scan does not complete within the
 * timeout, cancel it cleanly (esp_wifi_scan_stop) without emitting the
 * misleading "Scan failed with status: 1" log.
 */
static void wait_or_cancel_wifi_scan(void)
{
    if (!g_scan_in_progress) {
        return;
    }

    MY_LOG_INFO(TAG, "Waiting for in-progress WiFi scan to finish before switching radio...");

    int timeout = 0;
    int timeout_limit = get_scan_timeout_iterations();
    while (g_scan_in_progress && timeout < timeout_limit) {
        vTaskDelay(pdMS_TO_TICKS(100));
        timeout++;
    }

    if (g_scan_in_progress) {
        // Scan did not finish in time: cancel it cleanly, suppressing the failure log.
        g_scan_teardown_in_progress = true;
        esp_wifi_scan_stop();
        int extra = 0;
        while (g_scan_in_progress && extra < 20) {
            vTaskDelay(pdMS_TO_TICKS(50));
            extra++;
        }
        g_scan_in_progress = false;
        g_scan_teardown_in_progress = false;
    }
}

/**
 * Ensure BLE mode is active. If WiFi is active, deinits WiFi first.
 * Returns true if BLE is ready to use, false if switching (will reboot).
 */
static bool ensure_ble_mode(void)
{
    switch (current_radio_mode) {
        case RADIO_MODE_BLE:
            // Already in BLE mode
            return true;
            
        case RADIO_MODE_NONE:
            // Initialize BLE
            MY_LOG_INFO(TAG, "Initializing BLE (NimBLE)...");
            esp_err_t ret = bt_nimble_init();
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "BLE init failed: %d", ret);
                return false;
            }
            current_radio_mode = RADIO_MODE_BLE;
            MY_LOG_INFO(TAG, "BLE initialized OK");
            return true;
            
        case RADIO_MODE_WIFI: {
            // Deinitialize WiFi and switch to BLE
            MY_LOG_INFO(TAG, "Switching from WiFi to BLE mode...");
            wait_or_cancel_wifi_scan();
            esp_wifi_stop();
            esp_wifi_deinit();
            // Only destroy AP netif, keep STA netif for reuse on WiFi re-init
            esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
            if (ap_netif) {
                esp_netif_destroy(ap_netif);
            }
            // Note: sta_netif_handle is preserved for WiFi re-initialization
            wifi_initialized = false;
            current_radio_mode = RADIO_MODE_NONE;
            // Now initialize BLE (recursive call with RADIO_MODE_NONE)
            return ensure_ble_mode();
        }

        case RADIO_MODE_IEEE802154:
            MY_LOG_INFO(TAG, "Switching from 802.15.4 to BLE mode...");
            zig_recon_stop();
            current_radio_mode = RADIO_MODE_NONE;
            return ensure_ble_mode();
    }
    return false;
}

static bool ensure_ieee802154_mode(void)
{
    switch (current_radio_mode) {
        case RADIO_MODE_IEEE802154:
            return true;

        case RADIO_MODE_NONE:
            current_radio_mode = RADIO_MODE_IEEE802154;
            return true;

        case RADIO_MODE_WIFI: {
            MY_LOG_INFO(TAG, "Switching from WiFi to 802.15.4 mode...");
            wait_or_cancel_wifi_scan();
            esp_wifi_stop();
            esp_wifi_deinit();
            esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
            if (ap_netif) {
                esp_netif_destroy(ap_netif);
            }
            ap_netif_handle = NULL;
            wifi_initialized = false;
            current_radio_mode = RADIO_MODE_IEEE802154;
            return true;
        }

        case RADIO_MODE_BLE:
            MY_LOG_INFO(TAG, "Switching from BLE to 802.15.4 mode...");
            bt_nimble_deinit();
            current_radio_mode = RADIO_MODE_IEEE802154;
            return true;
    }
    return false;
}

/**
 * Enable AP mode (switch to APSTA if needed) for Evil Twin, Portal, etc.
 * Must be called after ensure_wifi_mode().
 * Returns the AP netif handle, or NULL on failure.
 */
static esp_netif_t *ensure_ap_mode(void)
{
    if (current_radio_mode != RADIO_MODE_WIFI) {
        MY_LOG_INFO(TAG, "WiFi must be initialized first");
        return NULL;
    }
    
