Smethan/projectZero/ESP32C5/main/main.c
    // Check if AP netif already exists
    esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
    if (ap_netif) {
        wifi_mode_t mode = WIFI_MODE_NULL;
        if (esp_wifi_get_mode(&mode) == ESP_OK) {
            if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA) {
                return ap_netif;
            }
        }
        // AP netif exists but mode is not AP/APSTA, re-enable AP mode.
        MY_LOG_INFO(TAG, "Re-enabling AP mode...");
        esp_wifi_stop();
        esp_err_t ret = esp_wifi_set_mode(WIFI_MODE_APSTA);
        if (ret != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to set APSTA mode: %s", esp_err_to_name(ret));
            esp_wifi_start();
            return NULL;
        }
        ret = esp_wifi_start();
        if (ret != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to restart WiFi: %s", esp_err_to_name(ret));
            return NULL;
        }
        return ap_netif;
    }
    
    // Need to stop WiFi, switch mode, and restart
    MY_LOG_INFO(TAG, "Enabling AP mode...");
    
    esp_wifi_stop();
    
    // Create AP netif
    ap_netif_handle = esp_netif_create_default_wifi_ap();
    if (!ap_netif_handle) {
        MY_LOG_INFO(TAG, "Failed to create AP netif");
        esp_wifi_start();
        return NULL;
    }
    
    // Switch to APSTA mode
    esp_err_t ret = esp_wifi_set_mode(WIFI_MODE_APSTA);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set APSTA mode: %s", esp_err_to_name(ret));
        esp_wifi_start();
        return NULL;
    }
    
    // Configure minimal AP to start
    wifi_config_t ap_config = {
        .ap = {
            .ssid = "",
            .ssid_len = 0,
            .ssid_hidden = 1,
            .password = "nevermind",
            .max_connection = 0,
            .authmode = WIFI_AUTH_WPA2_PSK
        },
    };
    esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    
    ret = esp_wifi_start();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to restart WiFi: %s", esp_err_to_name(ret));
        return NULL;
    }
    
    MY_LOG_INFO(TAG, "AP mode enabled");
    return ap_netif_handle;
}

// ============================================================================

// --- Start background scan ---
static esp_err_t start_background_scan(uint32_t min_time, uint32_t max_time) {
    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start background scan: wardrive is active. Use 'stop' first.");
        return ESP_ERR_INVALID_STATE;
    }

    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan already in progress");
        return ESP_ERR_INVALID_STATE;
    }
    
    wifi_scan_config_t scan_cfg = {
        .ssid = NULL,
        .bssid = NULL,
        .channel = 0,
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
        .scan_time.active.min = min_time,
        .scan_time.active.max = max_time,
    };
    
    g_scan_in_progress = true;
    g_scan_done = false;
    g_scan_count = 0;
    g_scan_start_time_us = esp_timer_get_time(); // reset start timestamp for every scan path (sniffer, channel view, etc.)
    
    MY_LOG_INFO(TAG, "Starting background WiFi scan...");
    esp_err_t ret = esp_wifi_scan_start(&scan_cfg, false); // nieblokujace
    
    if (ret != ESP_OK) {
        g_scan_in_progress = false;
        MY_LOG_INFO(TAG, "Failed to start scan: %s", esp_err_to_name(ret));
        return ret;
    }
    
    return ESP_OK;
}

// Save target BSSIDs for channel monitoring
static void save_target_bssids(void) {
    target_bssid_count = 0;
    
    for (int i = 0; i < g_selected_count && target_bssid_count < MAX_TARGET_BSSIDS; ++i) {
        int idx = g_selected_indices[i];
        wifi_ap_record_t *ap = &g_scan_results[idx];
        
        target_bssids[target_bssid_count].channel = ap->primary;
        target_bssids[target_bssid_count].last_seen = esp_timer_get_time() / 1000;
        target_bssids[target_bssid_count].active = true;
        
        // Copy BSSID
        memcpy(target_bssids[target_bssid_count].bssid, ap->bssid, 6);
        
        // Copy SSID
        strncpy(target_bssids[target_bssid_count].ssid, (const char*)ap->ssid, 32);
        target_bssids[target_bssid_count].ssid[32] = '\0';
        
        target_bssid_count++;
    }
    
    // Debug: Print saved target BSSIDs
    for (int i = 0; i < target_bssid_count; ++i) {
        MY_LOG_INFO(TAG, "Target BSSID[%d]: %s, BSSID: %02X:%02X:%02X:%02X:%02X:%02X, Channel: %d", 
                   i, target_bssids[i].ssid,
                   target_bssids[i].bssid[0], target_bssids[i].bssid[1], target_bssids[i].bssid[2],
                   target_bssids[i].bssid[3], target_bssids[i].bssid[4], target_bssids[i].bssid[5],
                   target_bssids[i].channel);
    }
}

// Static buffer for quick scan to avoid stack overflow (smaller buffer for channel monitoring)
#define QUICK_SCAN_MAX_APS 32
static wifi_ap_record_t quick_scan_results[QUICK_SCAN_MAX_APS];

// Quick channel scan for target BSSIDs
static esp_err_t quick_channel_scan(void) {
    if (!periodic_rescan_in_progress) {
        MY_LOG_INFO(TAG, "Starting quick channel scan for target BSSIDs...");
    }
    
    // Use the main scanning function instead of quick scan
    esp_err_t err = start_background_scan(FAST_SCAN_MIN_TIME, FAST_SCAN_MAX_TIME);
    if (err != ESP_OK) {
        if (!periodic_rescan_in_progress) {
            MY_LOG_INFO(TAG, "Quick scan failed: %s", esp_err_to_name(err));
        }
        return err;
    }
    
    // Wait for scan to complete (dynamic timeout based on channel times)
    int timeout = 0;
    int timeout_limit = get_scan_timeout_iterations();
    while (g_scan_in_progress && timeout < timeout_limit) {
        vTaskDelay(pdMS_TO_TICKS(100));
        timeout++;
    }
    
    if (g_scan_in_progress) {
        if (!periodic_rescan_in_progress) {
            MY_LOG_INFO(TAG, "Scan taking longer than expected, waiting for completion...");
        }
        // Wait additional time for scan to complete naturally (up to 30 seconds)
        int extra_wait = 0;
        while (g_scan_in_progress && extra_wait < 300) {
            vTaskDelay(pdMS_TO_TICKS(100));
            extra_wait++;
        }
        // If still in progress after extra wait, then stop
        if (g_scan_in_progress) {
            if (!periodic_rescan_in_progress) {
                MY_LOG_INFO(TAG, "Scan still in progress, forcing stop...");
            }
            esp_wifi_scan_stop();
            g_scan_in_progress = false;
            return ESP_ERR_TIMEOUT;
        }
    }
    
    if (!g_scan_done || g_scan_count == 0) {
        if (!periodic_rescan_in_progress) {
            MY_LOG_INFO(TAG, "No scan results available");
        }
        return ESP_ERR_NOT_FOUND;
    }
    
    if (!periodic_rescan_in_progress) {
        MY_LOG_INFO(TAG, "Successfully retrieved %d scan records", g_scan_count);
    }
    
    // Copy scan results to our buffer
    uint16_t copy_count = (g_scan_count < QUICK_SCAN_MAX_APS) ? g_scan_count : QUICK_SCAN_MAX_APS;
    memcpy(quick_scan_results, g_scan_results, copy_count * sizeof(wifi_ap_record_t));
    
