Smethan/projectZero/ESP32C5/main/main.c
        if (escape_next) {
            escape_next = false;
        } else if (ch == '\\' && in_double_quote) {
            escape_next = true;
        } else if (ch == '"' && !in_single_quote) {
            in_double_quote = !in_double_quote;
        } else if (ch == '\'' && !in_double_quote) {
            in_single_quote = !in_single_quote;
        }

        bool at_end = (ch == '\0');
        bool at_separator = (ch == ',' && !in_single_quote && !in_double_quote);

        if (at_end && (in_single_quote || in_double_quote || escape_next)) {
            return false;
        }

        if (!at_separator && !at_end) {
            continue;
        }

        *cursor = '\0';
        char *segment = boot_trim_whitespace(segment_start);
        if (segment == NULL || segment[0] == '\0') {
            return false;
        }

        saw_command = true;
        if (!visitor(segment, ctx)) {
            return false;
        }

        if (at_end) {
            break;
        }

        segment_start = cursor + 1;
    }

    return saw_command;
}

typedef struct {
    char invalid_command[BOOTCFG_CMD_MAX_LEN];
} boot_flow_validation_ctx_t;

static bool boot_validate_command_segment(char *command_line, void *ctx) {
    boot_flow_validation_ctx_t *validation = (boot_flow_validation_ctx_t *)ctx;
    char *argv_local[16];
    size_t argc = esp_console_split_argv(command_line, argv_local, sizeof(argv_local) / sizeof(argv_local[0]));
    if (argc == 0) {
        return false;
    }

    if (!boot_is_command_allowed(argv_local[0])) {
        if (validation != NULL) {
            strlcpy(validation->invalid_command, argv_local[0], sizeof(validation->invalid_command));
        }
        return false;
    }

    return true;
}

static boot_flow_validation_result_t boot_validate_command_flow(const char *flow,
                                                               char *detail,
                                                               size_t detail_size) {
    if (detail != NULL && detail_size > 0) {
        detail[0] = '\0';
    }

    if (flow == NULL || flow[0] == '\0') {
        return BOOT_FLOW_MALFORMED;
    }

    char flow_copy[BOOTCFG_CMD_MAX_LEN];
    if (strlcpy(flow_copy, flow, sizeof(flow_copy)) >= sizeof(flow_copy)) {
        return BOOT_FLOW_MALFORMED;
    }

    boot_flow_validation_ctx_t validation = {0};
    if (!boot_visit_command_flow(flow_copy, boot_validate_command_segment, &validation)) {
        if (detail != NULL && detail_size > 0 && validation.invalid_command[0] != '\0') {
            strlcpy(detail, validation.invalid_command, detail_size);
            return BOOT_FLOW_INVALID_COMMAND;
        }
        return BOOT_FLOW_MALFORMED;
    }

    return BOOT_FLOW_VALID;
}

static void boot_config_set_defaults(void) {
    memset(&boot_config, 0, sizeof(boot_config));
    boot_config.short_press.enabled = false;
    strlcpy(boot_config.short_press.command, "start_sniffer_dog", sizeof(boot_config.short_press.command));
    boot_config.long_press.enabled = false;
    strlcpy(boot_config.long_press.command, "start_blackout", sizeof(boot_config.long_press.command));
}

static void boot_config_persist(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(BOOTCFG_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Boot cfg save open failed: %s", esp_err_to_name(err));
        return;
    }

    esp_err_t write_err = nvs_set_u8(handle, BOOTCFG_KEY_SHORT_EN, boot_config.short_press.enabled ? 1U : 0U);
    if (write_err == ESP_OK) {
        write_err = nvs_set_u8(handle, BOOTCFG_KEY_LONG_EN, boot_config.long_press.enabled ? 1U : 0U);
    }
    if (write_err == ESP_OK) {
        write_err = nvs_set_str(handle, BOOTCFG_KEY_SHORT_CMD, boot_config.short_press.command);
    }
    if (write_err == ESP_OK) {
        write_err = nvs_set_str(handle, BOOTCFG_KEY_LONG_CMD, boot_config.long_press.command);
    }
    if (write_err == ESP_OK) {
        write_err = nvs_commit(handle);
    }

    nvs_close(handle);

    if (write_err != ESP_OK) {
        ESP_LOGW(TAG, "Boot cfg save failed: %s", esp_err_to_name(write_err));
    }
}

static void boot_config_load_from_nvs(void) {
    boot_config_set_defaults();

    nvs_handle_t handle;
    esp_err_t err = nvs_open(BOOTCFG_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Boot cfg load open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t value = 0;
    err = nvs_get_u8(handle, BOOTCFG_KEY_SHORT_EN, &value);
    if (err == ESP_OK) {
        boot_config.short_press.enabled = value != 0;
    }

    value = 0;
    err = nvs_get_u8(handle, BOOTCFG_KEY_LONG_EN, &value);
    if (err == ESP_OK) {
        boot_config.long_press.enabled = value != 0;
    }

    size_t required = 0;
    err = nvs_get_str(handle, BOOTCFG_KEY_SHORT_CMD, NULL, &required);
    if (err == ESP_OK && required > 0 && required <= BOOTCFG_CMD_MAX_LEN) {
        err = nvs_get_str(handle, BOOTCFG_KEY_SHORT_CMD, boot_config.short_press.command, &required);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Boot cfg short cmd read failed: %s", esp_err_to_name(err));
        } else if (boot_validate_command_flow(boot_config.short_press.command, NULL, 0) != BOOT_FLOW_VALID) {
            ESP_LOGW(TAG, "Boot cfg short flow not allowed (%s), resetting", boot_config.short_press.command);
            strlcpy(boot_config.short_press.command, "start_sniffer_dog", sizeof(boot_config.short_press.command));
        }
    }

    required = 0;
    err = nvs_get_str(handle, BOOTCFG_KEY_LONG_CMD, NULL, &required);
    if (err == ESP_OK && required > 0 && required <= BOOTCFG_CMD_MAX_LEN) {
        err = nvs_get_str(handle, BOOTCFG_KEY_LONG_CMD, boot_config.long_press.command, &required);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Boot cfg long cmd read failed: %s", esp_err_to_name(err));
        } else if (boot_validate_command_flow(boot_config.long_press.command, NULL, 0) != BOOT_FLOW_VALID) {
            ESP_LOGW(TAG, "Boot cfg long flow not allowed (%s), resetting", boot_config.long_press.command);
            strlcpy(boot_config.long_press.command, "start_blackout", sizeof(boot_config.long_press.command));
        }
    }

    nvs_close(handle);
}

static void boot_config_print(void) {
    MY_LOG_INFO(TAG, "boot_short_status=%s", boot_config.short_press.enabled ? "on" : "off");
    MY_LOG_INFO(TAG, "boot_short=%s", boot_config.short_press.command);
    MY_LOG_INFO(TAG, "boot_long_status=%s", boot_config.long_press.enabled ? "on" : "off");
    MY_LOG_INFO(TAG, "boot_long=%s", boot_config.long_press.command);
}

