Smethan/projectZero/ESP32C5/main/main.c
    if (vendor_last_valid && memcmp(vendor_last_oui, bssid, 3) == 0) {
        return vendor_last_hit ? vendor_lookup_buffer : NULL;
    }

    ensure_vendor_file_checked();
    if (!vendor_file_present) {
        vendor_last_valid = false;
        return NULL;
    }

    FILE *file = fopen(SD_OUI_BIN_PATH, "rb");
    if (!file) {
        vendor_file_present = false;
        vendor_file_checked = false;
        vendor_last_valid = false;
        return NULL;
    }

    if (vendor_record_count == 0) {
        fclose(file);
        vendor_last_valid = false;
        return NULL;
    }

    size_t low = 0;
    size_t high = vendor_record_count;
    uint8_t record[VENDOR_RECORD_SIZE];
    bool found = false;
    while (low < high) {
        size_t mid = low + (high - low) / 2;
        long offset = (long)(mid * VENDOR_RECORD_SIZE);
        if (fseek(file, offset, SEEK_SET) != 0) {
            break;
        }
        if (fread(record, 1, VENDOR_RECORD_SIZE, file) != VENDOR_RECORD_SIZE) {
            break;
        }

        int cmp = memcmp(record, bssid, 3);
        if (cmp == 0) {
            uint8_t name_len = record[3];
            if (name_len > VENDOR_RECORD_NAME_BYTES) {
                name_len = VENDOR_RECORD_NAME_BYTES;
            }
            memcpy(vendor_lookup_buffer, &record[4], name_len);
            vendor_lookup_buffer[name_len] = '\0';
            memcpy(vendor_last_oui, bssid, 3);
            vendor_last_valid = true;
            vendor_last_hit = true;
            found = true;
            break;
        } else if (cmp < 0) {
            low = mid + 1;
        } else {
            high = mid;
        }
    }

    fclose(file);
    if (found) {
        return vendor_lookup_buffer;
    }

    memcpy(vendor_last_oui, bssid, 3);
    vendor_last_valid = true;
    vendor_last_hit = false;
    vendor_lookup_buffer[0] = '\0';
    return NULL;
}


static void print_network_csv(int index, const wifi_ap_record_t* ap) {
    char escaped_ssid[64];
    escape_csv_field((const char*)ap->ssid, escaped_ssid, sizeof(escaped_ssid));
    char escaped_vendor[64];
    const char *vendor_name = vendor_is_enabled() ? lookup_vendor_name(ap->bssid) : NULL;
    escape_csv_field(vendor_name ? vendor_name : "", escaped_vendor, sizeof(escaped_vendor));
    
    MY_LOG_INFO(TAG, "\"%d\",\"%s\",\"%s\",\"%02X:%02X:%02X:%02X:%02X:%02X\",\"%d\",\"%s\",\"%d\",\"%s\"",
                (index + 1),
                escaped_ssid,
                escaped_vendor,
                ap->bssid[0], ap->bssid[1], ap->bssid[2],
                ap->bssid[3], ap->bssid[4], ap->bssid[5],
                ap->primary,
                authmode_to_string(ap->authmode),
                ap->rssi,
                ap->primary <= 14 ? "2.4GHz" : "5GHz");
    vTaskDelay(pdMS_TO_TICKS(50));
}



static void print_scan_results(void) {
    //MY_LOG_INFO(TAG,"Index  RSSI  Auth  Channel  BSSID              SSID");
    for (int i = 0; i < g_scan_count; ++i) {
        wifi_ap_record_t *ap = &g_scan_results[i];
        // MY_LOG_INFO(TAG,"%5d  %4d  %4d  %5d  %02X:%02X:%02X:%02X:%02X:%02X  %s",
        //        i, ap->rssi, ap->authmode, ap->primary,
        //        ap->bssid[0], ap->bssid[1], ap->bssid[2],
        //        ap->bssid[3], ap->bssid[4], ap->bssid[5],
        //        (const char*)ap->ssid);
        // MY_LOG_INFO(TAG, "%-6d %-16s %02X:%02X:%02X:%02X:%02X:%02X   %-2d   %-4d   %s",
        //     (i+1),
        //     (const char*)ap->ssid,
        //     ap->bssid[0], ap->bssid[1], ap->bssid[2],
        //     ap->bssid[3], ap->bssid[4], ap->bssid[5],
        //     ap->primary,
        //     ap->rssi,
        //     ap->primary <= 14 ? "2.4GHz" : "5GHz");

        print_network_csv(i, ap);

    }
    MY_LOG_INFO(TAG, "Scan results printed.");
}

// --- OLED display helper functions ---

/**
 * Build a target summary for OLED line2.
 * 0 selected → "  No target"
 * 1 selected → ">> HomeNet"
 * 2 selected → ">> Net1, Net2"
 * 3+ selected → ">> Net1 +2 more"
 */
static void oled_build_target_summary(char *buf, size_t sz)
{
    if (g_selected_count == 0 || !g_scan_done) {
        snprintf(buf, sz, "  No target");
        return;
    }
    const char *first = (const char *)g_scan_results[g_selected_indices[0]].ssid;
    if (g_selected_count == 1) {
        snprintf(buf, sz, ">> %s", first);
    } else if (g_selected_count == 2) {
        const char *second = (const char *)g_scan_results[g_selected_indices[1]].ssid;
        snprintf(buf, sz, ">> %s, %s", first, second);
    } else {
        snprintf(buf, sz, ">> %s +%d more", first, g_selected_count - 1);
    }
}

/**
 * Build channel/auth info for OLED line3 from selected networks.
 * Single: "  Ch 6 WPA2 -45dB"
 * Multi:  "  Ch 1,6,11"
 */
static void oled_build_channel_info(char *buf, size_t sz)
{
    if (g_selected_count == 0 || !g_scan_done) {
        buf[0] = '\0';
        return;
    }
    if (g_selected_count == 1) {
        const wifi_ap_record_t *ap = &g_scan_results[g_selected_indices[0]];
        const char *auth = authmode_to_string(ap->authmode);
        snprintf(buf, sz, "  Ch %d %s %ddB", ap->primary, auth, ap->rssi);
    } else {
        int len = snprintf(buf, sz, "  Ch ");
        for (int i = 0; i < g_selected_count && len < (int)sz - 4; i++) {
            const wifi_ap_record_t *ap = &g_scan_results[g_selected_indices[i]];
            if (i > 0) len += snprintf(buf + len, sz - len, ",");
            len += snprintf(buf + len, sz - len, "%d", ap->primary);
        }
    }
}

// --- CLI: commands ---
static int cmd_scan_networks(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Scanning WiFi", "  All channels", "", "  Working...");
    log_memory_info("scan_networks");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' to stop it first before scanning.");
        return 1;
    }

    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    // Set LED (ignore errors if LED is in invalid state)
    esp_err_t led_err = led_set_color(0, 255, 0);
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for scan: %s", esp_err_to_name(led_err));
    }

    esp_err_t err = start_background_scan(g_scan_min_channel_time, g_scan_max_channel_time);
    
    if (err != ESP_OK) {
        // Return LED to idle when scan failed
        led_err = led_set_idle();
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to restore idle LED after scan failure: %s", esp_err_to_name(led_err));
        }
        
        if (err == ESP_ERR_INVALID_STATE) {
            MY_LOG_INFO(TAG, "Scan already in progress. Use 'show_scan_results' to see current results or 'stop' to cancel.");
        } else {
            ESP_LOGE(TAG, "Failed to start scan: %s", esp_err_to_name(err));
        }
        return 1;
    }
    
    // Start timestamp is set centrally in start_background_scan() so every scan path resets it.
    MY_LOG_INFO(TAG, "Background scan started (min: %u ms, max: %u ms per channel)", 
                (unsigned int)g_scan_min_channel_time, (unsigned int)g_scan_max_channel_time);
    return 0;
}

static int cmd_show_scan_results(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan still in progress... Please wait.");
        return 0;
    }
    
    if (!g_scan_done) {
        MY_LOG_INFO(TAG, "No scan has been performed yet. Use 'scan_networks' first.");
        return 0;
    }
    
    if (g_scan_count == 0) {
        MY_LOG_INFO(TAG, "No networks found in last scan.");
        return 0;
    }
    
    MY_LOG_INFO(TAG, "Showing results from last scan (%u networks found):", g_scan_count);
    print_scan_results();
    return 0;
}

// --- inspect_network: passively capture beacons and parse RSN IE (MFP) + TSF (uptime) ---

