Smethan/projectZero/ESP32C5/main/main.c
    if (current_gps.valid) {
        printf("%s,%s,[%s],%s,%d,%d,%.7f,%.7f,%.2f,%.2f,WIFI\n",
               mac_str, escaped_ssid, auth_str, timestamp,
               beacon_channel, (int)pkt->rx_ctrl.rssi,
               current_gps.latitude, current_gps.longitude,
               current_gps.altitude, current_gps.accuracy);
    } else {
        printf("%s,%s,[%s],%s,%d,%d,0.0000000,0.0000000,0.00,0.00,WIFI\n",
               mac_str, escaped_ssid, auth_str, timestamp,
               beacon_channel, (int)pkt->rx_ctrl.rssi);
    }
}

// Evict up to `target` of the oldest already-written (not pending) entries, compacting
// the array toward the front. Returns how many were freed.
// Safe to call ONLY with promiscuous disabled (mutates the array the callback reads).
static int wdp_evict_written_networks(int target) {
    int to_evict = target;
    int evicted = 0;
    int write_idx = 0;
    for (int read_idx = 0; read_idx < wdp_seen_count; read_idx++) {
        if (to_evict > 0 && !wdp_seen_networks[read_idx].needs_log) {
            to_evict--;
            evicted++;
            continue;  // drop this (oldest written) entry
        }
        if (write_idx != read_idx) {
            wdp_seen_networks[write_idx] = wdp_seen_networks[read_idx];
        }
        write_idx++;
    }
    wdp_seen_count = write_idx;
    return evicted;
}

static bool wdp_grow_network_buffer(void) {
    if (wdp_seen_capacity >= (int)g_wd_cfg.mem_cap) {
        return false;  // at the configured memory cap — caller evicts instead of growing
    }
    int new_capacity = wdp_seen_capacity * 2;
    if (new_capacity > (int)g_wd_cfg.mem_cap) new_capacity = (int)g_wd_cfg.mem_cap;
    size_t new_size = (size_t)new_capacity * sizeof(wdp_network_t);
    size_t free_psram = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);

    if (free_psram < new_size + WDP_PSRAM_RESERVE_BYTES) {
        MY_LOG_INFO(TAG, "Cannot grow wardrive buffer: only %u bytes free PSRAM (need %u + %u reserve)",
                    (unsigned)free_psram, (unsigned)new_size, (unsigned)WDP_PSRAM_RESERVE_BYTES);
        return false;
    }

    wdp_network_t *new_buf = heap_caps_realloc(wdp_seen_networks, new_size, MALLOC_CAP_SPIRAM);
    if (!new_buf) {
        MY_LOG_INFO(TAG, "Failed to realloc wardrive buffer to %d entries", new_capacity);
        return false;
    }

    memset(&new_buf[wdp_seen_capacity], 0, (size_t)(new_capacity - wdp_seen_capacity) * sizeof(wdp_network_t));
    wdp_seen_networks = new_buf;
    wdp_seen_capacity = new_capacity;
    wdp_needs_grow = false;

    MY_LOG_INFO(TAG, "Wardrive buffer grown to %d entries (%.1f KB PSRAM)",
                new_capacity, (float)new_size / 1024.0f);
    return true;
}

static void wardrive_promisc_task(void *pvParameters) {
    (void)pvParameters;

    MY_LOG_INFO(TAG, "Wardrive promisc task started.");
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    esp_err_t led_err = led_set_color(255, 0, 255); // Magenta
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for wardrive promisc: %s", esp_err_to_name(led_err));
    }

    int file_number = find_next_wardrive_file_number();
    MY_LOG_INFO(TAG, "Next wardrive file will be: w%d.log", file_number);
    double wdp_total_distance_m = 0.0;
    double wdp_last_trace_lat = 0.0;
    double wdp_last_trace_lon = 0.0;
    bool wdp_has_trace_point = false;

    if (wardrive_promisc_trace_enabled) {
        snprintf(wardrive_promisc_trace_path, sizeof(wardrive_promisc_trace_path),
                 "/sdcard/lab/wardrives/w%d_track.kml", file_number);
    } else {
        wardrive_promisc_trace_path[0] = '\0';
    }

    MY_LOG_INFO(TAG, "Waiting for GPS fix (no timeout - use 'stop' to cancel)...");
    oled_display_update_full("> Wardrive Pro", "  Waiting GPS...", "  No timeout", "  Use 'stop'");
    if (!wait_for_gps_fix(0)) {
        MY_LOG_INFO(TAG, "Warning: No GPS fix obtained, not continuing without GPS data - please ensure clear view of the sky and try again.");
        oled_display_update_full("> Wardrive Pro", "  No GPS fix!", "  Stopping...", "");
        goto cleanup;
    }
    MY_LOG_INFO(TAG, "GPS fix obtained: Lat=%.7f Lon=%.7f",
                current_gps.latitude, current_gps.longitude);
    oled_display_update_full("> Wardrive Pro", "  GPS fix OK!", "  D-UCB scanning", "");

    if (wardrive_promisc_trace_enabled) {
        if (wardrive_trace_init_file(wardrive_promisc_trace_path)) {
            wardrive_trace_append_point(wardrive_promisc_trace_path,
                                        current_gps.latitude,
                                        current_gps.longitude,
                                        current_gps.altitude);
            wdp_last_trace_lat = current_gps.latitude;
            wdp_last_trace_lon = current_gps.longitude;
            wdp_has_trace_point = true;
            MY_LOG_INFO(TAG, "Wardrive trace enabled: %s", wardrive_promisc_trace_path);
        } else {
            MY_LOG_INFO(TAG, "Failed to create wardrive trace file: %s", wardrive_promisc_trace_path);
            wardrive_promisc_trace_enabled = false;
            wardrive_promisc_trace_path[0] = '\0';
        }
    }

    wdp_seen_count = 0;
    wdp_dwell_new_networks = 0;
    wdp_needs_grow = false;
    wdp_relog_pending = false;
    wdp_relog_writes = 0;
    memset(wdp_seen_networks, 0, (size_t)wdp_seen_capacity * sizeof(wdp_network_t));
    wdp_ducb_init(&g_wd_cfg);

    // No WiFi channels selected => BLE-only mode (no promiscuous, no channel hop).
    const bool wifi_scan_enabled = (wdp_ducb_channel_count > 0);

    if (wifi_scan_enabled) {
        // Match the band mode to the selected bands so set_channel can reach 5 GHz.
        // 2.4+5 must be AUTO; single-band uses the dedicated mode (less RF overhead).
        const bool want_24 = (g_wd_cfg.bands & WD_BAND_24) != 0;
        const bool want_5  = (g_wd_cfg.bands & WD_BAND_5) != 0;
        wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
        if (want_24 && want_5)  band_mode = WIFI_BAND_MODE_AUTO;
        else if (want_5)        band_mode = WIFI_BAND_MODE_5G_ONLY;
        else                    band_mode = WIFI_BAND_MODE_2G_ONLY;
        esp_err_t bm_err = esp_wifi_set_band_mode(band_mode);
        if (bm_err != ESP_OK) {
            MY_LOG_INFO(TAG, "esp_wifi_set_band_mode(%d) failed: %s (continuing)",
                        (int)band_mode, esp_err_to_name(bm_err));
        }

        wifi_promiscuous_filter_t filter = {
            .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
        };
        esp_wifi_set_promiscuous_filter(&filter);
        esp_wifi_set_promiscuous_rx_cb(wdp_promiscuous_cb);
        esp_wifi_set_promiscuous(true);
    }

    {
        char wd_bands[24];
        wardrive_config_format_bands(wd_bands, sizeof(wd_bands));
        MY_LOG_INFO(TAG, "Promiscuous wardrive started. Bands: %s, WiFi channels: %d%s",
                    wd_bands, wdp_ducb_channel_count,
                    wifi_scan_enabled ? "" : " (BLE-only mode)");
    }
    MY_LOG_INFO(TAG, "Use 'stop' command to stop.");

    // Start BLE scanning in background (coexistence handled by ESP-IDF)
    bt_reset_counters();
    bool wdp_bt_enabled = nimble_initialized && (g_wd_cfg.bands & WD_BAND_BLE);
    bool wdp_bt_running = false;
    if (wdp_bt_enabled) {
        wdp_bt_running = (bt_start_scan_coex() == 0);
    }
    int wdp_bt_flush_count = 0;
    if (wdp_bt_running) {
        MY_LOG_INFO(TAG, "BLE scan started alongside WiFi promiscuous capture.");
    } else {
        MY_LOG_INFO(TAG, "BLE scan unavailable, logging WiFi only.");
        wdp_bt_enabled = false;
    }

    int64_t last_stats_time = esp_timer_get_time();
    int last_flush_count = 0;
    int gps_fix_lost_count = 0;
    #define WDP_GPS_FIX_LOST_THRESHOLD 3

