Smethan/projectZero/ESP32C5/main/main.c
/* WDG already stops before starting; also support direct serial commands.
 * Quiesce operations without tearing down a healthy Wi-Fi driver a second time. */
bool sw_prepare(void) {
    /* Initialize the radio before allocating capture buffers/task stacks. */
    return stop_operations(false) == 0 && ensure_wifi_mode();
}
static wifi_band_mode_t sw_saved_band;
static wifi_promiscuous_filter_t sw_saved_filter;
static bool sw_saved_radio;
static wifi_mode_t sw_saved_mode;
bool sw_radio_start(void) {
    /* Console ownership gate prevents new operations during this transition. */
    if (wardrive_active || wardrive_promisc_active || bt_scan_active ||
        handshake_attack_active || antisurv_active) return false;
    if (!ensure_wifi_mode()) return false;
    if (esp_wifi_get_band_mode(&sw_saved_band) != ESP_OK ||
        esp_wifi_get_promiscuous_filter(&sw_saved_filter) != ESP_OK ||
        esp_wifi_get_mode(&sw_saved_mode) != ESP_OK) return false;
    sw_saved_radio = true;
    if (sw_wifi_only_mode()) {
        /* NULL mode has no STA/AP traffic: no probes, association or deauth.
         * The serial ownership gate keeps other radio commands out. */
        if (nimble_initialized) bt_stop_scan();
        if (esp_wifi_set_mode(WIFI_MODE_NULL) != ESP_OK) return false;
    }
    if (esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO) != ESP_OK) return false;
    if (sw_wifi_only_mode()) return true;
    if (bt_nimble_init() != ESP_OK) return false;
    return bt_start_scan_coex() == 0;
}
void sw_radio_hop(unsigned index) {
    static const uint8_t channels[] = {1,6,11,2,3,4,5,7,8,9,10,12,13,
        36,40,44,48,52,56,60,64,100,104,108,112,116,120,124,128,132,136,140,144,149,153,157,161,165};
    esp_wifi_set_channel(channels[index % sizeof(channels)], WIFI_SECOND_CHAN_NONE);
}
void sw_radio_stop(void) {
    if (!sw_saved_radio) return;
    esp_wifi_set_promiscuous(false);
    esp_wifi_set_promiscuous_rx_cb(NULL);
    if (nimble_initialized) bt_stop_scan();
    esp_wifi_set_promiscuous_filter(&sw_saved_filter);
    esp_wifi_set_band_mode(sw_saved_band);
    if (sw_wifi_only_mode()) esp_wifi_set_mode(sw_saved_mode);
    sw_saved_radio = false;
}

static int cmd_start_wardrive_promisc_impl(int argc, char **argv, bool trace_enabled) {
    (void)argc; (void)argv;
    wardrive_promisc_trace_enabled = trace_enabled;

    {
        // Config loaded at boot; log active settings. Bands/channels are now applied
        // in the task (wdp_ducb_init + band mode); deltas/cooldown wired in later steps.
        char wd_bands[24];
        wardrive_config_format_bands(wd_bands, sizeof(wd_bands));
        const char *wd_chmode = (g_wd_cfg.ch_mode == WD_CH_POPULAR) ? "popular" :
                                (g_wd_cfg.ch_mode == WD_CH_CUSTOM)  ? "custom"  : "all";
        MY_LOG_INFO(TAG, "Wardrive config: bands=%s channels=%s wifi_delta=%d ble_delta=%d cooldown=%us memcap=%u",
                    wd_bands, wd_chmode, g_wd_cfg.wifi_rssi_delta, g_wd_cfg.ble_rssi_delta,
                    (unsigned)g_wd_cfg.startup_cooldown_s, (unsigned)g_wd_cfg.mem_cap);
    }

    oled_display_update_full("> Wardrive Pro", "  Promiscuous", "  GPS + SD log", "  Active...");
    log_memory_info("start_wardrive_promisc");

    if (!ensure_wifi_mode()) {
        return 1;
    }

    if (wardrive_promisc_active || wardrive_promisc_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Wardrive promisc already running. Use 'stop' to stop it first.");
        return 1;
    }
    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start wardrive promisc while regular wardrive is running. Use 'stop' first.");
        return 1;
    }
    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start wardrive promisc while handshake attack is running. Use 'stop' first.");
        return 1;
    }
    if (gps_raw_active || gps_raw_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start wardrive promisc while GPS raw reader is running. Use 'stop' first.");
        return 1;
    }
    if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start wardrive promisc while BT scan is running. Use 'stop' first.");
        return 1;
    }

    operation_stop_requested = false;

    MY_LOG_INFO(TAG, "Starting promiscuous wardrive mode...");

    // Initialize NimBLE for BT scanning (idempotent if already initialized)
    esp_err_t bt_ret = bt_nimble_init();
    if (bt_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Warning: BLE init failed (%s) - wardrive will run without BT logging", esp_err_to_name(bt_ret));
    }

    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    esp_err_t ret = ESP_OK;
    if (!external_feed) {
        int baud = gps_get_baud_for_module(current_gps_module);
        ret = init_gps_uart(baud);
        if (ret != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to initialize GPS UART: %s", esp_err_to_name(ret));
            return 1;
        }
        MY_LOG_INFO(TAG, "GPS UART initialized on pins %d (TX) and %d (RX) at %d baud",
                    GPS_TX_PIN, GPS_RX_PIN, baud);
    } else {
        MY_LOG_INFO(TAG, "Using external GPS feed. Provide fixes via '%s'.",
                    gps_external_position_command_name(current_gps_module));
    }

    ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    MY_LOG_INFO(TAG, "SD card initialized on pins MISO:%d MOSI:%d CLK:%d CS:%d",
                SD_MISO_PIN, SD_MOSI_PIN, SD_CLK_PIN, SD_CS_PIN);

    wardrive_promisc_active = true;
    BaseType_t result = xTaskCreate(
        wardrive_promisc_task,
        "wdp_task",
        8192,
        NULL,
        5,
        &wardrive_promisc_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create wardrive promisc task!");
        wardrive_promisc_active = false;
        return 1;
    }

    MY_LOG_INFO(TAG, "Wardrive promisc task started. Use 'stop' to stop.");
    return 0;
}

static int cmd_start_wardrive_promisc(int argc, char **argv) {
    return cmd_start_wardrive_promisc_impl(argc, argv, false);
}

static int cmd_start_wardrive_promisc_trace(int argc, char **argv) {
    return cmd_start_wardrive_promisc_impl(argc, argv, true);
}

// ============================================================================
// Anti-Surveillance: detect a BLE device that moves along with you (a "tail").
// Uses the BLE scan + GPS streams already in place. A follower = a device that
// stays in range over a long enough time AND a long enough travelled distance.
// ============================================================================

#define ANTISURV_LOST_TIMEOUT_US   (30 * 1000000LL)   // must have been seen this recently to count

// Map sensitivity to detection thresholds.
static void antisurv_thresholds(uint8_t sens, int *min_dur_s, int *min_dist_m, bool *include_random) {
    switch (sens) {
        case WD_AS_LOW:  *min_dur_s = 300; *min_dist_m = 1000; *include_random = false; break;
        case WD_AS_HIGH: *min_dur_s = 120; *min_dist_m = 300;  *include_random = true;  break;
        case WD_AS_MED:
        default:         *min_dur_s = 180; *min_dist_m = 500;  *include_random = false; break;
    }
}

// A locally-administered (randomized) BLE address has bit 1 of the first octet set.
// Such devices rotate their MAC (~every 15 min) so they can't be tracked long-term.
static inline bool antisurv_is_random_mac(const uint8_t *addr) {
    return (addr[0] & 0x02) != 0;
}

// Scan tracked devices, raise an alert for any that newly qualify as a follower.
static int antisurv_evaluate_and_alert(void) {
    int min_dur_s, min_dist_m;
    bool include_random;
    antisurv_thresholds(g_wd_cfg.antisurv_sensitivity, &min_dur_s, &min_dist_m, &include_random);

    int64_t now = esp_timer_get_time();
    int n = bt_device_count;
    int alerts = 0;

