Smethan/projectZero/ESP32C5/main/main.c
    uint64_t timestamp = esp_timer_get_time() / 1000;
    char filename[128];
    
    // Save PCAP
    snprintf(filename, sizeof(filename), "/sdcard/lab/handshakes/%s_%s_%llu.pcap",
             ssid_safe, mac_suffix, (unsigned long long)timestamp);
    
    FILE *f = fopen(filename, "wb");
    if (!f) {
        MY_LOG_INFO(TAG, "[HS-SAVE] Failed to open: %s", filename);
        return false;
    }
    size_t written = fwrite(pcap_buf, 1, pcap_size, f);
    fclose(f);
    
    if (written != pcap_size) {
        MY_LOG_INFO(TAG, "[HS-SAVE] Incomplete write: %zu/%u", written, pcap_size);
        return false;
    }
    MY_LOG_INFO(TAG, "[HS-SAVE] PCAP saved: %s (%u bytes)", filename, pcap_size);
    
    // Save HCCAPX if available
    if (hccapx) {
        snprintf(filename, sizeof(filename), "/sdcard/lab/handshakes/%s_%s_%llu.hccapx",
                 ssid_safe, mac_suffix, (unsigned long long)timestamp);
        f = fopen(filename, "wb");
        if (f) {
            fwrite(hccapx, 1, sizeof(hccapx_t), f);
            fclose(f);
            MY_LOG_INFO(TAG, "[HS-SAVE] HCCAPX saved: %s", filename);
        }
    }
    
    // Sync SD
    int fd = open("/sdcard/.sync", O_WRONLY | O_CREAT | O_TRUNC, 0644);
    if (fd >= 0) { fsync(fd); close(fd); unlink("/sdcard/.sync"); }
    
    // === Backward-compatible UART messages for CardputerADV / Tab5 / FlipperLight ===
    // These exact strings are parsed by all 3 client projects.
    // Tab5 parses "PCAP saved:" and extracts filename from /sdcard/ path.
    printf("PCAP saved: /sdcard/lab/handshakes/%s_%s_%llu.pcap (%u bytes)\n", 
           ssid_safe, mac_suffix, (unsigned long long)timestamp, pcap_size);
    printf("HCCAPX saved: /sdcard/lab/handshakes/%s_%s_%llu.hccapx\n",
           ssid_safe, mac_suffix, (unsigned long long)timestamp);
    // Tab5 parses "HANDSHAKE IS COMPLETE AND VALID"
    printf("HANDSHAKE IS COMPLETE AND VALID\n");
    // All 3 clients parse "Complete 4-way handshake saved for SSID:"
    // CardputerADV/FlipperLight extract SSID after marker until space or '('
    // Tab5 extracts SSID after "SSID:" until space or '('
    printf("Complete 4-way handshake saved for SSID: %s (MAC: %s)\n", ssid_safe, mac_suffix);
    
    return true;
}

// ============================================================================
// Sniffer Handshake: Promiscuous Callback
// ============================================================================

static void hs_sniffer_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!handshake_attack_active) return;
    
    // Only process MGMT and DATA
    if (type != WIFI_PKT_DATA && type != WIFI_PKT_MGMT) return;
    
    const wifi_promiscuous_pkt_t *pkt = (wifi_promiscuous_pkt_t *)buf;
    const uint8_t *frame = pkt->payload;
    int len = pkt->rx_ctrl.sig_len;
    
    if (len < 24) return; // Minimum 802.11 header
    
    uint8_t frame_type = frame[0] & 0xFC;
    uint8_t to_ds = (frame[1] & 0x01) != 0;
    uint8_t from_ds = (frame[1] & 0x02) != 0;
    
    uint8_t *addr1 = (uint8_t *)&frame[4];
    uint8_t *addr2 = (uint8_t *)&frame[10];
    uint8_t *addr3 = (uint8_t *)&frame[16];
    
    // ---- MGMT frames: beacon, association, auth ----
    if (type == WIFI_PKT_MGMT) {
        if (frame_type == 0x80) {
            // Beacon: extract SSID, channel, authmode
            uint8_t *ap_bssid = addr2;
            
            // Parse tagged parameters for SSID, channel, RSN
            const uint8_t *body = frame + 24 + 12; // Skip MAC header + fixed params (timestamp 8, interval 2, cap 2)
            int body_len = len - 24 - 12;
            
            char ssid[33] = {0};
            uint8_t beacon_channel = pkt->rx_ctrl.channel;
            wifi_auth_mode_t authmode = WIFI_AUTH_OPEN;
            
            int offset = 0;
            while (offset + 2 <= body_len) {
                uint8_t tag = body[offset];
                uint8_t tag_len = body[offset + 1];
                if (offset + 2 + tag_len > body_len) break;
                
                if (tag == 0 && tag_len > 0 && tag_len <= 32) {
                    // SSID
                    memcpy(ssid, &body[offset + 2], tag_len);
                    ssid[tag_len] = '\0';
                } else if (tag == 3 && tag_len == 1) {
                    // DS Parameter Set (channel)
                    beacon_channel = body[offset + 2];
                } else if (tag == 48) {
                    // RSN (WPA2)
                    authmode = WIFI_AUTH_WPA2_PSK;
                } else if (tag == 221) {
                    // Vendor specific - check for WPA OUI
                    if (tag_len >= 4 && body[offset+2] == 0x00 && body[offset+3] == 0x50 && 
                        body[offset+4] == 0xF2 && body[offset+5] == 0x01) {
                        if (authmode == WIFI_AUTH_OPEN) authmode = WIFI_AUTH_WPA_PSK;
                    }
                }
                offset += 2 + tag_len;
            }
            
            // Only track WPA/WPA2 APs (we can't capture handshakes for open networks)
            if (authmode != WIFI_AUTH_OPEN) {
                int ap_idx = hs_add_or_update_ap(ap_bssid, ssid, beacon_channel, authmode, pkt->rx_ctrl.rssi);
                
                // Save beacon frame to PCAP if not yet captured for this AP
                // (beacon is needed for PMK calculation in hashcat/wpa-sec)
                if (ap_idx >= 0 && !hs_ap_targets[ap_idx].beacon_captured && 
                    !hs_ap_targets[ap_idx].has_existing_file && !hs_ap_targets[ap_idx].complete) {
                    pcap_serializer_append_frame(frame, len, pkt->rx_ctrl.timestamp);
                    hs_ap_targets[ap_idx].beacon_captured = true;
                }
            }
            return;
        }
        
        // Association Request (0x00) or Authentication (0xB0): client -> AP
        if (frame_type == 0x00 || frame_type == 0xB0) {
            uint8_t *client_mac = addr2;
            uint8_t *ap_mac = addr1;
            
            // Skip broadcast/multicast
            if (client_mac[0] & 0x01) return;
            
