Smethan/projectZero/ESP32C5/main/main.c
            int ap_idx = hs_find_ap(ap_mac);
            if (ap_idx >= 0 && !hs_ap_targets[ap_idx].has_existing_file && !hs_ap_targets[ap_idx].complete) {
                hs_add_or_update_client(client_mac, ap_idx, pkt->rx_ctrl.rssi);
            }
        }
        return;
    }
    
    // ---- DATA frames: client detection + EAPOL capture ----
    if (type == WIFI_PKT_DATA) {
        uint8_t *client_mac = NULL;
        uint8_t *ap_mac = NULL;
        
        if (to_ds && !from_ds) {
            // STA -> AP
            ap_mac = addr1;
            client_mac = addr2;
        } else if (!to_ds && from_ds) {
            // AP -> STA
            ap_mac = addr2;
            client_mac = addr1;
        } else if (!to_ds && !from_ds) {
            // IBSS
            ap_mac = addr3;
            client_mac = addr2;
        } else {
            return; // WDS
        }
        
        // Skip broadcast/multicast client
        if (client_mac[0] & 0x01) return;
        
        int ap_idx = hs_find_ap(ap_mac);
        if (ap_idx < 0) return; // Unknown AP, ignore
        
        hs_ap_target_t *ap = &hs_ap_targets[ap_idx];
        if (ap->has_existing_file || ap->complete) return; // Already done
        
        // Register client
        hs_add_or_update_client(client_mac, ap_idx, pkt->rx_ctrl.rssi);
        
        // Check for EAPOL: parse the data frame for EAPOL packet
        // The frame payload is a data_frame_t (802.11 data header + LLC/SNAP + EAPOL)
        data_frame_t *data_frame = (data_frame_t *)frame;
        eapol_packet_t *eapol = parse_eapol_packet(data_frame);
        if (!eapol) return; // Not an EAPOL frame
        
        eapol_key_packet_t *eapol_key = parse_eapol_key_packet(eapol);
        if (!eapol_key) return; // Not EAPOL-Key
        
        uint8_t msg_num = hs_get_eapol_msg_num(eapol_key);
        if (msg_num == 0) return;
        
        hs_dwell_eapol_frames++;
        
        bool is_new = false;
        switch (msg_num) {
            case 1: if (!ap->captured_m1) { ap->captured_m1 = true; is_new = true; } break;
            case 2: if (!ap->captured_m2) { ap->captured_m2 = true; is_new = true; } break;
            case 3: if (!ap->captured_m3) { ap->captured_m3 = true; is_new = true; } break;
            case 4: if (!ap->captured_m4) { ap->captured_m4 = true; is_new = true; } break;
        }
        
        if (is_new) {
            MY_LOG_INFO(TAG, "[HS-SNIFF] EAPOL M%d captured for '%s' (%02X:%02X:%02X:%02X:%02X:%02X)",
                       msg_num, ap->ssid,
                       ap->bssid[0], ap->bssid[1], ap->bssid[2], 
                       ap->bssid[3], ap->bssid[4], ap->bssid[5]);
            
            // Append to PCAP
            pcap_serializer_append_frame(frame, len, pkt->rx_ctrl.timestamp);
            
            // Feed to HCCAPX serializer
            hccapx_serializer_add_frame(data_frame);
            
            // Check if complete
            if (ap->captured_m1 && ap->captured_m2 && ap->captured_m3 && ap->captured_m4) {
                ap->complete = true;
                // Tab5 parses: strstr("Handshake captured for") with SSID in quotes
                MY_LOG_INFO(TAG, "Handshake captured for '%s' - all 4 EAPOL messages!", ap->ssid);
            }
        }
    }
}

// ============================================================================
// Serial PCAP/HCCAPX dump helpers (start_handshake_serial output)
// ============================================================================

/**
 * @brief Base64-encode binary data and print over serial with markers.
 *
 * Output format:
 *   <begin_marker>
 *   <base64 lines, 76 chars each>
 *   <end_marker>
 */
static void dump_base64_serial(const char *begin_marker, const char *end_marker,
                               const uint8_t *data, size_t len) {
    printf("%s\n", begin_marker);

    // Calculate required buffer size for base64 encoding
    size_t encoded_len = 0;
    mbedtls_base64_encode(NULL, 0, &encoded_len, data, len);

    uint8_t *encoded = malloc(encoded_len + 1);
    if (!encoded) {
        printf("ERROR: malloc failed for base64 (%u bytes)\n", (unsigned)encoded_len);
        printf("%s\n", end_marker);
        return;
    }

    size_t olen = 0;
    int ret = mbedtls_base64_encode(encoded, encoded_len + 1, &olen, data, len);
    if (ret != 0) {
        printf("ERROR: base64 encode failed (%d)\n", ret);
        free(encoded);
        printf("%s\n", end_marker);
        return;
    }

    // Print in 76-character lines (standard base64 line length)
    for (size_t i = 0; i < olen; i += 76) {
        size_t chunk = (olen - i > 76) ? 76 : (olen - i);
        printf("%.*s\n", (int)chunk, (char *)(encoded + i));
    }

    free(encoded);
    printf("%s\n", end_marker);
}

/**
 * @brief Dump captured handshake data as base64 over serial.
 *
 * Outputs PCAP and HCCAPX buffers with markers that the Python app
 * (loot_manager.py) can parse. Also prints SSID/AP metadata.
 *
 * Expected format parsed by Python side:
 *   --- PCAP BEGIN ---
 *   <base64 lines>
 *   --- PCAP END ---
 *   PCAP_SIZE: <N>
 *   --- HCCAPX BEGIN ---
 *   <base64 lines>
 *   --- HCCAPX END ---
 *   SSID: <ssid>  AP: <XX:XX:XX:XX:XX:XX>
 */
static void handshake_dump_serial(void) {
    MY_LOG_INFO(TAG, "Dumping handshake data via serial (base64)...");

    // Get PCAP buffer (contains all captured frames)
    unsigned pcap_size = 0;
    uint8_t *pcap_buf = attack_handshake_get_pcap(&pcap_size);

    if (!pcap_buf || pcap_size == 0) {
        MY_LOG_INFO(TAG, "No PCAP data captured - nothing to dump");
        return;
    }

    MY_LOG_INFO(TAG, "PCAP buffer: %u bytes", pcap_size);

    // Dump PCAP as base64
    dump_base64_serial("--- PCAP BEGIN ---", "--- PCAP END ---", pcap_buf, pcap_size);
    printf("PCAP_SIZE: %u\n", pcap_size);

    // Dump HCCAPX as base64 (if available)
    hccapx_t *hccapx = (hccapx_t *)attack_handshake_get_hccapx();
    if (hccapx && hccapx->essid_len > 0) {
        dump_base64_serial("--- HCCAPX BEGIN ---", "--- HCCAPX END ---",
                           (const uint8_t *)hccapx, sizeof(hccapx_t));

        // Print SSID and AP MAC metadata (for Python-side filename generation)
        char ssid[33] = {0};
        memcpy(ssid, hccapx->essid, hccapx->essid_len);
        printf("SSID: %s  AP: %02X:%02X:%02X:%02X:%02X:%02X\n",
               ssid,
               hccapx->mac_ap[0], hccapx->mac_ap[1], hccapx->mac_ap[2],
               hccapx->mac_ap[3], hccapx->mac_ap[4], hccapx->mac_ap[5]);
    }

    // Also log all captured APs from sniffer mode
    if (!handshake_selected_mode && hs_ap_count > 0) {
        int captured = 0;
        for (int i = 0; i < hs_ap_count; i++) {
            if (hs_ap_targets[i].complete) {
                MY_LOG_INFO(TAG, "Captured: SSID='%s' BSSID=%02X:%02X:%02X:%02X:%02X:%02X Ch=%d",
                    hs_ap_targets[i].ssid,
                    hs_ap_targets[i].bssid[0], hs_ap_targets[i].bssid[1],
                    hs_ap_targets[i].bssid[2], hs_ap_targets[i].bssid[3],
                    hs_ap_targets[i].bssid[4], hs_ap_targets[i].bssid[5],
                    hs_ap_targets[i].channel);
                captured++;
            }
        }
        MY_LOG_INFO(TAG, "Total APs discovered: %d, handshakes captured: %d", hs_ap_count, captured);
    }

    MY_LOG_INFO(TAG, "Serial PCAP dump complete.");
}

// Cleanup function for handshake attack
static void handshake_cleanup(void) {
    MY_LOG_INFO(TAG, "Handshake attack cleanup...");

    // Stop any active handshake attack (selected mode uses this)
    attack_handshake_stop();

    // Disable promiscuous mode (sniffer mode uses this)
    esp_wifi_set_promiscuous(false);
    hsm_stop(); /* Finish progress before the legacy base64 file dump. */

    // Mark task as finished BEFORE serial dump — cmd_stop() waits for
    // task_handle == NULL and will force-kill the task after 1s timeout.
    // The base64 serial dump takes ~1s, so we must clear the handle first
    // to prevent cmd_stop() from killing us mid-dump.
    handshake_attack_active = false;
    handshake_attack_task_handle = NULL;

    // If serial mode, dump PCAP/HCCAPX via serial BEFORE resetting state
    // (hs_ap_targets still holds captured AP info at this point)
    if (handshake_serial_mode) {
        handshake_dump_serial();
        handshake_serial_mode = false;
    }
    handshake_target_count = 0;
    handshake_current_index = 0;
    memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
    memset(handshake_captured, 0, sizeof(handshake_captured));
    
    // Reset sniffer handshake state
    hs_ap_count = 0;
    hs_client_count = 0;
    hs_dwell_new_clients = 0;
    hs_dwell_eapol_frames = 0;
    if (hs_ap_targets) memset(hs_ap_targets, 0, HS_MAX_APS * sizeof(hs_ap_target_t));
    if (hs_clients) memset(hs_clients, 0, HS_MAX_CLIENTS * sizeof(hs_client_entry_t));
    
    // Restore idle LED
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED: %s", esp_err_to_name(led_err));
    }
    
    MY_LOG_INFO(TAG, "Handshake attack cleanup complete.");
}

// Quick scan all channels (both 2.4GHz and 5GHz) - 500ms per channel
// (kept for potential future use; currently unused since sniffer+D-UCB replaced scan-all mode)
static void __attribute__((unused)) quick_scan_all_channels(void) {
    MY_LOG_INFO(TAG, "Quick scanning all channels (2.4GHz + 5GHz)...");
    
    // Scan 2.4GHz channels
    for (int i = 0; i < NUM_CHANNELS_24GHZ && handshake_attack_active && !operation_stop_requested; i++) {
        uint8_t channel = channels_24ghz[i];
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        vTaskDelay(pdMS_TO_TICKS(500)); // 500ms per channel
        
        // Scan would happen here via background scan
        // For now we'll use the global scan results
    }
    
    // Scan 5GHz channels  
    for (int i = 0; i < NUM_CHANNELS_5GHZ && handshake_attack_active && !operation_stop_requested; i++) {
        uint8_t channel = channels_5ghz[i];
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        vTaskDelay(pdMS_TO_TICKS(500)); // 500ms per channel
    }
    
