Smethan/projectZero/ESP32C5/main/main.c
    return 0;
}

static int cmd_save_handshake(int argc, char **argv) {
    oled_display_update_full("> Save Capture", "  Writing PCAP", "  /lab/handshakes", "  SD Card...");
    // Avoid compiler warnings
    (void)argc; (void)argv;
    
    MY_LOG_INFO(TAG, "Manually saving handshake to SD card...");
    
    if (attack_handshake_save_to_sd()) {
        MY_LOG_INFO(TAG, "✓ Handshake saved successfully!");
        MY_LOG_INFO(TAG, "Files saved to: /sdcard/lab/handshakes/");
        return 0;
    } else {
        MY_LOG_INFO(TAG, "✗ Failed to save - no complete 4-way handshake captured");
        MY_LOG_INFO(TAG, "Make sure you captured all 4 messages of the handshake");
        return 1;
    }
}

// ============================================================================
// start_handshake_serial — handshake capture with serial PCAP output (no SD)
// ============================================================================

static int cmd_start_handshake_serial(int argc, char **argv) {
    (void)argc; (void)argv;

    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }

    // Enable AP mode for raw frame injection (deauth packets)
    if (!ensure_ap_mode()) {
        MY_LOG_INFO(TAG, "Failed to enable AP mode for deauth injection");
        return 1;
    }

    // Check if handshake attack is already running
    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Handshake attack already running. Use 'stop' to stop it first.");
        return 1;
    }

    // Reset stop flag
    operation_stop_requested = false;

    // Initialize state
    handshake_target_count = 0;
    handshake_current_index = 0;
    memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
    memset(handshake_captured, 0, sizeof(handshake_captured));

    // Force sniffer + D-UCB mode (attack all visible networks, no selection needed)
    handshake_selected_mode = false;
    // Enable serial output mode — cleanup will dump PCAP/HCCAPX as base64
    handshake_serial_mode = true;

    MY_LOG_INFO(TAG, "Starting WPA Handshake Capture - Serial PCAP Mode");
    MY_LOG_INFO(TAG, "No SD card needed — PCAP/HCCAPX will be sent via serial (base64)");
    MY_LOG_INFO(TAG, "Using Sniffer + D-UCB mode: all visible networks");
    MY_LOG_INFO(TAG, "Will run until 'stop' command");
    MY_LOG_INFO(TAG, "Python app will parse and save .pcap/.hccapx files automatically");

    // Start handshake attack task
    handshake_attack_active = true;
    BaseType_t result = xTaskCreate(
        handshake_attack_task,
        "hs_serial",
        12288,  // Stack size
        NULL,
        5,      // Priority
        &handshake_attack_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create handshake attack task!");
        handshake_attack_active = false;
        handshake_serial_mode = false;
        return 1;
    }

    return 0;
}

// --------------- WPA-SEC commands ---------------

static bool wigle_split_key_pair(const char *input,
                                 char *api_name,
                                 size_t api_name_sz,
                                 char *api_token,
                                 size_t api_token_sz) {
    if (!input || !api_name || !api_token || api_name_sz == 0 || api_token_sz == 0) {
        return false;
    }

    const char *start = input;
    while (*start && isspace((unsigned char)*start)) {
        start++;
    }

    const char *sep = strchr(start, ':');
    if (!sep || sep == start) {
        return false;
    }

    const char *name_end = sep;
    while (name_end > start && isspace((unsigned char)*(name_end - 1))) {
        name_end--;
    }

    const char *token_start = sep + 1;
    while (*token_start && isspace((unsigned char)*token_start)) {
        token_start++;
    }

    const char *token_end = token_start + strlen(token_start);
    while (token_end > token_start && isspace((unsigned char)*(token_end - 1))) {
        token_end--;
    }

    size_t name_len = (size_t)(name_end - start);
    size_t token_len = (size_t)(token_end - token_start);
    if (name_len == 0 || token_len == 0) {
        return false;
    }
    if (name_len >= api_name_sz || token_len >= api_token_sz) {
        return false;
    }

    memcpy(api_name, start, name_len);
    api_name[name_len] = '\0';
    memcpy(api_token, token_start, token_len);
    api_token[token_len] = '\0';
    return true;
}

static bool wigle_is_upload_candidate(const char *filename) {
    if (!filename) {
        return false;
    }
    if (filename[0] == '.' || strcmp(filename, "upload_state.csv") == 0) {
        return false;
    }
    size_t len = strlen(filename);
    if (len > 4 && strcasecmp(filename + len - 4, ".log") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".txt") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".csv") == 0) {
        return true;
    }
    return false;
}

static bool wdgwars_is_upload_candidate(const char *filename) {
    if (!filename) {
        return false;
    }
    if (filename[0] == '.' || strcmp(filename, "upload_state.csv") == 0) {
        return false;
    }
    size_t len = strlen(filename);
    if (len > 4 && strcasecmp(filename + len - 4, ".log") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".csv") == 0) {
        return true;
    }
    if (len > 3 && strcasecmp(filename + len - 3, ".gz") == 0) {
        return true;
    }
    return false;
}

static const char *wigle_basename(const char *path) {
    if (!path) {
        return NULL;
    }
    const char *base = path;
    const char *slash = strrchr(path, '/');
    const char *bslash = strrchr(path, '\\');
    if (slash && bslash) {
        base = (slash > bslash) ? (slash + 1) : (bslash + 1);
    } else if (slash) {
        base = slash + 1;
    } else if (bslash) {
        base = bslash + 1;
    }
    return base;
}

static bool wigle_resolve_upload_target(const char *arg, char *out_path, size_t out_path_sz, char *out_name, size_t out_name_sz) {
    if (!arg || !out_path || !out_name || out_path_sz == 0 || out_name_sz == 0) {
        return false;
    }

    const char *name = wigle_basename(arg);
    if (!name || name[0] == '\0' || !wigle_is_upload_candidate(name)) {
        return false;
    }

    if (strchr(arg, '/') || strchr(arg, '\\')) {
        if (strncmp(arg, "/sdcard/", 8) == 0) {
            snprintf(out_path, out_path_sz, "%s", arg);
        } else if (strncmp(arg, "sdcard/", 7) == 0) {
            snprintf(out_path, out_path_sz, "/%s", arg);
        } else {
            return false;
        }
    } else {
        snprintf(out_path, out_path_sz, "/sdcard/lab/wardrives/%s", name);
    }

