Smethan/projectZero/ESP32C5/main/main.c
    snprintf(out_name, out_name_sz, "%s", name);

    struct stat st;
    if (stat(out_path, &st) != 0 || !S_ISREG(st.st_mode)) {
        return false;
    }
    return true;
}

static bool wdgwars_resolve_upload_target(const char *arg, char *out_path, size_t out_path_sz, char *out_name, size_t out_name_sz) {
    if (!arg || !out_path || !out_name || out_path_sz == 0 || out_name_sz == 0) {
        return false;
    }

    const char *name = wigle_basename(arg);
    if (!name || name[0] == '\0' || !wdgwars_is_upload_candidate(name)) {
        return false;
    }

    if (strchr(arg, '/') || strchr(arg, '\\')) {
        if (strncmp(arg, "/sdcard/", 8) == 0) {
            snprintf(out_path, out_path_sz, "%s", arg);
        } else if (strncmp(arg, "sdcard/", 7) == 0) {
            snprintf(out_path, out_path_sz, "/%s", arg);
        } else {
            return false;
        }
    } else {
        snprintf(out_path, out_path_sz, "/sdcard/lab/wardrives/%s", name);
    }

    snprintf(out_name, out_name_sz, "%s", name);

    struct stat st;
    if (stat(out_path, &st) != 0 || !S_ISREG(st.st_mode)) {
        return false;
    }
    return true;
}

typedef struct {
    int data_rows;
    int wifi_rows;
    int ble_rows;
    int bt_rows;
    int bad_rows;
    bool has_wigle_header;
    bool has_schema_header;
} wdgwars_wigle_stats_t;

#define WDGWARS_SANITIZED_UPLOAD_PATH "/sdcard/lab/wardrives/.wdgwars_upload.tmp"
#define UPLOAD_STATE_PATH "/sdcard/lab/wardrives/upload_state.csv"
#define WDGWARS_WIGLE_HEADER "WigleWifi-1.6,appRelease=v1.1,model=MonsterC5,release=v1.0,device=MonsterC5,display=SPI TFT,board=ESP32C5,brand=LAB5"
#define WDGWARS_WIGLE_SCHEMA "MAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type"

static int count_csv_fields_simple(const char *line) {
    if (!line || line[0] == '\0') {
        return 0;
    }

    int fields = 1;
    bool quoted = false;
    for (const char *p = line; *p != '\0'; p++) {
        if (*p == '"') {
            if (quoted && p[1] == '"') {
                p++;
            } else {
                quoted = !quoted;
            }
        } else if (*p == ',' && !quoted) {
            fields++;
        }
    }
    return fields;
}

static bool csv_last_field_is_type(const char *line, const char *type) {
    if (!line || !type) {
        return false;
    }

    const char *last = strrchr(line, ',');
    if (!last) {
        return false;
    }
    last++;
    while (*last == ' ' || *last == '\t') {
        last++;
    }
    return strcasecmp(last, type) == 0;
}

static bool wdgwars_sanitize_wigle_file(const char *filepath, wdgwars_wigle_stats_t *stats, bool *use_sanitized) {
    if (use_sanitized) {
        *use_sanitized = false;
    }
    if (!filepath || !stats || !use_sanitized) {
        return false;
    }

    memset(stats, 0, sizeof(*stats));
    size_t path_len = strlen(filepath);
    if (path_len > 3 && strcasecmp(filepath + path_len - 3, ".gz") == 0) {
        MY_LOG_INFO(TAG, "  Preflight WigleWifi-1.6: skipped for compressed .gz file");
        return true;
    }

    FILE *in = fopen(filepath, "r");
    if (!in) {
        MY_LOG_INFO(TAG, "  Preflight: cannot open file for schema check");
        return false;
    }

    FILE *out = fopen(WDGWARS_SANITIZED_UPLOAD_PATH, "w");
    if (!out) {
        fclose(in);
        MY_LOG_INFO(TAG, "  Preflight: cannot create sanitized upload file");
        return false;
    }

    fprintf(out, "%s\n%s\n", WDGWARS_WIGLE_HEADER, WDGWARS_WIGLE_SCHEMA);

    char line[512];
    while (fgets(line, sizeof(line), in)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0') {
            continue;
        }

        if (strncmp(line, "WigleWifi-1.6", 13) == 0) {
            stats->has_wigle_header = true;
            continue;
        }
        if (strcmp(line, WDGWARS_WIGLE_SCHEMA) == 0) {
            stats->has_schema_header = true;
            continue;
        }
        if (strncmp(line, "MAC,SSID,", 9) == 0) {
            stats->bad_rows++;
            continue;
        }

        int fields = count_csv_fields_simple(line);
        if (fields != 14) {
            stats->bad_rows++;
            continue;
        }

        const char *type = NULL;
        if (csv_last_field_is_type(line, "WIFI")) {
            stats->wifi_rows++;
            type = "WIFI";
        } else if (csv_last_field_is_type(line, "BLE")) {
            stats->ble_rows++;
            type = "BLE";
        } else if (csv_last_field_is_type(line, "BT")) {
            stats->bt_rows++;
            type = "BT";
        }

        if (!type) {
            stats->bad_rows++;
            continue;
        }

        stats->data_rows++;
        fprintf(out, "%s\n", line);
    }

    fclose(in);
    fclose(out);

    bool changed = stats->bad_rows > 0 || !stats->has_wigle_header || !stats->has_schema_header;
    *use_sanitized = changed;

    MY_LOG_INFO(TAG, "  Preflight WigleWifi-1.6: header=%s schema=%s rows=%d wifi=%d ble=%d bt=%d bad=%d",
                stats->has_wigle_header ? "yes" : "no",
                stats->has_schema_header ? "yes" : "no",
                stats->data_rows, stats->wifi_rows, stats->ble_rows,
                stats->bt_rows, stats->bad_rows);

    if (changed) {
        MY_LOG_INFO(TAG, "  Sanitized copy prepared: removed %d bad row(s), added missing headers if needed",
                    stats->bad_rows);
    } else {
        unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
    }
    return true;
}

static void wardrive_build_fixed_path(const char *filename, char *out, size_t out_sz) {
    char base[128];
    snprintf(base, sizeof(base), "%s", filename ? filename : "wardrive.log");
    char *dot = strrchr(base, '.');
    if (dot && dot != base) {
        *dot = '\0';
    }
    snprintf(out, out_sz, "/sdcard/lab/wardrives/%s.fixed.log", base);
}

static bool wardrive_fix_file_soft(const char *filepath, const char *filename,
                                   char *out_path, size_t out_path_sz,
                                   wdgwars_wigle_stats_t *stats) {
    if (!filepath || !filename || !out_path || out_path_sz == 0 || !stats) {
        return false;
    }

