Smethan/projectZero/ESP32C5/main/main.c
    memset(stats, 0, sizeof(*stats));
    size_t path_len = strlen(filepath);
    if (path_len > 3 && strcasecmp(filepath + path_len - 3, ".gz") == 0) {
        MY_LOG_INFO(TAG, "wardrive_fix does not repair compressed .gz files");
        return false;
    }

    FILE *in = fopen(filepath, "r");
    if (!in) {
        MY_LOG_INFO(TAG, "wardrive_fix: cannot open %s", filepath);
        return false;
    }

    wardrive_build_fixed_path(filename, out_path, out_path_sz);
    FILE *out = fopen(out_path, "w");
    if (!out) {
        fclose(in);
        MY_LOG_INFO(TAG, "wardrive_fix: cannot create %s", out_path);
        return false;
    }

    fprintf(out, "%s\n%s\n", WDGWARS_WIGLE_HEADER, WDGWARS_WIGLE_SCHEMA);

    char line[512];
    while (fgets(line, sizeof(line), in)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0') {
            continue;
        }

        if (strncmp(line, "WigleWifi-1.6", 13) == 0) {
            stats->has_wigle_header = true;
            continue;
        }
        if (strcmp(line, WDGWARS_WIGLE_SCHEMA) == 0) {
            stats->has_schema_header = true;
            continue;
        }
        if (strncmp(line, "MAC,SSID,", 9) == 0) {
            stats->bad_rows++;
            continue;
        }

        if (count_csv_fields_simple(line) != 14) {
            stats->bad_rows++;
            continue;
        }

        if (csv_last_field_is_type(line, "WIFI")) {
            stats->wifi_rows++;
        } else if (csv_last_field_is_type(line, "BLE")) {
            stats->ble_rows++;
        } else if (csv_last_field_is_type(line, "BT")) {
            stats->bt_rows++;
        } else {
            stats->bad_rows++;
            continue;
        }

        stats->data_rows++;
        fprintf(out, "%s\n", line);
    }

    fclose(in);
    fclose(out);
    sd_sync();

    // Future hard-repair concept:
    // Keep a bounded accumulator (for example 2 KB), append up to a few physical
    // lines when CSV quotes are unbalanced or field count is wrong, and emit the
    // merged record only if it becomes a valid 14-field WigleWifi row. This is
    // intentionally not automatic yet because guessing broken records can corrupt
    // coordinates or device identity; the soft mode only drops unsafe rows.
    return true;
}

static bool wardrive_collect_file_id(const char *filepath, long *out_size, uint32_t *out_hash) {
    const size_t CHUNK_SIZE = 2048;
    FILE *f = fopen(filepath, "rb");
    if (!f) {
        return false;
    }

    uint8_t *buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!buf) {
        buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!buf) {
        fclose(f);
        return false;
    }

    uint32_t hash = 2166136261u; // FNV-1a 32-bit
    long size = 0;
    while (1) {
        size_t n = fread(buf, 1, CHUNK_SIZE, f);
        for (size_t i = 0; i < n; i++) {
            hash ^= buf[i];
            hash *= 16777619u;
        }
        size += (long)n;
        if (n < CHUNK_SIZE) {
            if (ferror(f)) {
                free(buf);
                fclose(f);
                return false;
            }
            break;
        }
    }

    free(buf);
    fclose(f);
    if (out_size) {
        *out_size = size;
    }
    if (out_hash) {
        *out_hash = hash;
    }
    return true;
}

static bool upload_state_ensure_file(void) {
    struct stat st;
    if (stat(UPLOAD_STATE_PATH, &st) == 0) {
        return true;
    }

    sd_mkdir_recursive("/sdcard/lab/wardrives");

    FILE *f = fopen(UPLOAD_STATE_PATH, "w");
    if (!f) {
        MY_LOG_INFO(TAG, "Upload state: cannot create %s", UPLOAD_STATE_PATH);
        return false;
    }
    fprintf(f, "service,filename,size,hash,status,uploaded_at,wifi,ble,bt,bad\n");
    fclose(f);
    sd_sync();
    return true;
}

static bool upload_state_parse_line(char *line, char *service, size_t service_sz,
                                    char *filename, size_t filename_sz, long *size,
                                    uint32_t *hash, char *status, size_t status_sz,
                                    int *wifi, int *ble, int *bt, int *bad) {
    if (!line || strncmp(line, "service,", 8) == 0) {
        return false;
    }

    char *fields[10] = {0};
    int count = 0;
    char *save = NULL;
    char *tok = strtok_r(line, ",", &save);
    while (tok && count < 10) {
        fields[count++] = tok;
        tok = strtok_r(NULL, ",", &save);
    }
    if (count < 10) {
        return false;
    }

    snprintf(service, service_sz, "%s", fields[0]);
    snprintf(filename, filename_sz, "%s", fields[1]);
    if (size) {
        *size = strtol(fields[2], NULL, 10);
    }
    if (hash) {
        *hash = (uint32_t)strtoul(fields[3], NULL, 16);
    }
    snprintf(status, status_sz, "%s", fields[4]);
    if (wifi) *wifi = atoi(fields[6]);
    if (ble)  *ble  = atoi(fields[7]);
    if (bt)   *bt   = atoi(fields[8]);
    if (bad)  *bad  = atoi(fields[9]);
    return true;
}

static bool upload_state_is_done(const char *service, const char *filename, long size, uint32_t hash) {
    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    if (!f) {
        return false;
    }

    bool done = false;
    char line[256];
    while (fgets(line, sizeof(line), f)) {
        line[strcspn(line, "\r\n")] = '\0';
        char svc[16], fn[128], status[16];
        long rec_size = 0;
        uint32_t rec_hash = 0;
        if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                     &rec_size, &rec_hash, status, sizeof(status),
                                     NULL, NULL, NULL, NULL)) {
            continue;
        }
        if (strcmp(svc, service) == 0 && strcmp(fn, filename) == 0 &&
            rec_size == size && rec_hash == hash) {
            if (strcmp(status, "done") == 0) {
                done = true;
            }
        }
    }
    fclose(f);
    return done;
}

static bool upload_state_append(const char *service, const char *filename, long size,
                                uint32_t hash, const char *status,
                                const wdgwars_wigle_stats_t *stats) {
    if (!upload_state_ensure_file()) {
        return false;
    }

    FILE *f = fopen(UPLOAD_STATE_PATH, "a");
    if (!f) {
        MY_LOG_INFO(TAG, "Upload state: cannot append to %s", UPLOAD_STATE_PATH);
        return false;
    }

    char timestamp[32];
    get_timestamp_string(timestamp, sizeof(timestamp));
    fprintf(f, "%s,%s,%ld,%08lX,%s,%s,%d,%d,%d,%d\n",
            service, filename, size, (unsigned long)hash, status, timestamp,
            stats ? stats->wifi_rows : 0,
            stats ? stats->ble_rows : 0,
            stats ? stats->bt_rows : 0,
            stats ? stats->bad_rows : 0);
    fclose(f);
    sd_sync();
    return true;
}

static void upload_state_get_status(const char *service, const char *filename, long size,
                                    uint32_t hash, char *out, size_t out_sz) {
    snprintf(out, out_sz, "pending");
    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    if (!f) {
        return;
    }

    char line[256];
    while (fgets(line, sizeof(line), f)) {
        line[strcspn(line, "\r\n")] = '\0';
        char svc[16], fn[128], status[16];
        long rec_size = 0;
        uint32_t rec_hash = 0;
        if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                     &rec_size, &rec_hash, status, sizeof(status),
                                     NULL, NULL, NULL, NULL)) {
            continue;
        }
        if (strcmp(svc, service) == 0 && strcmp(fn, filename) == 0 &&
            rec_size == size && rec_hash == hash) {
            if (strcmp(out, "done") == 0) {
                continue;
            }
            snprintf(out, out_sz, "%s", status);
        }
    }
    fclose(f);
}

