Smethan/projectZero/ESP32C5/main/main.c
static int cmd_upload_state(int argc, char **argv) {
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    if (argc > 1 && strcasecmp(argv[1], "clear") == 0) {
        unlink(UPLOAD_STATE_PATH);
        if (upload_state_ensure_file()) {
            MY_LOG_INFO(TAG, "Upload state cleared: %s", UPLOAD_STATE_PATH);
            return 0;
        }
        return 1;
    }

    upload_state_ensure_file();

    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    printf("[UPLOAD_STATE] BEGIN\n");
    if (f) {
        char line[256];
        while (fgets(line, sizeof(line), f)) {
            line[strcspn(line, "\r\n")] = '\0';
            char svc[16], fn[128], status[16];
            long size = 0;
            uint32_t hash = 0;
            int wifi = 0, ble = 0, bt = 0, bad = 0;
            if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                         &size, &hash, status, sizeof(status),
                                         &wifi, &ble, &bt, &bad)) {
                continue;
            }
            printf("[UPLOAD_STATE] service=%s filename=%s size=%ld hash=%08lX status=%s wifi=%d ble=%d bt=%d bad=%d\n",
                   svc, fn, size, (unsigned long)hash, status, wifi, ble, bt, bad);
        }
        fclose(f);
    }
    printf("[UPLOAD_STATE] END\n");
    return 0;
}

static int cmd_wardrive_files(int argc, char **argv) {
    (void)argc;
    (void)argv;

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    upload_state_ensure_file();

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (!dir) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    printf("[WARD_FILE] BEGIN\n");
    int total_files = 0;
    long total_bytes = 0;
    int total_rows = 0;
    int total_wifi = 0;
    int total_ble = 0;
    int total_bt = 0;
    int total_bad = 0;
    int wigle_pending = 0;
    int wigle_ok = 0;
    int wigle_failed = 0;
    int wigle_rate_limited = 0;
    int wdgwars_pending = 0;
    int wdgwars_ok = 0;
    int wdgwars_failed = 0;
    int wdgwars_rate_limited = 0;

    struct dirent *entry;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);
        long size = 0;
        uint32_t hash = 0;
        if (!wardrive_collect_file_id(filepath, &size, &hash)) {
            continue;
        }

        wdgwars_wigle_stats_t stats = {0};
        bool use_sanitized = false;
        wdgwars_sanitize_wigle_file(filepath, &stats, &use_sanitized);
        if (use_sanitized) {
            unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
        }

        char wigle_status[16], wdgwars_status[16];
        upload_state_get_status("wigle", entry->d_name, size, hash, wigle_status, sizeof(wigle_status));
        upload_state_get_status("wdgwars", entry->d_name, size, hash, wdgwars_status, sizeof(wdgwars_status));

        total_files++;
        total_bytes += size;
        total_rows += stats.data_rows;
        total_wifi += stats.wifi_rows;
        total_ble += stats.ble_rows;
        total_bt += stats.bt_rows;
        total_bad += stats.bad_rows;

        if (strcmp(wigle_status, "done") == 0) {
            wigle_ok++;
        } else if (strcmp(wigle_status, "failed") == 0) {
            wigle_failed++;
        } else if (strcmp(wigle_status, "rate_limited") == 0) {
            wigle_rate_limited++;
        } else {
            wigle_pending++;
        }

        if (strcmp(wdgwars_status, "done") == 0) {
            wdgwars_ok++;
        } else if (strcmp(wdgwars_status, "failed") == 0) {
            wdgwars_failed++;
        } else if (strcmp(wdgwars_status, "rate_limited") == 0) {
            wdgwars_rate_limited++;
        } else {
            wdgwars_pending++;
        }

        printf("[WARD_FILE] filename=%s size=%ld hash=%08lX wifi=%d ble=%d bt=%d bad=%d wigle=%s wdgwars=%s\n",
               entry->d_name, size, (unsigned long)hash,
               stats.wifi_rows, stats.ble_rows, stats.bt_rows, stats.bad_rows,
               wigle_status, wdgwars_status);
    }
    closedir(dir);
    printf("[WARD_FILE] SUMMARY files=%d bytes=%ld rows=%d devices=%d wifi=%d ble=%d bt=%d bad=%d wigle_ok=%d wigle_pending=%d wigle_failed=%d wigle_rate_limited=%d wdgwars_ok=%d wdgwars_pending=%d wdgwars_failed=%d wdgwars_rate_limited=%d\n",
           total_files, total_bytes, total_rows, total_rows, total_wifi, total_ble, total_bt, total_bad,
           wigle_ok, wigle_pending, wigle_failed, wigle_rate_limited,
           wdgwars_ok, wdgwars_pending, wdgwars_failed, wdgwars_rate_limited);
    printf("[WARD_FILE] END\n");
    return 0;
}

static bool wardrive_cleanup_valid_service(const char *service) {
    return service &&
           (strcasecmp(service, "wigle") == 0 ||
            strcasecmp(service, "wdgwars") == 0 ||
            strcasecmp(service, "all") == 0);
}

static bool wardrive_cleanup_valid_status(const char *status) {
    return status &&
           (strcasecmp(status, "pending") == 0 ||
            strcasecmp(status, "done") == 0 ||
            strcasecmp(status, "ok") == 0 ||
            strcasecmp(status, "failed") == 0 ||
            strcasecmp(status, "fail") == 0 ||
            strcasecmp(status, "rate_limited") == 0);
}

static const char *wardrive_cleanup_normalize_status(const char *status) {
    if (status && strcasecmp(status, "ok") == 0) {
        return "done";
    }
    if (status && strcasecmp(status, "fail") == 0) {
        return "failed";
    }
    if (status && strcasecmp(status, "pending") == 0) {
        return "pending";
    }
    if (status && strcasecmp(status, "done") == 0) {
        return "done";
    }
    if (status && strcasecmp(status, "failed") == 0) {
        return "failed";
    }
    if (status && strcasecmp(status, "rate_limited") == 0) {
        return "rate_limited";
    }
    return status;
}

static const char *wardrive_cleanup_normalize_service(const char *service) {
    if (service && strcasecmp(service, "wigle") == 0) {
        return "wigle";
    }
    if (service && strcasecmp(service, "wdgwars") == 0) {
        return "wdgwars";
    }
    if (service && strcasecmp(service, "all") == 0) {
        return "all";
    }
    return service;
}

static bool wardrive_cleanup_status_matches(const char *service, const char *wanted_status,
                                            const char *wigle_status, const char *wdgwars_status) {
    if (strcasecmp(service, "all") == 0) {
        return strcmp(wigle_status, wanted_status) == 0 &&
               strcmp(wdgwars_status, wanted_status) == 0;
    }
    if (strcasecmp(service, "wigle") == 0) {
        return strcmp(wigle_status, wanted_status) == 0;
    }
    return strcmp(wdgwars_status, wanted_status) == 0;
}

static bool wardrive_cleanup_valid_subdir(const char *subdir) {
    if (!subdir || subdir[0] == '\0' || strcmp(subdir, ".") == 0 || strcmp(subdir, "..") == 0) {
        return false;
    }
    for (const char *p = subdir; *p; p++) {
        unsigned char c = (unsigned char)*p;
        if (!(isalnum(c) || c == '.' || c == '_' || c == '-')) {
            return false;
        }
    }
    return true;
}

