Smethan/projectZero/ESP32C5/main/main.c
static bool wardrive_cleanup_ensure_dir(const char *service, const char *status,
                                        const char *subdir, char *out_dir, size_t out_sz) {
    if (!service || !status || !out_dir || out_sz == 0) {
        return false;
    }

    mkdir("/sdcard/lab/wardrives/uploaded", 0755);

    char service_dir[384];
    int ret = snprintf(service_dir, sizeof(service_dir), "/sdcard/lab/wardrives/uploaded/%s", service);
    if (ret <= 0 || ret >= (int)sizeof(service_dir)) {
        return false;
    }
    mkdir(service_dir, 0755);

    ret = snprintf(out_dir, out_sz, "%s/%s", service_dir, status);
    if (ret <= 0 || ret >= (int)out_sz) {
        return false;
    }
    mkdir(out_dir, 0755);

    if (subdir && subdir[0] != '\0') {
        char status_dir[384];
        strlcpy(status_dir, out_dir, sizeof(status_dir));
        ret = snprintf(out_dir, out_sz, "%s/%s", status_dir, subdir);
        if (ret <= 0 || ret >= (int)out_sz) {
            return false;
        }
        mkdir(out_dir, 0755);
    }
    return true;
}

static int cmd_wardrive_cleanup(int argc, char **argv) {
    if (argc < 3 || argc > 5 ||
        !wardrive_cleanup_valid_service(argv[1]) ||
        !wardrive_cleanup_valid_status(argv[2])) {
        MY_LOG_INFO(TAG, "Usage: wardrive_cleanup <wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]");
        return 1;
    }

    if (argc >= 4 && strcasecmp(argv[3], "move") != 0) {
        MY_LOG_INFO(TAG, "Usage: wardrive_cleanup <wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]");
        return 1;
    }

    const char *service = wardrive_cleanup_normalize_service(argv[1]);
    const char *status = wardrive_cleanup_normalize_status(argv[2]);
    bool do_move = (argc >= 4 && strcasecmp(argv[3], "move") == 0);
    const char *dest_subdir = (argc >= 5) ? argv[4] : NULL;

    if (dest_subdir && !wardrive_cleanup_valid_subdir(dest_subdir)) {
        printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=move target=\n", service, status);
        printf("[WARD_CLEANUP] filename=destination action=failed reason=invalid_destination destination=%s\n", dest_subdir ? dest_subdir : "");
        printf("[WARD_CLEANUP] SUMMARY scanned=0 matched=0 moved=0 failed=1 dry_run=0\n");
        printf("[WARD_CLEANUP] END\n");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    upload_state_ensure_file();

    char target_dir[384];
    if (!wardrive_cleanup_ensure_dir(service, status, dest_subdir, target_dir, sizeof(target_dir))) {
        MY_LOG_INFO(TAG, "wardrive_cleanup: failed to prepare target directory");
        return 1;
    }

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (!dir) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=%s target=%s\n",
           service, status, do_move ? "move" : "dry-run", target_dir);

    int scanned = 0;
    int matched = 0;
    int moved = 0;
    int failed = 0;
    struct dirent *entry;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char filepath[384];
        int path_len = snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);
        if (path_len <= 0 || path_len >= (int)sizeof(filepath)) {
            failed++;
            printf("[WARD_CLEANUP] filename=%s action=failed reason=path_too_long\n", entry->d_name);
            continue;
        }
        long size = 0;
        uint32_t hash = 0;
        if (!wardrive_collect_file_id(filepath, &size, &hash)) {
            continue;
        }
        scanned++;

        char wigle_status[16], wdgwars_status[16];
        upload_state_get_status("wigle", entry->d_name, size, hash, wigle_status, sizeof(wigle_status));
        upload_state_get_status("wdgwars", entry->d_name, size, hash, wdgwars_status, sizeof(wdgwars_status));

        if (!wardrive_cleanup_status_matches(service, status, wigle_status, wdgwars_status)) {
            continue;
        }
        matched++;

        char target_path[512];
        path_len = snprintf(target_path, sizeof(target_path), "%s/%s", target_dir, entry->d_name);
        if (path_len <= 0 || path_len >= (int)sizeof(target_path)) {
            failed++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=failed reason=target_path_too_long\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status);
            continue;
        }

        if (!do_move) {
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=would_move target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, target_path);
            continue;
        }

        unlink(target_path);
        if (rename(filepath, target_path) == 0) {
            moved++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=moved target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, target_path);

            size_t name_len = strlen(entry->d_name);
            if (name_len > 4 && strcasecmp(entry->d_name + name_len - 4, ".log") == 0) {
                char track_name[256];
                int track_name_len = snprintf(track_name, sizeof(track_name), "%.*s_track.kml",
                                              (int)(name_len - 4), entry->d_name);
                if (track_name_len <= 0 || track_name_len >= (int)sizeof(track_name)) {
                    failed++;
                    printf("[WARD_CLEANUP] filename=%s action=failed reason=track_name_too_long\n",
                           entry->d_name);
                } else {
                    char track_path[384];
                    char track_target_path[512];
                    int track_path_len = snprintf(track_path, sizeof(track_path), "/sdcard/lab/wardrives/%s", track_name);
                    int track_target_len = snprintf(track_target_path, sizeof(track_target_path), "%s/%s", target_dir, track_name);
                    if (track_path_len <= 0 || track_path_len >= (int)sizeof(track_path) ||
                        track_target_len <= 0 || track_target_len >= (int)sizeof(track_target_path)) {
                        failed++;
                        printf("[WARD_CLEANUP] filename=%s action=failed reason=track_path_too_long\n",
                               track_name);
                    } else if (access(track_path, F_OK) == 0) {
                        unlink(track_target_path);
                        if (rename(track_path, track_target_path) == 0) {
                            moved++;
                            printf("[WARD_CLEANUP] filename=%s action=moved target=%s\n",
                                   track_name, track_target_path);
                        } else {
                            failed++;
                            printf("[WARD_CLEANUP] filename=%s action=failed errno=%d target=%s\n",
                                   track_name, errno, track_target_path);
                        }
                    }
                }
            }
        } else {
            failed++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=failed errno=%d target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, errno, target_path);
        }
    }

    closedir(dir);
    if (do_move && moved > 0) {
        sd_sync();
    }

