Smethan/projectZero/ESP32C5/main/main.c
    printf("[WARD_CLEANUP] SUMMARY scanned=%d matched=%d moved=%d failed=%d dry_run=%d\n",
           scanned, matched, moved, failed, do_move ? 0 : 1);
    printf("[WARD_CLEANUP] END\n");
    return failed > 0 ? 1 : 0;
}

static int cmd_wardrive_fix(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wardrive_fix <file>");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char filepath[280];
    char upload_name[128];
    if (!wdgwars_resolve_upload_target(argv[1], filepath, sizeof(filepath), upload_name, sizeof(upload_name)) &&
        !wigle_resolve_upload_target(argv[1], filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
        MY_LOG_INFO(TAG, "wardrive_fix: invalid/missing file: %s", argv[1]);
        return 1;
    }

    char fixed_path[280];
    wdgwars_wigle_stats_t stats;
    printf("[WARD_FIX] BEGIN\n");
    if (!wardrive_fix_file_soft(filepath, upload_name, fixed_path, sizeof(fixed_path), &stats)) {
        printf("[WARD_FIX] filename=%s status=failed\n", upload_name);
        printf("[WARD_FIX] END\n");
        return 1;
    }

    const char *fixed_name = wigle_basename(fixed_path);
    long fixed_size = 0;
    uint32_t fixed_hash = 0;
    wardrive_collect_file_id(fixed_path, &fixed_size, &fixed_hash);

    printf("[WARD_FIX] filename=%s output=%s size=%ld hash=%08lX kept=%d dropped=%d wifi=%d ble=%d bt=%d bad=%d status=ok\n",
           upload_name, fixed_name ? fixed_name : fixed_path,
           fixed_size, (unsigned long)fixed_hash,
           stats.data_rows, stats.bad_rows,
           stats.wifi_rows, stats.ble_rows, stats.bt_rows, stats.bad_rows);
    printf("[WARD_FIX] END\n");
    return 0;
}

static int cmd_wpasec_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wpasec_key set <key> | wpasec_key read");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wpasec_api_key[0] == '\0') {
            MY_LOG_INFO(TAG, "WPA-SEC key: not set");
            MY_LOG_INFO(TAG, "Get your key at: https://wpa-sec.stanev.org/?get_key");
        } else {
            // Show first 4 chars, mask the rest
            MY_LOG_INFO(TAG, "WPA-SEC key: %.4s****", wpasec_api_key);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: wpasec_key set <key>");
            MY_LOG_INFO(TAG, "Get your key at: https://wpa-sec.stanev.org/?get_key");
            return 0;
        }
        const char *key = argv[2];
        if (strlen(key) == 0 || strlen(key) >= WPASEC_KEY_MAX_LEN) {
            MY_LOG_INFO(TAG, "Invalid key length (max %d chars)", WPASEC_KEY_MAX_LEN - 1);
            return 1;
        }
        if (wpasec_save_key_to_nvs(key)) {
            strncpy(wpasec_api_key, key, sizeof(wpasec_api_key) - 1);
            wpasec_api_key[sizeof(wpasec_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WPA-SEC key saved: %.4s****", wpasec_api_key);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WPA-SEC key to NVS");
            return 1;
        }
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: wpasec_key set <key> | wpasec_key read");
    return 0;
}

/**
 * @brief Write all data to esp_tls, handling partial writes
 */
static int wpasec_tls_write_all(esp_tls_t *tls, const char *buf, int len) {
    int written = 0;
    while (written < len) {
        int ret = esp_tls_conn_write(tls, buf + written, len - written);
        if (ret < 0) {
            return ret;
        }
        written += ret;
    }
    return written;
}

/**
 * @brief Upload a single .pcap file to wpa-sec.stanev.org
 *
 * Uses esp_tls directly (not esp_http_client) for full control over
 * TLS settings, specifically to skip server certificate verification.
 *
 * @param filepath  Full path to .pcap file on SD card
 * @param filename  Just the filename (for the Content-Disposition header)
 * @return 0 on success, 1 on duplicate ("already submitted"), -1 on error
 */
static int wpasec_upload_file(const char *filepath, const char *filename) {
    // Read file into memory
    FILE *f = fopen(filepath, "rb");
    if (!f) {
        MY_LOG_INFO(TAG, "  Failed to open: %s", filepath);
        return -1;
    }

    fseek(f, 0, SEEK_END);
    long file_size = ftell(f);
    fseek(f, 0, SEEK_SET);

    if (file_size <= 0 || file_size > 512 * 1024) {
        MY_LOG_INFO(TAG, "  Invalid file size: %ld bytes", file_size);
        fclose(f);
        return -1;
    }

    // Prefer PSRAM for file buffer
    uint8_t *file_buf = NULL;
    if (heap_caps_get_free_size(MALLOC_CAP_SPIRAM) > (size_t)file_size + 1024) {
        file_buf = (uint8_t *)heap_caps_malloc((size_t)file_size, MALLOC_CAP_SPIRAM);
    }
    if (!file_buf) {
        file_buf = (uint8_t *)malloc((size_t)file_size);
    }
    if (!file_buf) {
        MY_LOG_INFO(TAG, "  Memory allocation failed (%ld bytes)", file_size);
        fclose(f);
        return -1;
    }

    size_t bytes_read = fread(file_buf, 1, (size_t)file_size, f);
    fclose(f);

    if (bytes_read != (size_t)file_size) {
        MY_LOG_INFO(TAG, "  Read error: got %zu of %ld bytes", bytes_read, file_size);
        free(file_buf);
        return -1;
    }

    // Build multipart body parts
    char boundary[32];
    snprintf(boundary, sizeof(boundary), "----WpaSec%lu", (unsigned long)(esp_timer_get_time() / 1000));

    char body_start[256];
    int start_len = snprintf(body_start, sizeof(body_start),
        "--%s\r\n"
        "Content-Disposition: form-data; name=\"file\"; filename=\"%s\"\r\n"
        "Content-Type: application/octet-stream\r\n\r\n",
        boundary, filename);

    char body_end[48];
    int end_len = snprintf(body_end, sizeof(body_end), "\r\n--%s--\r\n", boundary);

    int body_total_len = start_len + (int)file_size + end_len;

    // Build HTTP request headers
    char http_headers[512];
    int hdr_len = snprintf(http_headers, sizeof(http_headers),
        "POST / HTTP/1.1\r\n"
        "Host: wpa-sec.stanev.org\r\n"
        "Cookie: key=%s\r\n"
        "Content-Type: multipart/form-data; boundary=%s\r\n"
        "Content-Length: %d\r\n"
        "User-Agent: projectZero-wpasec\r\n"
        "Connection: close\r\n"
        "\r\n",
        wpasec_api_key, boundary, body_total_len);

    // Open TLS connection - skip server cert verification (insecure, like reference code)
    esp_tls_cfg_t tls_cfg = {
        .crt_bundle_attach = NULL,  // Skip certificate verification in ESP-IDF v6.0
        .timeout_ms = 15000,
    };

