Smethan/projectZero/ESP32C5/main/main.c
    esp_tls_t *tls = esp_tls_init();
    if (!tls) {
        MY_LOG_INFO(TAG, "  TLS init failed");
        free(file_buf);
        return -1;
    }

    int ret = esp_tls_conn_http_new_sync(WPASEC_URL, &tls_cfg, tls);
    if (ret < 0) {
        MY_LOG_INFO(TAG, "  TLS connection failed");
        esp_tls_conn_destroy(tls);
        free(file_buf);
        return -1;
    }

    // Send HTTP headers
    if (wpasec_tls_write_all(tls, http_headers, hdr_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send HTTP headers");
        esp_tls_conn_destroy(tls);
        free(file_buf);
        return -1;
    }

    // Send multipart body: start boundary + file data + end boundary
    int write_ok = 1;
    if (wpasec_tls_write_all(tls, body_start, start_len) < 0) write_ok = 0;
    if (write_ok && wpasec_tls_write_all(tls, (const char *)file_buf, (int)file_size) < 0) write_ok = 0;
    if (write_ok && wpasec_tls_write_all(tls, body_end, end_len) < 0) write_ok = 0;
    free(file_buf);

    if (!write_ok) {
        MY_LOG_INFO(TAG, "  Failed to send body");
        esp_tls_conn_destroy(tls);
        return -1;
    }

    // Read response
    char resp_buf[512] = {0};
    int total_read = 0;
    while (total_read < (int)sizeof(resp_buf) - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, sizeof(resp_buf) - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    esp_tls_conn_destroy(tls);

    // Parse HTTP status code from response (e.g. "HTTP/1.1 200 OK")
    int status = 0;
    if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
        const char *sp = strchr(resp_buf, ' ');
        if (sp) status = atoi(sp + 1);
    }

    if (status == 200) {
        if (strstr(resp_buf, "already submitted") != NULL) {
            return 1; // duplicate
        }
        return 0; // success
    } else {
        MY_LOG_INFO(TAG, "  HTTP error %d", status);
        return -1;
    }
}

static int cmd_wpasec_upload(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> WPA-sec", "  Sending PCAPs", "  wpa-sec.stanev", "  Uploading...");

    // 1. Check WiFi STA is connected
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }

    // 2. Check API key
    if (wpasec_api_key[0] == '\0') {
        MY_LOG_INFO(TAG, "No WPA-SEC API key set. Use 'wpasec_key set <key>' first.");
        MY_LOG_INFO(TAG, "Get your key at: https://wpa-sec.stanev.org/?get_key");
        return 1;
    }

    // 3. Init SD card and open handshakes directory
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    DIR *dir = opendir("/sdcard/lab/handshakes");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/handshakes directory");
        return 1;
    }

    // Count .pcap files first
    struct dirent *entry;
    int total_files = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) continue;
        size_t nlen = strlen(entry->d_name);
        if (nlen > 5 && strcasecmp(entry->d_name + nlen - 5, ".pcap") == 0) {
            total_files++;
        }
    }

    if (total_files == 0) {
        MY_LOG_INFO(TAG, "No .pcap files found in /sdcard/lab/handshakes/");
        closedir(dir);
        return 0;
    }

    MY_LOG_INFO(TAG, "Uploading %d handshake(s) to wpa-sec.stanev.org...", total_files);

    // Rewind and process
    rewinddir(dir);
    int current = 0;
    int uploaded = 0;
    int duplicates = 0;
    int failed = 0;

    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) continue;
        size_t nlen = strlen(entry->d_name);
        if (nlen <= 5 || strcasecmp(entry->d_name + nlen - 5, ".pcap") != 0) continue;

        current++;
        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/handshakes/%s", entry->d_name);

        // Get file size for display
        struct stat st;
        long fsize = 0;
        if (stat(filepath, &st) == 0) {
            fsize = (long)st.st_size;
        }

        int result = wpasec_upload_file(filepath, entry->d_name);

        if (result == 0) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", current, total_files, entry->d_name, fsize);
            uploaded++;
        } else if (result == 1) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> already submitted", current, total_files, entry->d_name, fsize);
            duplicates++;
        } else {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", current, total_files, entry->d_name, fsize);
            failed++;
        }

        // Small delay between uploads to let WiFi stack settle
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    closedir(dir);

    MY_LOG_INFO(TAG, "Done: %d uploaded, %d duplicate, %d failed", uploaded, duplicates, failed);
    return (failed > 0) ? 1 : 0;
}

/**
 * @brief Upload a single Wardrive file (.log/.txt/.csv) to api.wigle.net
 *
 * @return 0 on success, 1 on duplicate/skipped, 2 on auth error, -1 on error
 */
static int wigle_upload_file(const char *filepath, const char *filename) {
    const size_t CHUNK_SIZE = 2048;
    const size_t HDR_BUF_SZ = 640;
    const size_t RESP_BUF_SZ = 640;
    int result = -1;
    FILE *f = NULL;
    esp_tls_t *tls = NULL;
    uint8_t *chunk_buf = NULL;
    char *http_headers = NULL;
    char *resp_buf = NULL;

    f = fopen(filepath, "rb");
    if (!f) {
        MY_LOG_INFO(TAG, "  Failed to open: %s", filepath);
        goto cleanup;
    }

    fseek(f, 0, SEEK_END);
    long file_size = ftell(f);
    fseek(f, 0, SEEK_SET);
    if (file_size <= 0 || file_size > 16L * 1024L * 1024L) {
        MY_LOG_INFO(TAG, "  Invalid file size: %ld bytes", file_size);
        goto cleanup;
    }

    char auth_plain[2 * WIGLE_KEY_MAX_LEN + 2];
    int auth_plain_len = snprintf(auth_plain, sizeof(auth_plain), "%s:%s", wigle_api_name, wigle_api_token);
    if (auth_plain_len <= 0 || auth_plain_len >= (int)sizeof(auth_plain)) {
        MY_LOG_INFO(TAG, "  WiGLE credentials are too long");
        goto cleanup;
    }

    unsigned char auth_b64[220];
    size_t auth_b64_len = 0;
    int b64_ret = mbedtls_base64_encode(auth_b64, sizeof(auth_b64) - 1, &auth_b64_len,
                                        (const unsigned char *)auth_plain, (size_t)auth_plain_len);
    if (b64_ret != 0 || auth_b64_len == 0 || auth_b64_len >= sizeof(auth_b64)) {
        MY_LOG_INFO(TAG, "  Failed to build WiGLE auth header");
        goto cleanup;
    }
    auth_b64[auth_b64_len] = '\0';

    char boundary[40];
    snprintf(boundary, sizeof(boundary), "----WiGLE%lu", (unsigned long)(esp_timer_get_time() / 1000));

    char body_start[256];
    int start_len = snprintf(body_start, sizeof(body_start),
                             "--%s\r\n"
                             "Content-Disposition: form-data; name=\"file\"; filename=\"%s\"\r\n"
                             "Content-Type: text/csv\r\n\r\n",
                             boundary, filename);
    if (start_len <= 0 || start_len >= (int)sizeof(body_start)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart header");
        goto cleanup;
    }

    char body_end[64];
    int end_len = snprintf(body_end, sizeof(body_end), "\r\n--%s--\r\n", boundary);
    if (end_len <= 0 || end_len >= (int)sizeof(body_end)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart footer");
        goto cleanup;
    }

