Smethan/projectZero/ESP32C5/main/main.c
    int64_t body_total_len_64 = (int64_t)start_len + (int64_t)file_size + (int64_t)end_len;
    if (body_total_len_64 <= 0 || body_total_len_64 > INT_MAX) {
        MY_LOG_INFO(TAG, "  File too large for HTTP content-length: %ld bytes", file_size);
        goto cleanup;
    }
    int body_total_len = (int)body_total_len_64;

    http_headers = (char *)heap_caps_malloc(HDR_BUF_SZ, MALLOC_CAP_8BIT);
    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!chunk_buf) {
        chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!http_headers || !resp_buf || !chunk_buf) {
        MY_LOG_INFO(TAG, "  Buffer allocation failed (hdr/resp/chunk)");
        goto cleanup;
    }

    int hdr_len = snprintf(http_headers, HDR_BUF_SZ,
                           "POST /api/v2/file/upload HTTP/1.1\r\n"
                           "Host: api.wigle.net\r\n"
                           "Authorization: Basic %s\r\n"
                           "Content-Type: multipart/form-data; boundary=%s\r\n"
                           "Content-Length: %d\r\n"
                           "User-Agent: projectZero-wigle\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           (const char *)auth_b64, boundary, body_total_len);
    if (hdr_len <= 0 || hdr_len >= (int)HDR_BUF_SZ) {
        MY_LOG_INFO(TAG, "  Failed to build HTTP headers");
        goto cleanup;
    }

    esp_tls_cfg_t tls_cfg = {
        .crt_bundle_attach = NULL,
        .timeout_ms = 20000,
    };

    tls = esp_tls_init();
    if (!tls) {
        MY_LOG_INFO(TAG, "  TLS init failed");
        goto cleanup;
    }

    int ret = esp_tls_conn_http_new_sync(WIGLE_URL, &tls_cfg, tls);
    if (ret < 0) {
        MY_LOG_INFO(TAG, "  TLS connection failed");
        goto cleanup;
    }

    if (wpasec_tls_write_all(tls, http_headers, hdr_len) < 0 ||
        wpasec_tls_write_all(tls, body_start, start_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send request headers/body start");
        goto cleanup;
    }

    while (1) {
        size_t bytes_read = fread(chunk_buf, 1, CHUNK_SIZE, f);
        if (bytes_read > 0) {
            if (wpasec_tls_write_all(tls, (const char *)chunk_buf, (int)bytes_read) < 0) {
                MY_LOG_INFO(TAG, "  Failed to send file chunk");
                goto cleanup;
            }
        }
        if (bytes_read < CHUNK_SIZE) {
            if (ferror(f)) {
                MY_LOG_INFO(TAG, "  Read error while streaming file");
                goto cleanup;
            }
            break;
        }
    }

    if (wpasec_tls_write_all(tls, body_end, end_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send multipart footer");
        goto cleanup;
    }

    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    int status = 0;
    if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
        const char *sp = strchr(resp_buf, ' ');
        if (sp) {
            status = atoi(sp + 1);
        }
    }

    bool duplicate = (strstr(resp_buf, "already") != NULL ||
                      strstr(resp_buf, "Already") != NULL ||
                      strstr(resp_buf, "duplicate") != NULL ||
                      strstr(resp_buf, "Duplicate") != NULL);
    bool success_false = (strstr(resp_buf, "\"success\":false") != NULL ||
                          strstr(resp_buf, "\"success\": false") != NULL);

    if (status == 200 || status == 201 || status == 202) {
        if (duplicate) {
            result = 1;
            goto cleanup;
        }
        if (success_false) {
            MY_LOG_INFO(TAG, "  WiGLE API returned success=false");
            result = -1;
            goto cleanup;
        }
        result = 0;
        goto cleanup;
    }

    if (status == 401 || status == 403) {
        result = 2;
        goto cleanup;
    }
    if (status == 409) {
        result = 1;
        goto cleanup;
    }

    MY_LOG_INFO(TAG, "  HTTP error %d", status);
    result = -1;

cleanup:
    if (f) {
        fclose(f);
    }
    if (tls) {
        esp_tls_conn_destroy(tls);
    }
    if (chunk_buf) {
        free(chunk_buf);
    }
    if (http_headers) {
        free(http_headers);
    }
    if (resp_buf) {
        free(resp_buf);
    }
    return result;
}

static int cmd_wigle_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token> | wigle_key set <api_name:api_token> | wigle_key read | wigle_key clear");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') {
            MY_LOG_INFO(TAG, "WiGLE key: not set");
            MY_LOG_INFO(TAG, "Set via: wigle_key set <api_name> <api_token>");
            MY_LOG_INFO(TAG, "Or place api_name:api_token in /sdcard/lab/wigle.txt before upload.");
        } else {
            MY_LOG_INFO(TAG, "WiGLE key: %.4s****:%.4s****", wigle_api_name, wigle_api_token);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "clear") == 0) {
        if (wigle_clear_key_from_nvs()) {
            wigle_api_name[0] = '\0';
            wigle_api_token[0] = '\0';
            MY_LOG_INFO(TAG, "WiGLE key cleared from NVS.");
        } else {
            MY_LOG_INFO(TAG, "Failed to clear WiGLE key from NVS.");
            return 1;
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        char api_name[WIGLE_KEY_MAX_LEN] = {0};
        char api_token[WIGLE_KEY_MAX_LEN] = {0};

        if (argc >= 4) {
            if (strlen(argv[2]) >= sizeof(api_name) || strlen(argv[3]) >= sizeof(api_token)) {
                MY_LOG_INFO(TAG, "Invalid key length (max %d chars each)", WIGLE_KEY_MAX_LEN - 1);
                return 1;
            }
            snprintf(api_name, sizeof(api_name), "%s", argv[2]);
            snprintf(api_token, sizeof(api_token), "%s", argv[3]);
        } else if (argc == 3) {
            if (!wigle_split_key_pair(argv[2], api_name, sizeof(api_name), api_token, sizeof(api_token))) {
                MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token>");
                MY_LOG_INFO(TAG, "Or:    wigle_key set <api_name:api_token>");
                return 1;
            }
        } else {
            MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token>");
            MY_LOG_INFO(TAG, "Or:    wigle_key set <api_name:api_token>");
            return 0;
        }

