Smethan/projectZero/ESP32C5/main/main.c
        if (api_name[0] == '\0' || api_token[0] == '\0') {
            MY_LOG_INFO(TAG, "WiGLE API name/token must not be empty");
            return 1;
        }

        if (wigle_save_key_to_nvs(api_name, api_token)) {
            snprintf(wigle_api_name, sizeof(wigle_api_name), "%s", api_name);
            snprintf(wigle_api_token, sizeof(wigle_api_token), "%s", api_token);
            MY_LOG_INFO(TAG, "WiGLE key saved: %.4s****:%.4s****", wigle_api_name, wigle_api_token);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WiGLE key to NVS");
            return 1;
        }
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token> | wigle_key set <api_name:api_token> | wigle_key read | wigle_key clear");
    return 0;
}

static int cmd_wigle_upload(int argc, char **argv) {
    oled_display_update_full("> WiGLE", "  Sending files", "  api.wigle.net", "  Uploading...");

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "WIFI NOT CONNECTED");
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    create_sd_directories();
    wigle_load_key_from_sd();

    if (wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') {
        MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
        MY_LOG_INFO(TAG, "Use 'wigle_key set <api_name> <api_token>' or /sdcard/lab/wigle.txt");
        return 1;
    }

    int uploaded = 0;
    int skipped = 0;
    int failed = 0;
    bool auth_failed = false;
    bool force_all = (argc > 1 && strcasecmp(argv[1], "all") == 0);

    // If files are passed as args, upload only those selected files.
    if (argc > 1 && !force_all) {
        int total_files = argc - 1;
        MY_LOG_INFO(TAG, "Uploading %d selected Wardrive file(s) to api.wigle.net...", total_files);

        for (int i = 1; i < argc; i++) {
            const char *arg = argv[i];
            char filepath[280];
            char upload_name[128];

            if (!wigle_resolve_upload_target(arg, filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (invalid/missing file)", i, total_files, arg ? arg : "(null)");
                failed++;
                continue;
            }

            struct stat st;
            long fsize = 0;
            if (stat(filepath, &st) == 0) {
                fsize = (long)st.st_size;
            }

            uint32_t hash = 0;
            if (!wardrive_collect_file_id(filepath, &fsize, &hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", i, total_files, upload_name);
                failed++;
                continue;
            }

            wdgwars_wigle_stats_t wigle_stats;
            bool use_sanitized = false;
            if (!wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", i, total_files, upload_name, fsize);
                failed++;
                continue;
            }

            if (upload_state_is_done("wigle", upload_name, fsize, hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", i, total_files, upload_name, fsize);
                skipped++;
                if (use_sanitized) unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
                continue;
            }

            const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
            int result = wigle_upload_file(upload_path, upload_name);
            if (use_sanitized) {
                unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
            }
            if (result == 0) {
                upload_state_append("wigle", upload_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", i, total_files, upload_name, fsize);
                uploaded++;
            } else if (result == 1) {
                upload_state_append("wigle", upload_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (duplicate)", i, total_files, upload_name, fsize);
                skipped++;
            } else if (result == 2) {
                MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", i, total_files, upload_name, fsize);
                failed++;
                auth_failed = true;
                break;
            } else {
                upload_state_append("wigle", upload_name, fsize, hash, "failed", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", i, total_files, upload_name, fsize);
                failed++;
            }

            vTaskDelay(pdMS_TO_TICKS(250));
        }

        MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed", uploaded, skipped, failed);
        if (auth_failed) {
            return 1;
        }
        return (failed > 0) ? 1 : 0;
    }

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    struct dirent *entry;
    int total_files = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wigle_is_upload_candidate(entry->d_name)) {
            total_files++;
        }
    }

    if (total_files == 0) {
        MY_LOG_INFO(TAG, "No Wardrive files (.log/.txt/.csv) found in /sdcard/lab/wardrives/");
        MY_LOG_INFO(TAG, "Done: 0 uploaded, 0 skipped, 0 failed");
        closedir(dir);
        return 0;
    }

    MY_LOG_INFO(TAG, "Uploading %d Wardrive file(s) to api.wigle.net%s...", total_files,
                force_all ? " (force all)" : "");

    rewinddir(dir);
    int current = 0;

