Smethan/projectZero/ESP32C5/main/main.c
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name)) {
            continue;
        }

        current++;
        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);

        struct stat st;
        long fsize = 0;
        if (stat(filepath, &st) == 0) {
            fsize = (long)st.st_size;
        }

        uint32_t hash = 0;
        if (!wardrive_collect_file_id(filepath, &fsize, &hash)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", current, total_files, entry->d_name);
            failed++;
            continue;
        }

        wdgwars_wigle_stats_t wigle_stats;
        bool use_sanitized = false;
        if (!wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", current, total_files, entry->d_name, fsize);
            failed++;
            continue;
        }

        if (!force_all && upload_state_is_done("wigle", entry->d_name, fsize, hash)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", current, total_files, entry->d_name, fsize);
            skipped++;
            if (use_sanitized) unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
            continue;
        }

        const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
        int result = wigle_upload_file(upload_path, entry->d_name);
        if (use_sanitized) {
            unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
        }
        if (result == 0) {
            upload_state_append("wigle", entry->d_name, fsize, hash, "done", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", current, total_files, entry->d_name, fsize);
            uploaded++;
        } else if (result == 1) {
            upload_state_append("wigle", entry->d_name, fsize, hash, "done", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (duplicate)", current, total_files, entry->d_name, fsize);
            skipped++;
        } else if (result == 2) {
            MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", current, total_files, entry->d_name, fsize);
            failed++;
            auth_failed = true;
            break;
        } else {
            upload_state_append("wigle", entry->d_name, fsize, hash, "failed", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", current, total_files, entry->d_name, fsize);
            failed++;
        }

        vTaskDelay(pdMS_TO_TICKS(400));
    }

    closedir(dir);

    MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed", uploaded, skipped, failed);
    if (auth_failed) {
        return 1;
    }
    return (failed > 0) ? 1 : 0;
}

static int wdgwars_parse_retry_after_ms(const char *resp) {
    if (!resp) {
        return 0;
    }

    const char *p = strcasestr(resp, "Retry-After:");
    if (!p) {
        return 0;
    }
    p += strlen("Retry-After:");
    while (*p == ' ' || *p == '\t') {
        p++;
    }
    int seconds = atoi(p);
    if (seconds <= 0) {
        return 0;
    }
    if (seconds > 3600) {
        seconds = 3600;
    }
    return seconds * 1000;
}

static int wdgwars_next_backoff_ms(int retry_after_ms) {
    if (retry_after_ms > 0) {
        return retry_after_ms;
    }

    int shift = wdgwars_rate_limit_streak;
    if (shift < 0) shift = 0;
    if (shift > 3) shift = 3;
    int backoff = WDGWARS_BACKOFF_BASE_MS << shift;
    if (backoff > WDGWARS_BACKOFF_MAX_MS) {
        backoff = WDGWARS_BACKOFF_MAX_MS;
    }
    backoff += (int)((esp_timer_get_time() / 1000) % 5000); // small deterministic jitter
    return backoff;
}

static void wdgwars_note_rate_limited(int retry_after_ms) {
    wdgwars_rate_limit_streak++;
    int backoff_ms = wdgwars_next_backoff_ms(retry_after_ms);
    wdgwars_circuit_open_until_us = esp_timer_get_time() + ((int64_t)backoff_ms * 1000LL);
    MY_LOG_INFO(TAG, "WDGWars rate limited (HTTP 429). Circuit open for %d s.",
                (backoff_ms + 999) / 1000);
}

static void wdgwars_note_success(void) {
    wdgwars_rate_limit_streak = 0;
    wdgwars_circuit_open_until_us = 0;
}

static bool wdgwars_circuit_allows_request(void) {
    int64_t now = esp_timer_get_time();
    if (wdgwars_circuit_open_until_us > now) {
        int wait_s = (int)((wdgwars_circuit_open_until_us - now + 999999LL) / 1000000LL);
        MY_LOG_INFO(TAG, "WDGWars circuit open, retry after %d s", wait_s);
        return false;
    }
    return true;
}

static int wdgwars_poll_upload_job(int job_id) {
    const size_t REQ_BUF_SZ = 384;
    const size_t RESP_BUF_SZ = 1536;
    int result = -1;
    esp_tls_t *tls = NULL;
    char *req_buf = NULL;
    char *resp_buf = NULL;

    req_buf = (char *)heap_caps_malloc(REQ_BUF_SZ, MALLOC_CAP_8BIT);
    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    if (!req_buf || !resp_buf) {
        MY_LOG_INFO(TAG, "  Poll buffer allocation failed");
        goto cleanup;
    }

    for (int attempt = 0; attempt < 90; attempt++) {
        char url[128];
        snprintf(url, sizeof(url), "%s%d", WDGWARS_V2_JOB_URL_BASE, job_id);

        int req_len = snprintf(req_buf, REQ_BUF_SZ,
                               "GET /api/v2/upload-job/%d HTTP/1.1\r\n"
                               "Host: wdgwars.pl\r\n"
                               "X-API-Key: %s\r\n"
                               "User-Agent: projectZero-wdgwars\r\n"
                               "Connection: close\r\n"
                               "\r\n",
                               job_id, wdgwars_api_key);
        if (req_len <= 0 || req_len >= (int)REQ_BUF_SZ) {
            MY_LOG_INFO(TAG, "  Failed to build poll request");
            goto cleanup;
        }

        esp_tls_cfg_t tls_cfg = { .crt_bundle_attach = NULL, .timeout_ms = 15000 };
        tls = esp_tls_init();
        if (!tls) {
            MY_LOG_INFO(TAG, "  Poll TLS init failed");
            goto cleanup;
        }
        if (esp_tls_conn_http_new_sync(url, &tls_cfg, tls) < 0) {
            MY_LOG_INFO(TAG, "  Poll TLS connection failed");
            goto cleanup;
        }
        if (wpasec_tls_write_all(tls, req_buf, req_len) < 0) {
            MY_LOG_INFO(TAG, "  Failed to send poll request");
            goto cleanup;
        }

