Smethan/projectZero/ESP32C5/main/main.c
        memset(resp_buf, 0, RESP_BUF_SZ);
        int total_read = 0;
        while (total_read < (int)RESP_BUF_SZ - 1) {
            int ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
            if (ret <= 0) break;
            total_read += ret;
        }
        resp_buf[total_read] = '\0';
        esp_tls_conn_destroy(tls);
        tls = NULL;

        int http_status = 0;
        if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
            const char *sp = strchr(resp_buf, ' ');
            if (sp) {
                http_status = atoi(sp + 1);
            }
        }
        if (http_status == 401 || http_status == 403) {
            result = 2;
            goto cleanup;
        }
        if (http_status == 429) {
            wdgwars_note_rate_limited(wdgwars_parse_retry_after_ms(resp_buf));
            result = WDGWARS_RESULT_RATE_LIMITED;
            goto cleanup;
        }
        if (http_status != 200) {
            MY_LOG_INFO(TAG, "  Poll HTTP error %d", http_status);
            goto cleanup;
        }

        const char *json = strchr(resp_buf, '{');
        if (!json) {
            MY_LOG_INFO(TAG, "  Poll response missing JSON");
            goto cleanup;
        }

        if (strstr(json, "\"status\":\"done\"") ||
            strstr(json, "\"status\": \"done\"")) {
            result = 0;
            goto cleanup;
        }
        if (strstr(json, "\"status\":\"failed\"") ||
            strstr(json, "\"status\": \"failed\"")) {
            MY_LOG_INFO(TAG, "  WDGWars job failed");
            goto cleanup;
        }

        cJSON *root = cJSON_Parse(json);
        if (!root) {
            MY_LOG_INFO(TAG, "  Poll JSON parse failed");
            goto cleanup;
        }

        cJSON *status = cJSON_GetObjectItem(root, "status");
        if (cJSON_IsString(status) && status->valuestring) {
            if (strcmp(status->valuestring, "done") == 0) {
                cJSON_Delete(root);
                result = 0;
                goto cleanup;
            }
            if (strcmp(status->valuestring, "failed") == 0) {
                cJSON *err = cJSON_GetObjectItem(root, "error");
                if (cJSON_IsString(err) && err->valuestring) {
                    MY_LOG_INFO(TAG, "  WDGWars job failed: %s", err->valuestring);
                } else {
                    MY_LOG_INFO(TAG, "  WDGWars job failed");
                }
                cJSON_Delete(root);
                goto cleanup;
            }
        }
        cJSON_Delete(root);

        if ((attempt % 5) == 0) {
            MY_LOG_INFO(TAG, "  WDGWars job %d pending...", job_id);
        }
        vTaskDelay(pdMS_TO_TICKS(2000));
    }

    MY_LOG_INFO(TAG, "  WDGWars job %d poll timeout", job_id);

cleanup:
    if (tls) {
        esp_tls_conn_destroy(tls);
    }
    if (req_buf) {
        free(req_buf);
    }
    if (resp_buf) {
        free(resp_buf);
    }
    return result;
}

/**
 * @brief Upload a single Wardrive file (.log/.csv/.gz) to wdgwars.pl v2 queue
 *
 * @return 0 on success, 1 on duplicate/skipped, 2 on auth error, -1 on error
 */
static int wdgwars_upload_file(const char *filepath, const char *filename) {
    const size_t CHUNK_SIZE = 2048;
    const size_t HDR_BUF_SZ = 640;
    const size_t RESP_BUF_SZ = 640;
    int result = -1;
    FILE *f = NULL;
    esp_tls_t *tls = NULL;
    uint8_t *chunk_buf = NULL;
    char *http_headers = NULL;
    char *resp_buf = NULL;

    f = fopen(filepath, "rb");
    if (!f) {
        MY_LOG_INFO(TAG, "  Failed to open: %s", filepath);
        goto cleanup;
    }

    fseek(f, 0, SEEK_END);
    long file_size = ftell(f);
    fseek(f, 0, SEEK_SET);
    if (file_size <= 0 || file_size > WDGWARS_MAX_UPLOAD_BYTES) {
        MY_LOG_INFO(TAG, "  Invalid file size: %ld bytes", file_size);
        goto cleanup;
    }

    char boundary[40];
    snprintf(boundary, sizeof(boundary), "----WDGWars%lu", (unsigned long)(esp_timer_get_time() / 1000));

    const char *content_type = "text/csv";
    size_t name_len = strlen(filename);
    if (name_len >= 4 && strcasecmp(filename + name_len - 4, ".log") == 0) {
        content_type = "text/plain";
    } else if (name_len >= 3 && strcasecmp(filename + name_len - 3, ".gz") == 0) {
        content_type = "application/gzip";
    }

    char body_start[256];
    int start_len = snprintf(body_start, sizeof(body_start),
                             "--%s\r\n"
                             "Content-Disposition: form-data; name=\"file\"; filename=\"%s\"\r\n"
                             "Content-Type: %s\r\n\r\n",
                             boundary, filename, content_type);
    if (start_len <= 0 || start_len >= (int)sizeof(body_start)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart header");
        goto cleanup;
    }

    char body_end[64];
    int end_len = snprintf(body_end, sizeof(body_end), "\r\n--%s--\r\n", boundary);
    if (end_len <= 0 || end_len >= (int)sizeof(body_end)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart footer");
        goto cleanup;
    }

    int64_t body_total_len_64 = (int64_t)start_len + (int64_t)file_size + (int64_t)end_len;
    if (body_total_len_64 <= 0 || body_total_len_64 > INT_MAX) {
        MY_LOG_INFO(TAG, "  File too large for HTTP content-length: %ld bytes", file_size);
        goto cleanup;
    }
    int body_total_len = (int)body_total_len_64;

    http_headers = (char *)heap_caps_malloc(HDR_BUF_SZ, MALLOC_CAP_8BIT);
    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!chunk_buf) {
        chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!http_headers || !resp_buf || !chunk_buf) {
        MY_LOG_INFO(TAG, "  Buffer allocation failed (hdr/resp/chunk)");
        goto cleanup;
    }

    int hdr_len = snprintf(http_headers, HDR_BUF_SZ,
                           "POST /api/v2/upload-csv HTTP/1.1\r\n"
                           "Host: wdgwars.pl\r\n"
                           "X-API-Key: %s\r\n"
                           "Content-Type: multipart/form-data; boundary=%s\r\n"
                           "Content-Length: %d\r\n"
                           "User-Agent: projectZero-wdgwars\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           wdgwars_api_key, boundary, body_total_len);
    if (hdr_len <= 0 || hdr_len >= (int)HDR_BUF_SZ) {
        MY_LOG_INFO(TAG, "  Failed to build HTTP headers");
        goto cleanup;
    }

    esp_tls_cfg_t tls_cfg = {
        .crt_bundle_attach = NULL,
        .timeout_ms = 20000,
    };

    tls = esp_tls_init();
    if (!tls) {
        MY_LOG_INFO(TAG, "  TLS init failed");
        goto cleanup;
    }

    int ret = esp_tls_conn_http_new_sync(WDGWARS_V2_URL, &tls_cfg, tls);
    if (ret < 0) {
        MY_LOG_INFO(TAG, "  TLS connection failed");
        goto cleanup;
    }

    if (wpasec_tls_write_all(tls, http_headers, hdr_len) < 0 ||
        wpasec_tls_write_all(tls, body_start, start_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send request headers/body start");
        goto cleanup;
    }

    while (1) {
        size_t bytes_read = fread(chunk_buf, 1, CHUNK_SIZE, f);
        if (bytes_read > 0) {
            if (wpasec_tls_write_all(tls, (const char *)chunk_buf, (int)bytes_read) < 0) {
                MY_LOG_INFO(TAG, "  Failed to send file chunk");
                goto cleanup;
            }
        }
        if (bytes_read < CHUNK_SIZE) {
            if (ferror(f)) {
                MY_LOG_INFO(TAG, "  Read error while streaming file");
                goto cleanup;
            }
            break;
        }
    }

    if (wpasec_tls_write_all(tls, body_end, end_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send multipart footer");
        goto cleanup;
    }

