Smethan/projectZero/ESP32C5/main/main.c
    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    int status = 0;
    if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
        const char *sp = strchr(resp_buf, ' ');
        if (sp) {
            status = atoi(sp + 1);
        }
    }

    if (status == 401 || status == 403) {
        result = 2;
        goto cleanup;
    }
    if (status == 429) {
        wdgwars_note_rate_limited(wdgwars_parse_retry_after_ms(resp_buf));
        result = WDGWARS_RESULT_RATE_LIMITED;
        goto cleanup;
    }

    if (status == 200 || status == 201 || status == 202) {
        const char *json = strchr(resp_buf, '{');
        if (!json) {
            result = 0;
            goto cleanup;
        }

        cJSON *root = cJSON_Parse(json);
        if (!root) {
            MY_LOG_INFO(TAG, "  WDGWars response JSON parse failed");
            goto cleanup;
        }

        cJSON *job_id = cJSON_GetObjectItem(root, "job_id");
        if (cJSON_IsNumber(job_id)) {
            int id = job_id->valueint;
            cJSON_Delete(root);
            MY_LOG_INFO(TAG, "  WDGWars job %d queued", id);
            result = wdgwars_poll_upload_job(id);
            goto cleanup;
        }

        cJSON *ok = cJSON_GetObjectItem(root, "ok");
        if (cJSON_IsBool(ok) && cJSON_IsTrue(ok)) {
            result = 0;
        } else {
            MY_LOG_INFO(TAG, "  WDGWars response missing job_id");
            result = -1;
        }
        cJSON_Delete(root);
        goto cleanup;
    }
    if (status == 409) {
        result = 1;
        goto cleanup;
    }

    MY_LOG_INFO(TAG, "  HTTP error %d", status);
    result = -1;

cleanup:
    if (f) {
        fclose(f);
    }
    if (tls) {
        esp_tls_conn_destroy(tls);
    }
    if (chunk_buf) {
        free(chunk_buf);
    }
    if (http_headers) {
        free(http_headers);
    }
    if (resp_buf) {
        free(resp_buf);
    }
    return result;
}

static int cmd_wdgwars_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key> | wdgwars_key read | wdgwars_key clear");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wdgwars_api_key[0] == '\0') {
            MY_LOG_INFO(TAG, "WDGWars key: not set");
            MY_LOG_INFO(TAG, "Set via: wdgwars_key set <key>");
            MY_LOG_INFO(TAG, "Or place the API key in /sdcard/lab/wdgwars.txt before upload.");
        } else {
            MY_LOG_INFO(TAG, "WDGWars key: %.4s****", wdgwars_api_key);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "clear") == 0) {
        if (wdgwars_clear_key_from_nvs()) {
            wdgwars_api_key[0] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key cleared from NVS.");
        } else {
            MY_LOG_INFO(TAG, "Failed to clear WDGWars key from NVS.");
            return 1;
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key>");
            return 0;
        }
        const char *key = argv[2];
        if (strlen(key) == 0 || strlen(key) >= WDGWARS_KEY_MAX_LEN) {
            MY_LOG_INFO(TAG, "Invalid key length (max %d chars)", WDGWARS_KEY_MAX_LEN - 1);
            return 1;
        }
        if (wdgwars_save_key_to_nvs(key)) {
            strncpy(wdgwars_api_key, key, sizeof(wdgwars_api_key) - 1);
            wdgwars_api_key[sizeof(wdgwars_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key saved: %.4s****", wdgwars_api_key);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WDGWars key to NVS");
            return 1;
        }
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key> | wdgwars_key read | wdgwars_key clear");
    return 0;
}

static void wdgwars_log_history_result(cJSON *entry) {
    if (!entry) {
        return;
    }

    cJSON *endpoint = cJSON_GetObjectItem(entry, "endpoint");
    cJSON *file_size = cJSON_GetObjectItem(entry, "file_size");
    cJSON *created_at = cJSON_GetObjectItem(entry, "created_at");
    cJSON *result = cJSON_GetObjectItem(entry, "result");

    const char *endpoint_str = (cJSON_IsString(endpoint) && endpoint->valuestring) ? endpoint->valuestring : "unknown";
    const char *created_str = (cJSON_IsString(created_at) && created_at->valuestring) ? created_at->valuestring : "unknown";
    int size_val = cJSON_IsNumber(file_size) ? file_size->valueint : -1;

    MY_LOG_INFO(TAG, "  Upload history: endpoint=%s size=%d at=%s",
                endpoint_str, size_val, created_str);

    if (cJSON_IsObject(result)) {
        cJSON *imported = cJSON_GetObjectItem(result, "imported");
        cJSON *captured = cJSON_GetObjectItem(result, "captured");
        cJSON *updated = cJSON_GetObjectItem(result, "updated");
        cJSON *duplicates = cJSON_GetObjectItem(result, "duplicates");
        cJSON *no_gps = cJSON_GetObjectItem(result, "no_gps");
        cJSON *bad_rows = cJSON_GetObjectItem(result, "bad_rows");
        cJSON *cooldown = cJSON_GetObjectItem(result, "cooldown");

        MY_LOG_INFO(TAG, "  Result: imported=%d captured=%d updated=%d duplicates=%d no_gps=%d bad_rows=%d cooldown=%d",
                    cJSON_IsNumber(imported) ? imported->valueint : 0,
                    cJSON_IsNumber(captured) ? captured->valueint : 0,
                    cJSON_IsNumber(updated) ? updated->valueint : 0,
                    cJSON_IsNumber(duplicates) ? duplicates->valueint : 0,
                    cJSON_IsNumber(no_gps) ? no_gps->valueint : 0,
                    cJSON_IsNumber(bad_rows) ? bad_rows->valueint : 0,
                    cJSON_IsNumber(cooldown) ? cooldown->valueint : 0);
    }
}

/**
 * @brief Query upload history and check if filename appears in the last uploads.
 * @return true if found (upload confirmed), false otherwise
 */
static bool wdgwars_check_in_history(const char *filename) {
    const size_t RESP_BUF_SZ = 4096;
    bool found = false;
    esp_tls_t *tls = NULL;
    char *resp_buf = NULL;
    char *req_buf = NULL;

    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    req_buf  = (char *)heap_caps_malloc(256, MALLOC_CAP_8BIT);
    if (!resp_buf || !req_buf) goto hist_cleanup;

    int req_len = snprintf(req_buf, 256,
                           "GET /api/upload-history?limit=5 HTTP/1.1\r\n"
                           "Host: wdgwars.pl\r\n"
                           "X-API-Key: %s\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           wdgwars_api_key);
    if (req_len <= 0 || req_len >= 256) goto hist_cleanup;

    esp_tls_cfg_t tls_cfg = { .crt_bundle_attach = NULL, .timeout_ms = 10000 };
    tls = esp_tls_init();
    if (!tls) goto hist_cleanup;
    if (esp_tls_conn_http_new_sync(WDGWARS_HISTORY_URL, &tls_cfg, tls) < 0) goto hist_cleanup;
    if (wpasec_tls_write_all(tls, req_buf, req_len) < 0) goto hist_cleanup;

