Smethan/projectZero/ESP32C5/main/main.c
    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    int ret;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    // Find JSON body after HTTP headers
    const char *body = strstr(resp_buf, "\r\n\r\n");
    if (!body) goto hist_cleanup;
    body += 4;

    cJSON *root = cJSON_Parse(body);
    if (!root) goto hist_cleanup;

    cJSON *uploads = cJSON_GetObjectItem(root, "uploads");
    if (cJSON_IsArray(uploads)) {
        int n = cJSON_GetArraySize(uploads);
        for (int i = 0; i < n && !found; i++) {
            cJSON *entry = cJSON_GetArrayItem(uploads, i);
            cJSON *fn = cJSON_GetObjectItem(entry, "filename");
            if (cJSON_IsString(fn) && fn->valuestring &&
                strcmp(fn->valuestring, filename) == 0) {
                found = true;
                wdgwars_log_history_result(entry);
            }
        }
    }
    cJSON_Delete(root);

hist_cleanup:
    if (tls) esp_tls_conn_destroy(tls);
    if (resp_buf) free(resp_buf);
    if (req_buf)  free(req_buf);
    return found;
}

static int wdgwars_upload_file_with_retry(const char *filepath, const char *filename) {
    if (!wdgwars_circuit_allows_request()) {
        return WDGWARS_RESULT_RATE_LIMITED;
    }

    int result = wdgwars_upload_file(filepath, filename);
    if (result == WDGWARS_RESULT_RATE_LIMITED) {
        return result;
    }
    if (result == 0) {
        wdgwars_note_success();
        vTaskDelay(pdMS_TO_TICKS(1000));
        if (wdgwars_check_in_history(filename)) {
            MY_LOG_INFO(TAG, "  Upload confirmed via history");
        }
        return 0;
    }
    if (result != -1) return result;

    // HTTP error (likely timeout reading response) — verify via history before retrying
    MY_LOG_INFO(TAG, "  Upload response not received, checking history...");
    vTaskDelay(pdMS_TO_TICKS(3000));
    if (wdgwars_check_in_history(filename)) {
        MY_LOG_INFO(TAG, "  Upload confirmed via history");
        return 0;
    }

    // Not in history yet — try once more
    MY_LOG_INFO(TAG, "  Not found in history, retrying upload...");
    if (!wdgwars_circuit_allows_request()) {
        return WDGWARS_RESULT_RATE_LIMITED;
    }
    result = wdgwars_upload_file(filepath, filename);
    if (result == WDGWARS_RESULT_RATE_LIMITED) {
        return result;
    }
    if (result == 1) {
        // Duplicate on retry = first attempt landed after all
        wdgwars_note_success();
        MY_LOG_INFO(TAG, "  Upload confirmed (duplicate on retry)");
        return 0;
    }
    if (result == 0) {
        wdgwars_note_success();
    }
    return result;
}

static int cmd_wdgwars_upload(int argc, char **argv) {
    oled_display_update_full("> WDGWars", "  Sending files", "  wdgwars.pl", "  Uploading...");

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "WIFI NOT CONNECTED");
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    create_sd_directories();
    wdgwars_load_key_from_sd();

    if (wdgwars_api_key[0] == '\0') {
        MY_LOG_INFO(TAG, "NO WDGWARS CREDENTIALS");
        MY_LOG_INFO(TAG, "Use 'wdgwars_key set <key>' or /sdcard/lab/wdgwars.txt");
        return 1;
    }

    if (!wdgwars_circuit_allows_request()) {
        return 0;
    }

    int uploaded = 0;
    int skipped = 0;
    int failed = 0;
    int rate_limited = 0;
    bool auth_failed = false;
    bool force_all = (argc > 1 && strcasecmp(argv[1], "all") == 0);

    if (argc > 1 && !force_all) {
        int total_files = argc - 1;
        MY_LOG_INFO(TAG, "Uploading %d selected Wardrive file(s) to wdgwars.pl...", total_files);

        for (int i = 1; i < argc; i++) {
            const char *arg = argv[i];
            char filepath[280];
            char upload_name[128];

            if (!wdgwars_resolve_upload_target(arg, filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (invalid/missing file)", i, total_files, arg ? arg : "(null)");
                failed++;
                continue;
            }

            struct stat st;
            long fsize = 0;
            if (stat(filepath, &st) == 0) {
                fsize = (long)st.st_size;
            }

            wdgwars_wigle_stats_t wigle_stats;
            bool use_sanitized = false;
            uint32_t hash = 0;
            if (!wardrive_collect_file_id(filepath, &fsize, &hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", i, total_files, upload_name);
                failed++;
                continue;
            }

            if (wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
                if (upload_state_is_done("wdgwars", upload_name, fsize, hash)) {
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", i, total_files, upload_name, fsize);
                    skipped++;
                    if (use_sanitized) unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
                    continue;
                }

                const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
                if (use_sanitized && stat(upload_path, &st) == 0) {
                    /* Keep fsize/hash from the original file for upload_state identity. */
                }

                int result = wdgwars_upload_file_with_retry(upload_path, upload_name);
                if (use_sanitized) {
                    unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
                }
                if (result == 0) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "done", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", i, total_files, upload_name, fsize);
                    uploaded++;
                } else if (result == 1) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "done", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped", i, total_files, upload_name, fsize);
                    skipped++;
                } else if (result == 2) {
                    MY_LOG_INFO(TAG, "WDGWARS AUTH FAILED");
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", i, total_files, upload_name, fsize);
                    failed++;
                    auth_failed = true;
                    break;
                } else if (result == WDGWARS_RESULT_RATE_LIMITED) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "rate_limited", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> RATE LIMITED", i, total_files, upload_name, fsize);
                    rate_limited++;
                    break;
                } else {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "failed", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", i, total_files, upload_name, fsize);
                    failed++;
                }
            } else {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", i, total_files, upload_name, fsize);
                failed++;
            }

