Smethan/projectZero/ESP32C5/main/main.c
            vTaskDelay(pdMS_TO_TICKS(250));
        }

        MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed, %d rate_limited", uploaded, skipped, failed, rate_limited);
        if (auth_failed) {
            return 1;
        }
        return (failed > 0) ? 1 : 0;
    }

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    struct dirent *entry;
    int total_files = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wdgwars_is_upload_candidate(entry->d_name)) {
            total_files++;
        }
    }

    if (total_files == 0) {
        MY_LOG_INFO(TAG, "No Wardrive files (.log/.csv/.gz) found in /sdcard/lab/wardrives/");
        MY_LOG_INFO(TAG, "Done: 0 uploaded, 0 skipped, 0 failed");
        closedir(dir);
        return 0;
    }

    MY_LOG_INFO(TAG, "Uploading %d Wardrive file(s) to wdgwars.pl%s...", total_files,
                force_all ? " (force all)" : "");

    rewinddir(dir);
    int current = 0;

    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (!wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        current++;
        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);

        struct stat st;
        long fsize = 0;
        if (stat(filepath, &st) == 0) {
            fsize = (long)st.st_size;
        }

        wdgwars_wigle_stats_t wigle_stats;
        bool use_sanitized = false;
        uint32_t hash = 0;
        if (!wardrive_collect_file_id(filepath, &fsize, &hash)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", current, total_files, entry->d_name);
            failed++;
            continue;
        }

        if (wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
            if (!force_all && upload_state_is_done("wdgwars", entry->d_name, fsize, hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", current, total_files, entry->d_name, fsize);
                skipped++;
                if (use_sanitized) unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
                continue;
            }

            const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
            if (use_sanitized && stat(upload_path, &st) == 0) {
                /* Keep fsize/hash from the original file for upload_state identity. */
            }

            int result = wdgwars_upload_file_with_retry(upload_path, entry->d_name);
            if (use_sanitized) {
                unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
            }
            if (result == 0) {
                upload_state_append("wdgwars", entry->d_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", current, total_files, entry->d_name, fsize);
                uploaded++;
            } else if (result == 1) {
                upload_state_append("wdgwars", entry->d_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped", current, total_files, entry->d_name, fsize);
                skipped++;
            } else if (result == 2) {
                MY_LOG_INFO(TAG, "WDGWARS AUTH FAILED");
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", current, total_files, entry->d_name, fsize);
                failed++;
                auth_failed = true;
                break;
            } else if (result == WDGWARS_RESULT_RATE_LIMITED) {
                upload_state_append("wdgwars", entry->d_name, fsize, hash, "rate_limited", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> RATE LIMITED", current, total_files, entry->d_name, fsize);
                rate_limited++;
                break;
            } else {
                upload_state_append("wdgwars", entry->d_name, fsize, hash, "failed", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", current, total_files, entry->d_name, fsize);
                failed++;
            }
        } else {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", current, total_files, entry->d_name, fsize);
            failed++;
        }

        vTaskDelay(pdMS_TO_TICKS(400));
    }

    closedir(dir);

    MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed, %d rate_limited", uploaded, skipped, failed, rate_limited);
    if (auth_failed) {
        return 1;
    }
    return (failed > 0) ? 1 : 0;
}

// -------------------------------------------------

static int cmd_start_sae_overflow(int argc, char **argv) {
    //avoid compiler warnings:
    (void)argc; (void)argv;
    oled_display_update_full("> SAE Flood",
        (g_selected_count > 0) ? (const char *)g_scan_results[g_selected_indices[0]].ssid : "  No target",
        "  WPA3 Overflow", "  Flooding...");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if SAE attack is already running
    if (sae_attack_active || sae_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "SAE overflow attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;

    if (g_selected_count == 1) {
        applicationState = SAE_OVERFLOW;
        int idx = g_selected_indices[0];
        const wifi_ap_record_t *ap = &g_scan_results[idx];
        
        // Set LED
        esp_err_t led_err = led_set_color(255, 0, 0);
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to set LED for SAE overflow: %s", esp_err_to_name(led_err));
        }
        
        MY_LOG_INFO(TAG,"WPA3 SAE Overflow Attack");
        MY_LOG_INFO(TAG,"Target: SSID='%s' Ch=%d Auth=%d", (const char*)ap->ssid, ap->primary, ap->authmode);
        MY_LOG_INFO(TAG,"SAE attack started. Use 'stop' to stop.");
        
