Smethan/projectZero/ESP32C5/main/main.c
static int cmd_stop(int argc, char **argv) {
    (void)argc; (void)argv;
    return stop_operations(true);
}

static int stop_operations(bool reset_wifi) {
    if (!sw_stop()) { printf("Serial stop timed out; retry stop.\n"); return 1; }
    oled_display_update_full("> STOPPED", "  All ops halted", "", "  > Idle");
    MY_LOG_INFO(TAG, "Stop command received - stopping all operations...");

    // Reset onlyDeauth so next evil twin starts with full portal
    onlyDeauth = 0;

    // Set global stop flags
    operation_stop_requested = true;
    wardrive_active = false;

    // Stop packet monitor if running
    packet_monitor_stop();

    // Stop nRF24 jammer if running
    nrf24_jammer_stop();

    // Stop 802.15.4 recon if running
    if (zig_recon_is_active() || current_radio_mode == RADIO_MODE_IEEE802154) {
        zig_recon_stop();
        current_radio_mode = RADIO_MODE_NONE;
        MY_LOG_INFO(TAG, "802.15.4 recon stopped.");
    }

    // Stop AP locator if running
    ap_locator_stop();

    // Stop PCAP capture if running
    if (pcap_capture_active) {
        pcap_capture_active = false;

        if (pcap_capture_mode == PCAP_MODE_RADIO) {
            esp_wifi_set_promiscuous(false);
        } else if (pcap_capture_mode == PCAP_MODE_NET) {
            if (pcap_arp_active) {
                pcap_arp_active = false;
                for (int i = 0; i < 60 && pcap_arp_task_handle != NULL; i++) {
                    vTaskDelay(pdMS_TO_TICKS(100));
                }
                if (pcap_arp_task_handle != NULL) {
                    vTaskDelete(pcap_arp_task_handle);
                    pcap_arp_task_handle = NULL;
                    MY_LOG_INFO(TAG, "ARP spoof task force-deleted");
                }
                pcap_arp_host_count = 0;
            }

            esp_netif_t *sta = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
            if (sta) {
                struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(sta);
                if (lwip_nif) {
                    if (pcap_original_input) lwip_nif->input = pcap_original_input;
                    if (pcap_original_linkoutput) lwip_nif->linkoutput = pcap_original_linkoutput;
                }
            }
            pcap_original_input = NULL;
            pcap_original_linkoutput = NULL;
        }

        for (int i = 0; i < 40 && pcap_writer_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        if (pcap_writer_task_handle != NULL) {
            vTaskDelete(pcap_writer_task_handle);
            pcap_writer_task_handle = NULL;
        }

        if (pcap_packet_queue) {
            pcap_queued_frame_t *leftover = NULL;
            while (xQueueReceive(pcap_packet_queue, &leftover, 0) == pdTRUE) {
                free(leftover);
            }
            vQueueDelete(pcap_packet_queue);
            pcap_packet_queue = NULL;
        }

        if (pcap_capture_file) {
            fclose(pcap_capture_file);
            pcap_capture_file = NULL;
            sd_sync();
        }

        MY_LOG_INFO(TAG, "PCAP saved: %s (%lu frames, %lu drops)",
                    pcap_capture_filepath,
                    (unsigned long)pcap_capture_frame_count,
                    (unsigned long)pcap_capture_drop_count);
        pcap_capture_mode = PCAP_MODE_NONE;
    }

    // Stop handshake attack task if running
    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping handshake attack task...");
        handshake_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && handshake_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (handshake_attack_task_handle != NULL) {
            vTaskDelete(handshake_attack_task_handle);
            handshake_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Handshake attack task forcefully stopped.");
        }
        
        // Stop any active handshake capture
        attack_handshake_stop();
        
        // Clean up state
        handshake_target_count = 0;
        handshake_current_index = 0;
        memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
        memset(handshake_captured, 0, sizeof(handshake_captured));
    } else {
        // Stop handshake attack if running (old non-task mode)
        attack_handshake_stop();
    }
    hsm_stop(); /* Also release telemetry after a forced task stop. */

    // Stop channel view monitor if running
    channel_view_stop();
    
    // Stop deauth attack task if running
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping deauth attack task...");
        deauth_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && deauth_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (deauth_attack_task_handle != NULL) {
            vTaskDelete(deauth_attack_task_handle);
            deauth_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Deauth attack task forcefully stopped.");
        }
        
        // Clear target BSSIDs
        target_bssid_count = 0;
        memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    }
    
    // Stop SAE overflow attack task if running
    if (sae_attack_active || sae_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping SAE overflow task...");
        sae_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && sae_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (sae_attack_task_handle != NULL) {
            vTaskDelete(sae_attack_task_handle);
            sae_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "SAE overflow task forcefully stopped.");
        }
    }
    
    // Stop blackout attack task if running
    if (blackout_attack_active || blackout_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping blackout attack task...");
        blackout_attack_active = false;
        
