Smethan/projectZero/ESP32C5/main/main.c
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && blackout_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (blackout_attack_task_handle != NULL) {
            vTaskDelete(blackout_attack_task_handle);
            blackout_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Blackout attack task forcefully stopped.");
        }
        
        // Clear target BSSIDs
        target_bssid_count = 0;
        memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    }
    
    // Stop beacon spam task if running
    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping beacon spam task...");
        beacon_spam_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && beacon_spam_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (beacon_spam_task_handle != NULL) {
            vTaskDelete(beacon_spam_task_handle);
            beacon_spam_task_handle = NULL;
            MY_LOG_INFO(TAG, "Beacon spam task forcefully stopped.");
        }
        
        // Clear beacon SSIDs
        beacon_ssid_count = 0;
        memset(beacon_ssids, 0, sizeof(beacon_ssids));
    }
    
    // Stop any active attacks
    if (applicationState == DEAUTH || applicationState == DEAUTH_EVIL_TWIN || 
        applicationState == EVIL_TWIN_PASS_CHECK || applicationState == SAE_OVERFLOW) {
        MY_LOG_INFO(TAG, "Stopping active attack (state: %d)...", applicationState);
        applicationState = IDLE;
        
        // Disable promiscuous mode if it was enabled for SAE_OVERFLOW
        esp_wifi_set_promiscuous(false);
    } else {
        applicationState = IDLE;
    }
    
    // Stop background scan if in progress
    if (g_scan_in_progress) {
        esp_wifi_scan_stop();
        g_scan_in_progress = false;
        MY_LOG_INFO(TAG, "Background scan stopped.");
    }
    
    // Stop sniffer if active (keep collected data)
    if (sniffer_active) {
        sniffer_active = false;
        sniffer_scan_phase = false;
        esp_wifi_set_promiscuous(false);
        
        // Stop channel hopping task
        if (sniffer_channel_task_handle != NULL) {
            vTaskDelete(sniffer_channel_task_handle);
            sniffer_channel_task_handle = NULL;
            MY_LOG_INFO(TAG, "Stopped sniffer channel hopping task");
        }
        
        // Reset channel state for next session
        sniffer_channel_index = 0;
        sniffer_current_channel = dual_band_channels[0];
        sniffer_last_channel_hop = 0;
        
        // Reset selected networks mode state
        sniffer_selected_mode = false;
        sniffer_selected_channels_count = 0;
        memset(sniffer_selected_channels, 0, sizeof(sniffer_selected_channels));
        
        // Note: sniffer_aps and sniffer_ap_count are preserved for show_sniffer_results
        MY_LOG_INFO(TAG, "Sniffer stopped. Data preserved - use 'show_sniffer_results' to view.");
    }
    
    // Stop sniffer_dog if active
    if (sniffer_dog_active || sniffer_dog_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping Sniffer Dog task...");
        sniffer_dog_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && sniffer_dog_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (sniffer_dog_task_handle != NULL) {
            vTaskDelete(sniffer_dog_task_handle);
            sniffer_dog_task_handle = NULL;
            MY_LOG_INFO(TAG, "Sniffer Dog task forcefully stopped.");
        }
        
        // Disable promiscuous mode
        esp_wifi_set_promiscuous(false);
        
        // Reset channel state
        sniffer_dog_channel_index = 0;
        sniffer_dog_current_channel = dual_band_channels[0];
        sniffer_dog_last_channel_hop = 0;
        
        MY_LOG_INFO(TAG, "Sniffer Dog stopped.");
    }
    
    // Stop deauth_detector if active
    if (deauth_detector_active || deauth_detector_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping Deauth Detector task...");
        deauth_detector_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && deauth_detector_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (deauth_detector_task_handle != NULL) {
            vTaskDelete(deauth_detector_task_handle);
            deauth_detector_task_handle = NULL;
            MY_LOG_INFO(TAG, "Deauth Detector task forcefully stopped.");
        }
        
        // Disable promiscuous mode
        esp_wifi_set_promiscuous(false);
        
        // Reset channel state
        deauth_detector_channel_index = 0;
        deauth_detector_current_channel = dual_band_channels[0];
        deauth_detector_last_channel_hop = 0;
        
        // Reset selected mode state
        deauth_detector_selected_mode = false;
        deauth_detector_selected_channels_count = 0;
        memset(deauth_detector_selected_channels, 0, sizeof(deauth_detector_selected_channels));
        
        // Return LED to idle
        esp_err_t led_err = led_set_idle();
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to restore idle LED after Deauth Detector stop: %s", esp_err_to_name(led_err));
        }
        
        MY_LOG_INFO(TAG, "Deauth Detector stopped.");
    }
    
    // Stop GPS raw task if running
    if (gps_raw_active || gps_raw_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping GPS raw task...");
        gps_raw_active = false;

        // Wait a bit for task to finish
        for (int i = 0; i < 20 && gps_raw_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }

