Smethan/projectZero/ESP32C5/main/main.c
    // Disconnect from AP if connected via wifi_connect and reset WiFi
    if (current_radio_mode == RADIO_MODE_WIFI && wifi_initialized) {
        wifi_ap_record_t ap_info;
        if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
            MY_LOG_INFO(TAG, "Disconnecting from AP '%s'...", ap_info.ssid);
            esp_wifi_disconnect();
        }
        
        esp_wifi_set_promiscuous(false);
        esp_wifi_set_promiscuous_rx_cb(NULL);
        if (reset_wifi) {
            // Reset WiFi to clean state for an explicit stop command.
            MY_LOG_INFO(TAG, "Resetting WiFi...");
            esp_wifi_stop();
            esp_wifi_deinit();

            esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
            if (ap_netif) esp_netif_destroy(ap_netif);
            ap_netif_handle = NULL;
            wifi_initialized = false;
            current_radio_mode = RADIO_MODE_NONE;

            if (!ensure_wifi_mode()) {
                MY_LOG_INFO(TAG, "Warning: Failed to reinitialize WiFi after stop");
                return 1;
            }
        }
    }
    
    // Restore LED to idle (ignore errors if LED is in invalid state)
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after stop (state: %s), ignoring...", esp_err_to_name(led_err));
    }
    
    MY_LOG_INFO(TAG, "All operations stopped.");
    return 0;
}

static bool zig_recon_radio_busy(char *reason, size_t reason_len)
{
    const char *why = NULL;
    if (g_scan_in_progress) why = "wifi_scan";
    else if (sniffer_active || sniffer_channel_task_handle != NULL) why = "sniffer";
    else if (packet_monitor_active || packet_monitor_task_handle != NULL) why = "packet_monitor";
    else if (ap_locator_active || ap_locator_task_handle != NULL) why = "ap_locator";
    else if (channel_view_active || channel_view_task_handle != NULL) why = "channel_view";
    else if (pcap_capture_active || pcap_writer_task_handle != NULL) why = "pcap";
    else if (deauth_attack_active || deauth_attack_task_handle != NULL) why = "deauth";
    else if (blackout_attack_active || blackout_attack_task_handle != NULL) why = "blackout";
    else if (sae_attack_active || sae_attack_task_handle != NULL) why = "sae_overflow";
    else if (sniffer_dog_active || sniffer_dog_task_handle != NULL) why = "sniffer_dog";
    else if (deauth_detector_active || deauth_detector_task_handle != NULL) why = "deauth_detector";
    else if (handshake_attack_active || handshake_attack_task_handle != NULL) why = "handshake";
    else if (beacon_spam_active || beacon_spam_task_handle != NULL) why = "beacon_spam";
    else if (portal_active || darksword_active) why = "portal";
    else if (wardrive_active || wardrive_task_handle != NULL) why = "wardrive";
    else if (wardrive_promisc_active || wardrive_promisc_task_handle != NULL) why = "wardrive_promisc";
    else if (antisurv_active || antisurv_task_handle != NULL) why = "antisurveillance";
    else if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) why = "ble_scan";
    else if (nrf24_jammer_is_running()) why = "nrf24";

    if (why && reason && reason_len) {
        snprintf(reason, reason_len, "%s", why);
    }
    return why != NULL;
}

static bool zig_recon_parse_u16(const char *text, uint16_t *out)
{
    if (!text || !out || *text == '\0') {
        return false;
    }
    char *end = NULL;
    unsigned long value = strtoul(text, &end, 0);
    if (end == text || *end != '\0' || value > 0xffffUL) {
        return false;
    }
    *out = (uint16_t)value;
    return true;
}

static bool zig_recon_parse_channels(const char *arg, uint32_t *out_mask)
{
    if (!arg || !out_mask) {
        return false;
    }
    if (strcasecmp(arg, "all") == 0) {
        *out_mask = ZIG_RECON_ALL_CHANNELS_MASK;
        return true;
    }

    char buf[96];
    strlcpy(buf, arg, sizeof(buf));
    uint32_t mask = 0;
    char *saveptr = NULL;
    for (char *tok = strtok_r(buf, ",:", &saveptr); tok; tok = strtok_r(NULL, ",:", &saveptr)) {
        char *end = NULL;
        long ch = strtol(tok, &end, 10);
        if (end == tok || *end != '\0' || ch < ZIG_RECON_MIN_CHANNEL || ch > ZIG_RECON_MAX_CHANNEL) {
            return false;
        }
        mask |= (1UL << ch);
    }
    if (mask == 0) {
        return false;
    }
    *out_mask = mask;
    return true;
}

static void zig_recon_format_channels(uint32_t mask, char *out, size_t out_len)
{
    if (!out || out_len == 0) {
        return;
    }
    out[0] = '\0';
    bool first = true;
    for (uint8_t ch = ZIG_RECON_MIN_CHANNEL; ch <= ZIG_RECON_MAX_CHANNEL; ch++) {
        if (!(mask & (1UL << ch))) {
            continue;
        }
        char part[8];
        snprintf(part, sizeof(part), "%s%u", first ? "" : ",", ch);
        strlcat(out, part, out_len);
        first = false;
    }
    if (out[0] == '\0') {
        strlcpy(out, "none", out_len);
    }
}

static const char *zig_recon_pan_kind(uint16_t pan_id)
{
    return pan_id == 0xffff ? "broadcast" : "network";
}

static void zig_recon_format_ext(uint64_t value, char *out, size_t out_len)
{
    if (!out || out_len == 0) {
        return;
    }
    snprintf(out, out_len, "%08lx%08lx",
             (unsigned long)(value >> 32),
             (unsigned long)(value & 0xffffffffUL));
}

static zig_recon_snapshot_t *zig_recon_alloc_snapshot(void)
{
    return heap_caps_calloc(1, sizeof(zig_recon_snapshot_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
}

static int cmd_start_zig_recon(int argc, char **argv)
{
    if (argc > 3) {
        printf("Usage: start_zig_recon [all|11,15,20] [dwell_ms]\n");
        return 1;
    }
    if (zig_recon_is_active()) {
        printf("802.15.4 recon already running. Use 'stop' first.\n");
        return 1;
    }

    char busy[32] = {0};
    if (zig_recon_radio_busy(busy, sizeof(busy))) {
        printf("FAILED: radio busy (%s). Use 'stop' first.\n", busy);
        return 1;
    }

    zig_recon_config_t cfg = {
        .channel_mask = ZIG_RECON_ALL_CHANNELS_MASK,
        .dwell_ms = 250,
    };
    if (argc >= 2 && !zig_recon_parse_channels(argv[1], &cfg.channel_mask)) {
        printf("Usage: start_zig_recon [all|11,15,20] [dwell_ms]\n");
        return 1;
    }
    if (argc >= 3) {
        int dwell = atoi(argv[2]);
        if (dwell < 50 || dwell > 5000) {
            printf("dwell_ms must be 50-5000\n");
            return 1;
        }
        cfg.dwell_ms = (uint16_t)dwell;
    }

