Smethan/projectZero/ESP32C5/main/main.c
    return 0;
}

static int cmd_ota_list(int argc, char **argv) {
    (void)argc;
    (void)argv;

    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "OTA: WiFi not ready");
        return 1;
    }
    if (!ota_is_connected()) {
        MY_LOG_INFO(TAG, "OTA: not connected or no IP. Use 'wifi_connect' first.");
        return 1;
    }

    char api_url[256];
    int res = snprintf(api_url, sizeof(api_url),
                       "https://api.github.com/repos/%s/%s/releases?per_page=5",
                       OTA_GITHUB_OWNER, OTA_GITHUB_REPO);
    if (res < 0 || res >= (int)sizeof(api_url)) {
        return 1;
    }

    char *body = NULL;
    size_t body_len = 0;
    esp_err_t err = ota_http_get(api_url, &body, &body_len);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: list failed: %s", esp_err_to_name(err));
        return 1;
    }
    (void)body_len;

    cJSON *root = cJSON_Parse(body);
    if (!root || !cJSON_IsArray(root)) {
        cJSON_Delete(root);
        free(body);
        MY_LOG_INFO(TAG, "OTA: list parse failed");
        return 1;
    }

    int idx = 0;
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, root) {
        cJSON *tag = cJSON_GetObjectItem(item, "tag_name");
        cJSON *name = cJSON_GetObjectItem(item, "name");
        cJSON *prerelease = cJSON_GetObjectItem(item, "prerelease");
        cJSON *published = cJSON_GetObjectItem(item, "published_at");
        if (!cJSON_IsString(tag)) {
            continue;
        }
        const char *channel = (cJSON_IsBool(prerelease) && cJSON_IsTrue(prerelease)) ? "dev" : "main";
        const char *title = (cJSON_IsString(name) && name->valuestring[0] != '\0') ? name->valuestring : "";
        const char *date = (cJSON_IsString(published) && strlen(published->valuestring) >= 10)
                               ? published->valuestring
                               : "";
        char date_buf[11] = {0};
        if (date[0] != '\0') {
            memcpy(date_buf, date, 10);
            date_buf[10] = '\0';
        }
        MY_LOG_INFO(TAG, "OTA[%d]: %s (%s) %s %s",
                    idx,
                    tag->valuestring,
                    channel,
                    date_buf,
                    title);
        idx++;
    }

    cJSON_Delete(root);
    free(body);
    return 0;
}

static int cmd_ota_channel(int argc, char **argv) {
    if (argc == 1) {
        MY_LOG_INFO(TAG, "OTA channel: %s", ota_channel);
        return 0;
    }
    if (argc != 2) {
        MY_LOG_INFO(TAG, "Usage: ota_channel <main|dev>");
        return 1;
    }

    if (strcasecmp(argv[1], "main") != 0 && strcasecmp(argv[1], "dev") != 0) {
        MY_LOG_INFO(TAG, "Usage: ota_channel <main|dev>");
        return 1;
    }

    snprintf(ota_channel, sizeof(ota_channel), "%s", argv[1]);
    if (!ota_save_channel_to_nvs(ota_channel)) {
        MY_LOG_INFO(TAG, "OTA: failed to save channel");
        return 1;
    }

    MY_LOG_INFO(TAG, "OTA channel set to: %s", ota_channel);
    return 0;
}

static int cmd_ota_info(int argc, char **argv) {
    (void)argc;
    (void)argv;

    const esp_partition_t *boot = esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    if (running) {
        esp_ota_get_state_partition(running, &state);
    }

    MY_LOG_INFO(TAG, "OTA boot: %s",
                boot ? boot->label : "n/a");
    MY_LOG_INFO(TAG, "OTA running: %s state=%d",
                running ? running->label : "n/a",
                (int)state);
    MY_LOG_INFO(TAG, "OTA next: %s",
                next ? next->label : "n/a");

    const esp_partition_t *ota0 = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                                           ESP_PARTITION_SUBTYPE_APP_OTA_0,
                                                           NULL);
    const esp_partition_t *ota1 = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                                           ESP_PARTITION_SUBTYPE_APP_OTA_1,
                                                           NULL);
    const esp_partition_t *parts[2] = { ota0, ota1 };
    const char *labels[2] = { "ota_0", "ota_1" };

    for (int i = 0; i < 2; i++) {
        const esp_partition_t *part = parts[i];
        if (!part) {
            MY_LOG_INFO(TAG, "APP[%d]: %s missing", i, labels[i]);
            continue;
        }
        esp_app_desc_t desc = {0};
        esp_ota_img_states_t part_state = ESP_OTA_IMG_UNDEFINED;
        esp_ota_get_state_partition(part, &part_state);
        esp_err_t desc_err = esp_ota_get_partition_description(part, &desc);
        if (desc_err == ESP_OK) {
            MY_LOG_INFO(TAG,
                        "APP[%d]: %s state=%d ver=%s",
                        i,
                        part->label,
                        (int)part_state,
                        desc.version);
        } else {
            MY_LOG_INFO(TAG, "APP[%d]: %s state=%d",
                        i,
                        part->label,
                        (int)part_state);
        }
    }

    return 0;
}

static int cmd_ota_boot(int argc, char **argv) {
    if (argc != 2) {
        MY_LOG_INFO(TAG, "Usage: ota_boot <ota_0|ota_1>");
        return 1;
    }

    const esp_partition_t *target = NULL;
    if (strcasecmp(argv[1], "ota_0") == 0) {
        target = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                          ESP_PARTITION_SUBTYPE_APP_OTA_0,
                                          NULL);
    } else if (strcasecmp(argv[1], "ota_1") == 0) {
        target = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                          ESP_PARTITION_SUBTYPE_APP_OTA_1,
                                          NULL);
    } else {
        MY_LOG_INFO(TAG, "Usage: ota_boot <ota_0|ota_1>");
        return 1;
    }

    if (!target) {
        MY_LOG_INFO(TAG, "OTA: target partition not found");
        return 1;
    }

    esp_err_t err = esp_ota_set_boot_partition(target);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: set boot partition failed: %s", esp_err_to_name(err));
        return 1;
    }

