Smethan/projectZero/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "OTA: boot set to %s, restarting", target->label);
    safe_restart();  // unmount SD card before restart
    return 0;
}

// --- Shared host discovery (ARP batches + ICMP ping sweep) ---

#define DISCOVER_MAX_HOSTS 254
#define DISCOVER_ARP_POLL_INTERVAL_MS 200
#define DISCOVER_ARP_POLL_ROUNDS 20
#define DISCOVER_ICMP_WAIT_MS 2000
#define DISCOVER_ICMP_ID 0x4A4E

typedef struct {
    uint32_t ip_addr;
    uint8_t  mac[6];
    bool     mac_known;
} discovered_host_t;

static uint16_t icmp_checksum(const void *data, size_t len)
{
    const uint8_t *p = (const uint8_t *)data;
    uint32_t sum = 0;
    for (size_t i = 0; i < len - 1; i += 2)
        sum += (uint16_t)(p[i] << 8 | p[i + 1]);
    if (len & 1)
        sum += (uint16_t)(p[len - 1] << 8);
    while (sum >> 16)
        sum = (sum & 0xFFFF) + (sum >> 16);
    return htons((uint16_t)~sum);
}

static bool discover_host_already_found(const discovered_host_t *hosts, int count, uint32_t ip_addr)
{
    for (int i = 0; i < count; i++) {
        if (hosts[i].ip_addr == ip_addr)
            return true;
    }
    return false;
}

static int discover_lan_hosts(discovered_host_t *hosts, int max_hosts)
{
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return -1;
    }

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "STA interface not found");
        return -1;
    }

    esp_netif_ip_info_t ip_info;
    if (esp_netif_get_ip_info(sta_netif, &ip_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to get IP info. DHCP may not have completed.");
        return -1;
    }
    if (ip_info.ip.addr == 0) {
        MY_LOG_INFO(TAG, "No IP address assigned yet. Wait for DHCP.");
        return -1;
    }

    uint32_t ip_h  = ntohl(ip_info.ip.addr);
    uint32_t mask_h = ntohl(ip_info.netmask.addr);
    uint32_t network   = ip_h & mask_h;
    uint32_t broadcast = network | ~mask_h;
    uint32_t subnet_size = broadcast - network - 1;
    if (subnet_size > (uint32_t)max_hosts)
        subnet_size = (uint32_t)max_hosts;

    MY_LOG_INFO(TAG, "Our IP: " IPSTR ", Netmask: " IPSTR,
                IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask));

    struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
    if (!lwip_netif) {
        MY_LOG_INFO(TAG, "Failed to get LwIP netif");
        return -1;
    }

    int host_count = 0;
    int arp_found = 0;

    // --- Phase 1: ARP flood + repeated table polling ---
    MY_LOG_INFO(TAG, "Phase 1: ARP scan (%lu hosts)...", (unsigned long)subnet_size);

    int sent = 0;
    for (uint32_t target = network + 1; target < broadcast && sent < max_hosts; target++, sent++) {
        ip4_addr_t tip;
        tip.addr = htonl(target);
        etharp_request(lwip_netif, &tip);
        if (sent % 10 == 0)
            vTaskDelay(pdMS_TO_TICKS(10));
    }

    MY_LOG_INFO(TAG, "Sent %d ARP requests, polling table for %d seconds...",
                sent, (DISCOVER_ARP_POLL_INTERVAL_MS * DISCOVER_ARP_POLL_ROUNDS) / 1000);

    for (int round = 0; round < DISCOVER_ARP_POLL_ROUNDS; round++) {
        vTaskDelay(pdMS_TO_TICKS(DISCOVER_ARP_POLL_INTERVAL_MS));
        for (int i = 0; i < ARP_TABLE_SIZE && host_count < max_hosts; i++) {
            ip4_addr_t *ip_ret;
            struct netif *netif_ret;
            struct eth_addr *eth_ret;
            if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                if (!discover_host_already_found(hosts, host_count, ip_ret->addr)) {
                    hosts[host_count].ip_addr = ip_ret->addr;
                    memcpy(hosts[host_count].mac, eth_ret->addr, 6);
                    hosts[host_count].mac_known = true;
                    host_count++;
                    arp_found++;
                }
            }
        }
    }

    MY_LOG_INFO(TAG, "ARP: found %d hosts", arp_found);

    // --- Phase 2: ICMP ping sweep for unfound IPs ---
    int ping_sock = socket(AF_INET, SOCK_RAW, IPPROTO_ICMP);
    if (ping_sock < 0) {
        MY_LOG_INFO(TAG, "ICMP socket failed, skipping ping sweep");
        return host_count;
    }

    struct timeval tv = { .tv_sec = 0, .tv_usec = 100000 };
    setsockopt(ping_sock, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));

    typedef struct __attribute__((packed)) {
        uint8_t  type;
        uint8_t  code;
        uint16_t checksum;
        uint16_t id;
        uint16_t seqno;
    } icmp_echo_t;

    int pings_sent = 0;
    uint16_t seq = 0;
    for (uint32_t target = network + 1; target < broadcast && (int)seq < max_hosts; target++) {
        uint32_t target_net = htonl(target);
        if (discover_host_already_found(hosts, host_count, target_net))
            continue;

        icmp_echo_t echo = {0};
        echo.type = 8;
        echo.code = 0;
        echo.id   = htons(DISCOVER_ICMP_ID);
        echo.seqno = htons(seq++);
        echo.checksum = 0;
        echo.checksum = icmp_checksum(&echo, sizeof(echo));

        struct sockaddr_in dest = {
            .sin_family = AF_INET,
            .sin_addr.s_addr = target_net,
        };
        sendto(ping_sock, &echo, sizeof(echo), 0,
               (struct sockaddr *)&dest, sizeof(dest));
        pings_sent++;

        if (pings_sent % 10 == 0)
            vTaskDelay(pdMS_TO_TICKS(5));
    }

    MY_LOG_INFO(TAG, "Phase 2: sent %d ICMP pings, waiting for replies...", pings_sent);
    vTaskDelay(pdMS_TO_TICKS(DISCOVER_ICMP_WAIT_MS));

    int icmp_found = 0;
    char recv_buf[64];
    struct sockaddr_in from;
    socklen_t fromlen;
    for (;;) {
        fromlen = sizeof(from);
        int n = recvfrom(ping_sock, recv_buf, sizeof(recv_buf), 0,
                         (struct sockaddr *)&from, &fromlen);
        if (n <= 0) break;

        if (n < 20 + (int)sizeof(icmp_echo_t)) continue;
        int ihl = (recv_buf[0] & 0x0F) * 4;
        if (n < ihl + (int)sizeof(icmp_echo_t)) continue;
        icmp_echo_t *reply = (icmp_echo_t *)(recv_buf + ihl);
        if (reply->type != 0 || reply->code != 0) continue;
        if (ntohs(reply->id) != DISCOVER_ICMP_ID) continue;

