Smethan/projectZero/ESP32C5/main/main.c
        uint32_t src_ip = from.sin_addr.s_addr;
        if (host_count < max_hosts &&
            !discover_host_already_found(hosts, host_count, src_ip)) {
            hosts[host_count].ip_addr = src_ip;
            memset(hosts[host_count].mac, 0, 6);
            hosts[host_count].mac_known = false;
            host_count++;
            icmp_found++;
        }
    }
    close(ping_sock);

    MY_LOG_INFO(TAG, "ICMP: found %d additional hosts", icmp_found);
    MY_LOG_INFO(TAG, "Total: %d hosts discovered (%d ARP + %d ICMP)",
                host_count, arp_found, icmp_found);

    return host_count;
}

// --- Host listing commands ---

static int cmd_list_hosts(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Host Scan", "  Scanning LAN", "", "  Working...");

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
    if (host_count < 0) {
        free(hosts);
        return 1;
    }

    MY_LOG_INFO(TAG, "=== Discovered Hosts ===");
    int arp_cnt = 0, icmp_cnt = 0;
    for (int i = 0; i < host_count; i++) {
        ip4_addr_t tmp;
        tmp.addr = hosts[i].ip_addr;
        uint8_t *m = hosts[i].mac;
        if (hosts[i].mac_known) {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  %02X:%02X:%02X:%02X:%02X:%02X  [ARP]",
                IP2STR(&tmp), m[0], m[1], m[2], m[3], m[4], m[5]);
            arp_cnt++;
        } else {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  (MAC unknown)  [ICMP]", IP2STR(&tmp));
            icmp_cnt++;
        }
    }
    MY_LOG_INFO(TAG, "========================");
    MY_LOG_INFO(TAG, "Found %d hosts (%d via ARP, %d via ICMP)", host_count, arp_cnt, icmp_cnt);

    free(hosts);
    return 0;
}

static int cmd_list_hosts_vendor(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Host Scan", "  Scanning LAN", "  + vendor lookup", "  Working...");

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
    if (host_count < 0) {
        free(hosts);
        return 1;
    }

    MY_LOG_INFO(TAG, "=== Discovered Hosts ===");
    int arp_cnt = 0, icmp_cnt = 0;
    for (int i = 0; i < host_count; i++) {
        ip4_addr_t tmp;
        tmp.addr = hosts[i].ip_addr;
        uint8_t *m = hosts[i].mac;
        if (hosts[i].mac_known) {
            const char *vendor = lookup_vendor_name(m);
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  %02X:%02X:%02X:%02X:%02X:%02X  [%s]  [ARP]",
                IP2STR(&tmp), m[0], m[1], m[2], m[3], m[4], m[5],
                vendor ? vendor : "Unknown");
            arp_cnt++;
        } else {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  (MAC unknown)  [ICMP]", IP2STR(&tmp));
            icmp_cnt++;
        }
    }
    MY_LOG_INFO(TAG, "========================");
    MY_LOG_INFO(TAG, "Found %d hosts (%d via ARP, %d via ICMP)", host_count, arp_cnt, icmp_cnt);

    free(hosts);
    return 0;
}

// --- Port scanner (nmap-like) ---

typedef struct {
    uint16_t port;
    const char *name;
} nmap_port_entry_t;

static const nmap_port_entry_t nmap_ports[] = {
    // --- quick (first 20) ---
    {   21, "FTP"        },
    {   22, "SSH"        },
    {   23, "Telnet"     },
    {   25, "SMTP"       },
    {   53, "DNS"        },
    {   80, "HTTP"       },
    {  110, "POP3"       },
    {  135, "MSRPC"      },
    {  139, "NetBIOS"    },
    {  143, "IMAP"       },
    {  443, "HTTPS"      },
    {  445, "SMB"        },
    {  993, "IMAPS"      },
    { 1433, "MSSQL"      },
    { 3306, "MySQL"      },
    { 3389, "RDP"        },
    { 5432, "PostgreSQL" },
    { 5900, "VNC"        },
    { 8080, "HTTP-alt"   },
    { 8443, "HTTPS-alt"  },
    // --- medium (next 30) ---
    {  111, "RPCbind"    },
    {  161, "SNMP"       },
    {  162, "SNMP-trap"  },
    {  389, "LDAP"       },
    {  465, "SMTPS"      },
    {  514, "Syslog"     },
    {  515, "LPD"        },
    {  554, "RTSP"       },
    {  587, "Submission" },
    {  636, "LDAPS"      },
    {  873, "Rsync"      },
    {  995, "POP3S"      },
    { 1080, "SOCKS"      },
    { 1443, "IES-LM"     },
    { 1521, "Oracle"     },
    { 1883, "MQTT"       },
    { 2049, "NFS"        },
    { 2181, "ZooKeeper"  },
    { 2375, "Docker"     },
    { 3000, "Grafana"    },
    { 3128, "Squid"      },
    { 4443, "Pharos"     },
    { 5000, "UPnP"       },
    { 5060, "SIP"        },
    { 5222, "XMPP"       },
    { 5601, "Kibana"     },
    { 6379, "Redis"      },
    { 8000, "HTTP-alt2"  },
    { 8888, "HTTP-alt3"  },
    { 9090, "Prometheus" },
    // --- heavy (next 50) ---
    {   69, "TFTP"       },
    {  179, "BGP"        },
    {  502, "Modbus"     },
    {  548, "AFP"        },
    {  623, "IPMI"       },
    {  631, "IPP"        },
    {  902, "VMware"     },
    { 1194, "OpenVPN"    },
    { 1234, "VLC"        },
    { 1723, "PPTP"       },
    { 1900, "SSDP"       },
    { 2082, "cPanel"     },
    { 2083, "cPanel-SSL" },
    { 2222, "SSH-alt"    },
    { 2484, "Oracle-SSL" },
    { 3268, "LDAP-GC"    },
    { 3269, "LDAPS-GC"   },
    { 3690, "SVN"        },
    { 4000, "ICQ"        },
    { 4444, "Metasploit" },
    { 4567, "Sinatra"    },
    { 4848, "GlassFish"  },
    { 5353, "mDNS"       },
    { 5433, "PostgreAlt" },
    { 5672, "AMQP"       },
    { 5984, "CouchDB"    },
    { 6000, "X11"        },
    { 6443, "K8s-API"    },
    { 6660, "IRC"        },
    { 6667, "IRC"        },
    { 7001, "WebLogic"   },
    { 7077, "Spark"      },
    { 7474, "Neo4j"      },
    { 8008, "HTTP-alt4"  },
    { 8081, "HTTP-alt5"  },
    { 8181, "HTTP-alt6"  },
    { 8444, "HTTP-alt7"  },
    { 8834, "Nessus"     },
    { 8883, "MQTT-SSL"   },
    { 9000, "SonarQube"  },
    { 9092, "Kafka"      },
    { 9100, "JetDirect"  },
    { 9200, "Elastic"    },
    { 9443, "WSO2"       },
    {10000, "Webmin"     },
    {11211, "Memcached"  },
    {15672, "RabbitMQ"   },
    {25565, "Minecraft"  },
    {27017, "MongoDB"    },
    {28017, "MongoHTTP"  },
    {50000, "SAP"        },
};
#define NMAP_PORTS_QUICK   20
#define NMAP_PORTS_MEDIUM  50
#define NMAP_PORTS_HEAVY  100
#define NMAP_CONNECT_TIMEOUT_MS 500

static bool nmap_check_port(uint32_t ip_net_order, uint16_t port)
{
    int sock = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (sock < 0) return false;

    int flags = fcntl(sock, F_GETFL, 0);
    fcntl(sock, F_SETFL, flags | O_NONBLOCK);

