Smethan/projectZero/ESP32C5/main/main.c
    struct sockaddr_in addr = {
        .sin_family = AF_INET,
        .sin_port   = htons(port),
        .sin_addr.s_addr = ip_net_order,
    };

    int ret = connect(sock, (struct sockaddr *)&addr, sizeof(addr));
    if (ret == 0) {
        close(sock);
        return true;
    }
    if (errno != EINPROGRESS) {
        close(sock);
        return false;
    }

    fd_set wset;
    FD_ZERO(&wset);
    FD_SET(sock, &wset);
    struct timeval tv = {
        .tv_sec  = NMAP_CONNECT_TIMEOUT_MS / 1000,
        .tv_usec = (NMAP_CONNECT_TIMEOUT_MS % 1000) * 1000,
    };

    bool open = false;
    if (select(sock + 1, NULL, &wset, NULL, &tv) > 0) {
        int so_err = 0;
        socklen_t len = sizeof(so_err);
        getsockopt(sock, SOL_SOCKET, SO_ERROR, &so_err, &len);
        open = (so_err == 0);
    }

    close(sock);
    return open;
}

static int cmd_start_nmap(int argc, char **argv)
{
    int port_count = NMAP_PORTS_QUICK;
    const char *level_name = "quick";
    uint32_t single_ip = 0;
    bool single_host_mode = false;

    for (int i = 1; i < argc; i++) {
        if (strcasecmp(argv[i], "quick") == 0) {
            port_count = NMAP_PORTS_QUICK;
            level_name = "quick";
        } else if (strcasecmp(argv[i], "medium") == 0) {
            port_count = NMAP_PORTS_MEDIUM;
            level_name = "medium";
        } else if (strcasecmp(argv[i], "heavy") == 0) {
            port_count = NMAP_PORTS_HEAVY;
            level_name = "heavy";
        } else {
            struct in_addr parsed;
            if (inet_aton(argv[i], &parsed)) {
                single_ip = parsed.s_addr;
                single_host_mode = true;
            } else {
                MY_LOG_INFO(TAG, "Usage: start_nmap [quick|medium|heavy] [IP]");
                return 1;
            }
        }
    }

    oled_display_update_full("> NMAP Scan",
        single_host_mode ? "  Single host" : "  Discovering hosts",
        "", "  Working...");
    log_memory_info("start_nmap");

    MY_LOG_INFO(TAG, "Scan level: %s (%d ports)", level_name, port_count);

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = 0;

    if (single_host_mode) {
        hosts[0].ip_addr = single_ip;
        memset(hosts[0].mac, 0, 6);
        hosts[0].mac_known = false;
        host_count = 1;
        MY_LOG_INFO(TAG, "Single-host mode, skipping host discovery.");
    } else {
        host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
        if (host_count < 0) {
            free(hosts);
            return 1;
        }
    }

    MY_LOG_INFO(TAG, "Scanning %d host(s), %d ports each (%s)...",
                host_count, port_count, level_name);

    int total_open = 0;

    MY_LOG_INFO(TAG, "=== NMAP Scan Results ===");
    for (int h = 0; h < host_count; h++) {
        uint32_t host_ip = hosts[h].ip_addr;
        uint8_t *m = hosts[h].mac;

        char ip_str[16];
        ip4_addr_t tmp;
        tmp.addr = host_ip;
        snprintf(ip_str, sizeof(ip_str), IPSTR, IP2STR(&tmp));

        char oled_line[40];
        snprintf(oled_line, sizeof(oled_line), "  %d/%d %s", h + 1, host_count, ip_str);
        oled_display_update_full("> NMAP Scan", oled_line, "  Scanning ports...", "");

        if (hosts[h].mac_known) {
            MY_LOG_INFO(TAG, "Host: %s  (%02X:%02X:%02X:%02X:%02X:%02X)",
                        ip_str, m[0], m[1], m[2], m[3], m[4], m[5]);
        } else {
            MY_LOG_INFO(TAG, "Host: %s  (MAC unknown)", ip_str);
        }

        int open_on_host = 0;
        for (int p = 0; p < port_count; p++) {
            if (operation_stop_requested) break;
            if (p % 10 == 0) {
                int end_p = p + 9;
                if (end_p >= port_count) end_p = port_count - 1;
                MY_LOG_INFO(TAG, "  Scanning %s ports %d-%d [%d/%d] ...",
                            ip_str, nmap_ports[p].port, nmap_ports[end_p].port, p + 1, port_count);
                char oled_prog[40];
                snprintf(oled_prog, sizeof(oled_prog), "  Port %d/%d (%d-%d)",
                         p + 1, port_count, nmap_ports[p].port, nmap_ports[end_p].port);
                oled_display_update_full("> NMAP Scan", oled_line, oled_prog, "");
            }
            if (nmap_check_port(host_ip, nmap_ports[p].port)) {
                MY_LOG_INFO(TAG, "  %5d/tcp  open  %s",
                            nmap_ports[p].port, nmap_ports[p].name);
                open_on_host++;
                total_open++;
            }
            vTaskDelay(pdMS_TO_TICKS(10));
        }
        if (operation_stop_requested) {
            MY_LOG_INFO(TAG, "  (scan stopped by user)");
            break;
        }
        if (open_on_host == 0) {
            MY_LOG_INFO(TAG, "  (no open ports)");
        }
    }
    MY_LOG_INFO(TAG, "=========================");
    MY_LOG_INFO(TAG, "Scanned %d hosts, found %d open ports", host_count, total_open);

    free(hosts);

    oled_display_update_full("> NMAP Done",
        host_count > 0 ? "  Scan complete" : "  No hosts found",
        "", "");

    return 0;
}

// Helper to parse MAC address from string "AA:BB:CC:DD:EE:FF"
static bool parse_mac_address(const char *str, uint8_t *mac) {
    return sscanf(str, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                  &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) == 6;
}

// ARP packet structure (Ethernet + ARP)
#define ARP_PACKET_SIZE 42  // 14 (Eth header) + 28 (ARP header)
#define ETH_TYPE_ARP 0x0806
#define ARP_HWTYPE_ETH 1
#define ARP_PROTO_IP 0x0800
#define ARP_OP_REPLY 2

// Helper to build and send ARP reply packet
static void send_arp_reply(struct netif *lwip_netif, 
                           const uint8_t *dst_mac,      // Ethernet destination
                           const uint8_t *src_mac,      // Ethernet source (fake)
                           const uint8_t *sender_mac,   // ARP sender MAC (fake)
                           uint32_t sender_ip,          // ARP sender IP (spoofed)
                           const uint8_t *target_mac,   // ARP target MAC
                           uint32_t target_ip) {        // ARP target IP
    
    uint8_t arp_packet[ARP_PACKET_SIZE];
    
