Smethan/projectZero/ESP32C5/main/main.c
    if (!gateway_found) {
        // Gateway not in ARP table - send ARP request to get it
        MY_LOG_INFO(TAG, "Gateway MAC not in ARP table, sending ARP request...");
        struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
        if (lwip_netif) {
            ip4_addr_t gw_ip = { .addr = ip_info.gw.addr };
            etharp_request(lwip_netif, &gw_ip);
            vTaskDelay(pdMS_TO_TICKS(1000)); // Wait for response
            
            // Try again
            for (int i = 0; i < ARP_TABLE_SIZE; i++) {
                ip4_addr_t *ip_ret;
                struct netif *netif_ret;
                struct eth_addr *eth_ret;
                if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                    if (ip_ret->addr == ip_info.gw.addr) {
                        memcpy(arp_ban_gateway_mac, eth_ret->addr, 6);
                        gateway_found = true;
                        break;
                    }
                }
            }
        }
        
        if (!gateway_found) {
            MY_LOG_INFO(TAG, "Could not find gateway MAC. Make sure you're connected to the network.");
            return 1;
        }
    }
    
    MY_LOG_INFO(TAG, "Starting ARP ban attack (bidirectional):");
    MY_LOG_INFO(TAG, "  Target MAC: %02X:%02X:%02X:%02X:%02X:%02X",
               arp_ban_target_mac[0], arp_ban_target_mac[1], arp_ban_target_mac[2],
               arp_ban_target_mac[3], arp_ban_target_mac[4], arp_ban_target_mac[5]);
    MY_LOG_INFO(TAG, "  Target IP: %d.%d.%d.%d",
               ip4_addr1(&arp_ban_target_ip), ip4_addr2(&arp_ban_target_ip),
               ip4_addr3(&arp_ban_target_ip), ip4_addr4(&arp_ban_target_ip));
    MY_LOG_INFO(TAG, "  Gateway MAC: %02X:%02X:%02X:%02X:%02X:%02X",
               arp_ban_gateway_mac[0], arp_ban_gateway_mac[1], arp_ban_gateway_mac[2],
               arp_ban_gateway_mac[3], arp_ban_gateway_mac[4], arp_ban_gateway_mac[5]);
    MY_LOG_INFO(TAG, "  Gateway IP: " IPSTR, IP2STR(&ip_info.gw));
    MY_LOG_INFO(TAG, "  Attack: Poisoning BOTH victim and router");
    
    // Start attack task
    arp_ban_active = true;
    BaseType_t result = xTaskCreate(arp_ban_task, "arp_ban", 4096, NULL, 5, &arp_ban_task_handle);
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create ARP ban task");
        arp_ban_active = false;
        return 1;
    }
    
    MY_LOG_INFO(TAG, "ARP ban started. Use 'stop' to stop.");
    return 0;
}

static void packet_monitor_shutdown(void) {
    if (packet_monitor_promiscuous_owned) {
        esp_wifi_set_promiscuous(false);
        packet_monitor_promiscuous_owned = false;
    }

    if (packet_monitor_callback_installed) {
        esp_wifi_set_promiscuous_rx_cb(NULL);
        packet_monitor_callback_installed = false;
    }

    if (packet_monitor_has_prev_channel) {
        esp_wifi_set_channel(packet_monitor_prev_primary, packet_monitor_prev_secondary);
        packet_monitor_has_prev_channel = false;
    }
}

static void packet_monitor_stop(void) {
    if (!packet_monitor_active && packet_monitor_task_handle == NULL && !packet_monitor_promiscuous_owned && !packet_monitor_callback_installed) {
        return;
    }

    MY_LOG_INFO(TAG, "Stopping packet monitor...");

    packet_monitor_active = false;

    for (int i = 0; i < 40 && packet_monitor_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (packet_monitor_task_handle != NULL) {
        vTaskDelete(packet_monitor_task_handle);
        packet_monitor_task_handle = NULL;
    }

    packet_monitor_shutdown();
    packet_monitor_total = 0;
}

static void packet_monitor_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type) {
    (void)buf;

    if (!packet_monitor_active) {
        return;
    }

    packet_monitor_total++;
}

static void packet_monitor_task(void *pvParameters) {
    (void)pvParameters;

    uint32_t last_total = 0;

    while (packet_monitor_active) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        if (!packet_monitor_active) {
            break;
        }

        uint32_t current = packet_monitor_total;
        uint32_t diff = current - last_total;
        last_total = current;

        printf("%" PRIu32 "pkts\n", diff);
        fflush(stdout);
        
        {
            char pm_l3[64], pm_l4[64];
            snprintf(pm_l3, sizeof(pm_l3), "  %" PRIu32 " pkts/sec", diff);
            snprintf(pm_l4, sizeof(pm_l4), "  Total: %" PRIu32, current);
            oled_display_update_full("> Pkt Monitor", "  Listening...", pm_l3, pm_l4);
        }
    }

    packet_monitor_shutdown();
    packet_monitor_task_handle = NULL;
    packet_monitor_total = 0;
    packet_monitor_active = false;
    vTaskDelete(NULL);
}

static void ap_locator_shutdown(void) {
    if (ap_locator_promiscuous_owned) {
        esp_wifi_set_promiscuous(false);
        ap_locator_promiscuous_owned = false;
    }

    if (ap_locator_callback_installed) {
        esp_wifi_set_promiscuous_rx_cb(NULL);
        ap_locator_callback_installed = false;
    }

    if (ap_locator_has_prev_channel) {
        esp_wifi_set_channel(ap_locator_prev_primary, ap_locator_prev_secondary);
        ap_locator_has_prev_channel = false;
    }
}

static void ap_locator_stop(void) {
    if (!ap_locator_active && ap_locator_task_handle == NULL && !ap_locator_promiscuous_owned &&
        !ap_locator_callback_installed) {
        return;
    }

    MY_LOG_INFO(TAG, "Stopping AP locator...");

    ap_locator_active = false;

    for (int i = 0; i < 40 && ap_locator_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (ap_locator_task_handle != NULL) {
        vTaskDelete(ap_locator_task_handle);
        ap_locator_task_handle = NULL;
    }

    ap_locator_shutdown();
    ap_locator_last_rssi = 0;
    ap_locator_beacon_seen = false;
    ap_locator_beacon_total = 0;
    ap_locator_last_seen_us = 0;
    ap_locator_target_channel = 1;
    memset(ap_locator_target_bssid, 0, sizeof(ap_locator_target_bssid));
    ap_locator_target_ssid[0] = '\0';
}

