Smethan/projectZero/ESP32C5/main/main.c
static void ap_locator_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!ap_locator_active || type != WIFI_PKT_MGMT) {
        return;
    }

    const wifi_promiscuous_pkt_t *pkt = (wifi_promiscuous_pkt_t *)buf;
    const uint8_t *frame = pkt->payload;
    int len = pkt->rx_ctrl.sig_len;

    if (len < 24) {
        return;
    }

    if ((frame[0] & 0xFC) != 0x80) {
        return;
    }

    if (memcmp(&frame[10], ap_locator_target_bssid, sizeof(ap_locator_target_bssid)) != 0) {
        return;
    }

    ap_locator_last_rssi = (int)pkt->rx_ctrl.rssi;
    ap_locator_last_seen_us = esp_timer_get_time();
    ap_locator_beacon_seen = true;
    ap_locator_beacon_total++;
}

static void ap_locator_task(void *pvParameters) {
    (void)pvParameters;

    uint32_t last_total = 0;

    while (ap_locator_active) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        if (!ap_locator_active) {
            break;
        }

        char mac_str[18];
        snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                 ap_locator_target_bssid[0], ap_locator_target_bssid[1], ap_locator_target_bssid[2],
                 ap_locator_target_bssid[3], ap_locator_target_bssid[4], ap_locator_target_bssid[5]);

        const char *ssid = ap_locator_target_ssid[0] != '\0' ? ap_locator_target_ssid : "<hidden>";
        uint32_t current_total = ap_locator_beacon_total;
        uint32_t diff = current_total - last_total;
        last_total = current_total;

        if (ap_locator_beacon_seen) {
            printf("[AP Locator] CH: %u | AP: %s (%s) | RSSI: %d dBm | beacons: %" PRIu32 "\n",
                   ap_locator_target_channel,
                   ssid,
                   mac_str,
                   ap_locator_last_rssi,
                   diff);
        } else {
            printf("[AP Locator] CH: %u | AP: %s (%s) | RSSI: N/A | no beacon\n",
                   ap_locator_target_channel,
                   ssid,
                   mac_str);
        }
        fflush(stdout);

        {
            char line2[32];
            char line3[32];
            char line4[32];
            snprintf(line2, sizeof(line2), "  %.24s", ssid);
            if (ap_locator_beacon_seen) {
                snprintf(line3, sizeof(line3), "  Ch %u  %d dB",
                         ap_locator_target_channel,
                         ap_locator_last_rssi);
                snprintf(line4, sizeof(line4), "  %" PRIu32 " bcn/sec", diff);
            } else {
                snprintf(line3, sizeof(line3), "  Ch %u  No beacon", ap_locator_target_channel);
                snprintf(line4, sizeof(line4), "  Waiting...");
            }
            oled_display_update_full("> AP Locator", line2, line3, line4);
        }

        ap_locator_beacon_seen = false;
    }

    ap_locator_shutdown();
    ap_locator_task_handle = NULL;
    ap_locator_active = false;
    vTaskDelete(NULL);
}

static int cmd_packet_monitor(int argc, char **argv) {
    {
        char oled_ch[24];
        snprintf(oled_ch, sizeof(oled_ch), "  Channel %s", argc >= 2 ? argv[1] : "?");
        oled_display_update_full("> Pkt Monitor", oled_ch, "", "  Listening...");
    }
    log_memory_info("packet_monitor");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: packet_monitor <channel>");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor already active. Use 'stop' to stop it first.");
        return 1;
    }

    char *endptr = NULL;
    long channel = strtol(argv[1], &endptr, 10);
    if (argv[1][0] == '\0' || (endptr != NULL && *endptr != '\0')) {
        MY_LOG_INFO(TAG, "Invalid channel argument. Usage: packet_monitor <channel>");
        return 1;
    }

    if (channel < 1 || channel > 165) {
        MY_LOG_INFO(TAG, "Channel must be between 1 and 165.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (wardrive_active) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' to stop it first.");
        return 1;
    }

    esp_err_t err;
    uint8_t primary = 1;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) {
        packet_monitor_prev_primary = primary;
        packet_monitor_prev_secondary = secondary;
        packet_monitor_has_prev_channel = true;
    } else {
        packet_monitor_has_prev_channel = false;
    }

    wifi_promiscuous_filter_t filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT |
                       WIFI_PROMIS_FILTER_MASK_DATA |
                       WIFI_PROMIS_FILTER_MASK_CTRL
    };

    esp_wifi_set_promiscuous(false);

    err = esp_wifi_set_promiscuous_filter(&filter);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set promiscuous filter: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }

    err = esp_wifi_set_channel((uint8_t)channel, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set channel %ld: %s", channel, esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }

    err = esp_wifi_set_promiscuous_rx_cb(packet_monitor_promiscuous_callback);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set promiscuous callback: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }
    packet_monitor_callback_installed = true;

    packet_monitor_total = 0;
    packet_monitor_active = true;

    err = esp_wifi_set_promiscuous(true);
    if (err != ESP_OK) {
        packet_monitor_active = false;
        MY_LOG_INFO(TAG, "Failed to enable promiscuous mode: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }
    packet_monitor_promiscuous_owned = true;

    BaseType_t task_ok = xTaskCreate(
        packet_monitor_task,
        "packet_monitor",
        2048,
        NULL,
        5,
        &packet_monitor_task_handle
    );

    if (task_ok != pdPASS) {
        packet_monitor_active = false;
        packet_monitor_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create packet monitor task.");
        packet_monitor_shutdown();
        return 1;
    }

