Smethan/projectZero/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Packet monitor started on channel %ld. Type 'stop' to stop.", channel);

    esp_err_t led_err = led_set_color(255, 255, 255); // White for packet monitor
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for packet monitor: %s", esp_err_to_name(led_err));
    }
    return 0;
}

static int cmd_start_ap_locator(int argc, char **argv) {
    (void)argc;
    (void)argv;

    oled_display_update_full("> AP Locator", "  Preparing...", "  Selected AP", "  Locking...");
    log_memory_info("start_ap_locator");

    if (!ensure_wifi_mode()) {
        return 1;
    }

    if (ap_locator_active || ap_locator_task_handle != NULL) {
        MY_LOG_INFO(TAG, "AP locator already active. Use 'stop' to stop it first.");
        return 1;
    }

    if (g_selected_count != 1) {
        MY_LOG_INFO(TAG, "AP locator requires exactly one selected network. Use 'select_networks <index>'.");
        return 1;
    }

    if (!g_scan_done || g_scan_count == 0) {
        MY_LOG_INFO(TAG, "No scan results available. Run 'scan_networks' first.");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor is active. Use 'stop' first.");
        return 1;
    }

    if (channel_view_active || channel_view_task_handle != NULL || channel_view_scan_mode) {
        MY_LOG_INFO(TAG, "Channel view is active. Use 'stop' first.");
        return 1;
    }

    if (deauth_detector_active || deauth_detector_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth detector is active. Use 'stop' first.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active || sniffer_dog_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Sniffer operations are active. Use 'stop' first.");
        return 1;
    }

    if (wardrive_active || wardrive_task_handle != NULL || wardrive_promisc_active ||
        wardrive_promisc_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' first.");
        return 1;
    }

    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Handshake attack is active. Use 'stop' first.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' first.");
        return 1;
    }

    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' first.");
        return 1;
    }

    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan is still in progress. Wait for it to finish or use 'stop'.");
        return 1;
    }

    int selected_idx = g_selected_indices[0];
    if (selected_idx < 0 || selected_idx >= (int)g_scan_count) {
        MY_LOG_INFO(TAG, "Selected network is out of range. Run 'scan_networks' and select again.");
        return 1;
    }

    const wifi_ap_record_t *target_ap = &g_scan_results[selected_idx];
    if (target_ap->primary < 1 || target_ap->primary > 165) {
        MY_LOG_INFO(TAG, "Selected AP has invalid channel %d.", target_ap->primary);
        return 1;
    }

    operation_stop_requested = false;
    memcpy(ap_locator_target_bssid, target_ap->bssid, sizeof(ap_locator_target_bssid));
    strncpy(ap_locator_target_ssid, (const char *)target_ap->ssid, sizeof(ap_locator_target_ssid) - 1);
    ap_locator_target_ssid[sizeof(ap_locator_target_ssid) - 1] = '\0';
    ap_locator_target_channel = target_ap->primary;
    ap_locator_last_rssi = target_ap->rssi;
    ap_locator_beacon_total = 0;
    ap_locator_beacon_seen = false;
    ap_locator_last_seen_us = 0;

    esp_err_t err;
    uint8_t primary = 1;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) {
        ap_locator_prev_primary = primary;
        ap_locator_prev_secondary = secondary;
        ap_locator_has_prev_channel = true;
    } else {
        ap_locator_has_prev_channel = false;
    }

    wifi_promiscuous_filter_t filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
    };

    esp_wifi_set_promiscuous(false);

    err = esp_wifi_set_promiscuous_filter(&filter);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator filter: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }

    err = esp_wifi_set_channel(ap_locator_target_channel, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator channel %u: %s",
                    ap_locator_target_channel,
                    esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }

    err = esp_wifi_set_promiscuous_rx_cb(ap_locator_promiscuous_callback);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator callback: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }
    ap_locator_callback_installed = true;

    ap_locator_active = true;

    err = esp_wifi_set_promiscuous(true);
    if (err != ESP_OK) {
        ap_locator_active = false;
        MY_LOG_INFO(TAG, "Failed to enable promiscuous mode for AP locator: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }
    ap_locator_promiscuous_owned = true;

    BaseType_t task_ok = xTaskCreate(
        ap_locator_task,
        "ap_locator",
        3072,
        NULL,
        5,
        &ap_locator_task_handle
    );

    if (task_ok != pdPASS) {
        ap_locator_active = false;
        ap_locator_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create AP locator task.");
        ap_locator_shutdown();
        return 1;
    }

    esp_err_t led_err = led_set_color(0, 255, 0);
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for AP locator: %s", esp_err_to_name(led_err));
    }

    MY_LOG_INFO(TAG, "AP locator started for '%s' on channel %u. Type 'stop' to stop.",
                ap_locator_target_ssid[0] != '\0' ? ap_locator_target_ssid : "<hidden>",
                ap_locator_target_channel);
    return 0;
}

static void channel_view_publish_counts(void) {
    uint16_t counts24[CHANNEL_VIEW_24GHZ_CHANNEL_COUNT] = {0};
    uint16_t counts5[CHANNEL_VIEW_5GHZ_CHANNEL_COUNT] = {0};

