Smethan/projectZero/ESP32C5/main/main.c
    for (uint16_t i = 0; i < g_scan_count; ++i) {
        const wifi_ap_record_t *ap = &g_scan_results[i];
        uint8_t primary = ap->primary;
        if (primary >= 1 && primary <= 14) {
            counts24[primary - 1]++;
        } else {
            for (size_t idx = 0; idx < CHANNEL_VIEW_5GHZ_CHANNEL_COUNT; ++idx) {
                if (channel_view_5ghz_channels[idx] == primary) {
                    counts5[idx]++;
                    break;
                }
            }
        }
    }

    MY_LOG_INFO(TAG, "channel_view_start");
    MY_LOG_INFO(TAG, "band:24");
    for (size_t i = 0; i < CHANNEL_VIEW_24GHZ_CHANNEL_COUNT; ++i) {
        MY_LOG_INFO(TAG, "ch%u:%u", channel_view_24ghz_channels[i], counts24[i]);
    }
    MY_LOG_INFO(TAG, "band:5");
    for (size_t i = 0; i < CHANNEL_VIEW_5GHZ_CHANNEL_COUNT; ++i) {
        MY_LOG_INFO(TAG, "ch%u:%u", channel_view_5ghz_channels[i], counts5[i]);
    }
    MY_LOG_INFO(TAG, "channel_view_end");
}

static void channel_view_task(void *pvParameters) {
    (void)pvParameters;

    const TickType_t scan_delay = pdMS_TO_TICKS(CHANNEL_VIEW_SCAN_DELAY_MS);
    const TickType_t wait_slice = pdMS_TO_TICKS(100);

    int cv_scan_num = 0;
    
    while (channel_view_active && !operation_stop_requested) {
        oled_display_update_full("> Channel View", "  Scanning...", "  All channels", "  Analyzing...");
        
        esp_err_t err = start_background_scan(FAST_SCAN_MIN_TIME, FAST_SCAN_MAX_TIME);
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "channel_view_error:scan_start %s", esp_err_to_name(err));
            break;
        }

        int wait_iterations = 0;
        while (channel_view_active && g_scan_in_progress &&
               wait_iterations < CHANNEL_VIEW_SCAN_TIMEOUT_ITERATIONS) {
            vTaskDelay(wait_slice);
            wait_iterations++;
        }

        if (!channel_view_active || operation_stop_requested) {
            break;
        }

        if (g_scan_in_progress) {
            MY_LOG_INFO(TAG, "channel_view_error:timeout");
            esp_wifi_scan_stop();
        } else {
            channel_view_publish_counts();
            cv_scan_num++;
            
            // Find busiest channel
            int busiest_ch = 0, busiest_count = 0;
            for (uint16_t ci = 0; ci < g_scan_count; ci++) {
                int ch = g_scan_results[ci].primary;
                int cnt = 0;
                for (uint16_t cj = 0; cj < g_scan_count; cj++) {
                    if (g_scan_results[cj].primary == ch) cnt++;
                }
                if (cnt > busiest_count) { busiest_count = cnt; busiest_ch = ch; }
            }
            
            char cv_l2[64], cv_l3[64], cv_l4[64];
            snprintf(cv_l2, sizeof(cv_l2), "  Found %d APs", g_scan_count);
            snprintf(cv_l3, sizeof(cv_l3), "  Busy: Ch%d (%d)", busiest_ch, busiest_count);
            snprintf(cv_l4, sizeof(cv_l4), "  Scan #%d", cv_scan_num);
            oled_display_update_full("> Channel View", cv_l2, cv_l3, cv_l4);
        }

        if (!channel_view_active || operation_stop_requested) {
            break;
        }

        vTaskDelay(scan_delay);
    }

    channel_view_scan_mode = false;
    channel_view_active = false;
    channel_view_task_handle = NULL;
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore LED after channel view: %s", esp_err_to_name(led_err));
    }
    MY_LOG_INFO(TAG, "Channel view monitor stopped.");
    vTaskDelete(NULL);
}

static void channel_view_stop(void) {
    if (!channel_view_active && channel_view_task_handle == NULL && !channel_view_scan_mode) {
        return;
    }

    channel_view_active = false;
    if (channel_view_scan_mode && g_scan_in_progress) {
        esp_wifi_scan_stop();
    }

    for (int i = 0; i < 40 && channel_view_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (channel_view_task_handle != NULL) {
        vTaskDelete(channel_view_task_handle);
        channel_view_task_handle = NULL;
    }

    channel_view_scan_mode = false;
    MY_LOG_INFO(TAG, "Channel view stopped.");
}

static int cmd_channel_view(int argc, char **argv) {
    (void)argc;
    (void)argv;
    oled_display_update_full("> Channel View", "  WiFi spectrum", "  All channels", "  Analyzing...");
    log_memory_info("channel_view");

    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }

    if (channel_view_active || channel_view_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Channel view already running. Use 'stop' to stop it first.");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer operations are active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (wardrive_active) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan already in progress. Wait for it to finish or use 'stop'.");
        return 1;
    }

    operation_stop_requested = false;
    channel_view_active = true;
    channel_view_scan_mode = true;
    BaseType_t task_ok =
        xTaskCreate(channel_view_task, "channel_view", 4096, NULL, 5, &channel_view_task_handle);

    if (task_ok != pdPASS) {
        channel_view_active = false;
        channel_view_scan_mode = false;
        channel_view_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create channel view task.");
        return 1;
    }

    esp_err_t led_err = led_set_color(128, 0, 255); // purple-ish to indicate analyzer
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for channel view: %s", esp_err_to_name(led_err));
    }

