Smethan/projectZero/ESP32C5/main/main.c
    // Compact format for Flipper Zero display with vendor info
    int displayed_count = 0;
    for (int i = 0; i < sniffer_ap_count; i++) {
        int idx = sorted_indices[i];
        sniffer_ap_t *ap = &sniffer_aps[idx];
        
        // Skip broadcast BSSID and our own device
        if (is_broadcast_bssid(ap->bssid) || is_own_device_mac(ap->bssid)) {
            continue;
        }
        
        // Skip APs with no clients
        if (ap->client_count == 0) {
            continue;
        }
        
        displayed_count++;
        
        // Print AP info in compact format: SSID, CH: CLIENT_COUNT [Vendor]
        const char *ap_vendor = lookup_vendor_name(ap->bssid);
        printf("%s, CH%d: %d [%s]\n", ap->ssid, ap->channel, ap->client_count,
               ap_vendor ? ap_vendor : "Unknown");
        
        // Print each client MAC on a separate line with 1 space indentation and vendor
        if (ap->client_count > 0) {
            for (int j = 0; j < ap->client_count; j++) {
                sniffer_client_t *client = &ap->clients[j];
                const char *client_vendor = lookup_vendor_name(client->mac);
                printf(" %02X:%02X:%02X:%02X:%02X:%02X [%s]\n",
                       client->mac[0], client->mac[1], client->mac[2],
                       client->mac[3], client->mac[4], client->mac[5],
                       client_vendor ? client_vendor : "Unknown");
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(20)); // Small delay to avoid overwhelming UART
    }
    
    if (displayed_count == 0) {
        MY_LOG_INFO(TAG, "No APs with clients found.");
    }
    
    return 0;
}

static int cmd_clear_sniffer_results(int argc, char **argv) {
    (void)argc; (void)argv;
    
    // Clear all sniffer data
    sniffer_ap_count = 0;
    memset(sniffer_aps, 0, MAX_SNIFFER_APS * sizeof(sniffer_ap_t));
    probe_request_count = 0;
    memset(probe_requests, 0, MAX_PROBE_REQUESTS * sizeof(probe_request_t));
    sniffer_packet_counter = 0;
    sniffer_last_debug_packet = 0;
    
    MY_LOG_INFO(TAG, "Sniffer results cleared.");
    return 0;
}

static int cmd_show_probes(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (probe_request_count == 0) {
        MY_LOG_INFO(TAG, "No probe requests captured. Use 'start_sniffer' to collect data.");
        return 0;
    }
    
    MY_LOG_INFO(TAG, "Probe requests: %d", probe_request_count);
    
    // Display each probe request: SSID (MAC)
    for (int i = 0; i < probe_request_count; i++) {
        probe_request_t *probe = &probe_requests[i];
        printf("%s (%02X:%02X:%02X:%02X:%02X:%02X)\n",
               probe->ssid,
               probe->mac[0], probe->mac[1], probe->mac[2],
               probe->mac[3], probe->mac[4], probe->mac[5]);
        
        vTaskDelay(pdMS_TO_TICKS(10)); // Small delay to avoid overwhelming UART
    }
    
    return 0;
}

static int cmd_show_probes_vendor(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (probe_request_count == 0) {
        MY_LOG_INFO(TAG, "No probe requests captured. Use 'start_sniffer' to collect data.");
        return 0;
    }
    
    MY_LOG_INFO(TAG, "Probe requests: %d", probe_request_count);
    
    // Display each probe request with vendor: SSID (MAC) [Vendor]
    for (int i = 0; i < probe_request_count; i++) {
        probe_request_t *probe = &probe_requests[i];
        const char *vendor_name = lookup_vendor_name(probe->mac);
        printf("%s (%02X:%02X:%02X:%02X:%02X:%02X) [%s]\n",
               probe->ssid,
               probe->mac[0], probe->mac[1], probe->mac[2],
               probe->mac[3], probe->mac[4], probe->mac[5],
               vendor_name ? vendor_name : "Unknown");
        
        vTaskDelay(pdMS_TO_TICKS(10)); // Small delay to avoid overwhelming UART
    }
    
    return 0;
}

static int cmd_list_probes(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (probe_request_count == 0) {
        MY_LOG_INFO(TAG, "No probe requests captured. Use 'start_sniffer' to collect data.");
        return 0;
    }
    
    int unique_count = 0;
    
    // Display each unique SSID only once
    for (int i = 0; i < probe_request_count; i++) {
        probe_request_t *probe = &probe_requests[i];
        
        // Check if this SSID has already been displayed by looking at previous entries
        bool already_displayed = false;
        for (int j = 0; j < i; j++) {
            if (strcmp(probe->ssid, probe_requests[j].ssid) == 0) {
                already_displayed = true;
                break;
            }
        }
        
        // If not displayed yet, display it
        if (!already_displayed) {
            unique_count++;
            printf("%d %s\n", unique_count, probe->ssid);
            
            vTaskDelay(pdMS_TO_TICKS(10)); // Small delay to avoid overwhelming UART
        }
    }
    
    return 0;
}

static int cmd_list_probes_vendor(int argc, char **argv) {
    (void)argc; (void)argv;
    
    if (probe_request_count == 0) {
        MY_LOG_INFO(TAG, "No probe requests captured. Use 'start_sniffer' to collect data.");
        return 0;
    }
    
    int unique_count = 0;
    
    // Display each unique SSID only once with vendor from first seen MAC
    for (int i = 0; i < probe_request_count; i++) {
        probe_request_t *probe = &probe_requests[i];
        
        // Check if this SSID has already been displayed by looking at previous entries
        bool already_displayed = false;
        for (int j = 0; j < i; j++) {
            if (strcmp(probe->ssid, probe_requests[j].ssid) == 0) {
                already_displayed = true;
                break;
            }
        }
        
        // If not displayed yet, display it
        if (!already_displayed) {
            unique_count++;
            const char *vendor_name = lookup_vendor_name(probe->mac);
            printf("%d %s [%s]\n", unique_count, probe->ssid, vendor_name ? vendor_name : "Unknown");
            
            vTaskDelay(pdMS_TO_TICKS(10)); // Small delay to avoid overwhelming UART
        }
    }
    
