Smethan/projectZero/ESP32C5/main/main.c
    return 0;
}

static int cmd_sniffer_debug(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Current sniffer debug mode: %s", sniff_debug ? "ON" : "OFF");
        MY_LOG_INFO(TAG, "Usage: sniffer_debug <0|1>");
        MY_LOG_INFO(TAG, "  0 = disable debug logging");
        MY_LOG_INFO(TAG, "  1 = enable debug logging");
        return 0;
    }
    
    int new_debug = atoi(argv[1]);
    if (new_debug != 0 && new_debug != 1) {
        MY_LOG_INFO(TAG, "Invalid value. Use 0 (disable) or 1 (enable)");
        return 1;
    }
    
    sniff_debug = new_debug;
    MY_LOG_INFO(TAG, "Sniffer debug mode %s", sniff_debug ? "ENABLED" : "DISABLED");
    
    if (sniff_debug) {
        MY_LOG_INFO(TAG, "Debug logging will show detailed packet analysis:");
        MY_LOG_INFO(TAG, "- Packet type, length, channel, RSSI");
        MY_LOG_INFO(TAG, "- All MAC addresses in packet");
        MY_LOG_INFO(TAG, "- AP matching process");
        MY_LOG_INFO(TAG, "- Reason for packet acceptance/rejection");
    }
    
    return 0;
}

static int cmd_start_sniffer_dog(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Sniff Dog", "  Hunt AP-STA", "  Auto deauth", "  Active...");
    log_memory_info("start_sniffer_dog");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    if (sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer Dog already active. Use 'stop' to stop it first.");
        return 1;
    }
    
    if (sniffer_active) {
        MY_LOG_INFO(TAG, "Regular sniffer is active. Use 'stop' to stop it first.");
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Starting Sniffer Dog mode...");
    
    // Activate sniffer_dog
    sniffer_dog_active = true;
    
    // Set LED to red (aggressive mode)
    esp_err_t led_err = led_set_color(255, 0, 0); // Red
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for Sniffer Dog: %s", esp_err_to_name(led_err));
    }
    
    // Set promiscuous filter
    esp_wifi_set_promiscuous_filter(&sniffer_filter);
    
    // Enable promiscuous mode with sniffer_dog callback
    esp_wifi_set_promiscuous_rx_cb(sniffer_dog_promiscuous_callback);
    esp_wifi_set_promiscuous(true);
    
    // Initialize dual-band channel hopping
    sniffer_dog_channel_index = 0;
    sniffer_dog_current_channel = dual_band_channels[0];
    esp_wifi_set_channel(sniffer_dog_current_channel, WIFI_SECOND_CHAN_NONE);
    sniffer_dog_last_channel_hop = esp_timer_get_time() / 1000;
    
    // Create channel hopping task
    BaseType_t task_created = xTaskCreate(
        sniffer_dog_task,
        "sniffer_dog",
        4096,
        NULL,
        5,
        &sniffer_dog_task_handle
    );
    
    if (task_created != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create Sniffer Dog channel hopping task");
        sniffer_dog_active = false;
        esp_wifi_set_promiscuous(false);
        
        // Return LED to idle
        led_err = led_set_idle();
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to restore idle LED after Sniffer Dog failure: %s", esp_err_to_name(led_err));
        }
        
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Sniffer Dog started - hunting for AP-STA pairs...");
    MY_LOG_INFO(TAG, "Deauth packets will be sent to detected stations.");
    MY_LOG_INFO(TAG, "Use 'stop' to stop.");
    
    return 0;
}

static int cmd_deauth_detector(int argc, char **argv) {
    oled_display_update_full("> Deauth Detect", "  Monitoring...", "  All channels", "  Passive scan");
    log_memory_info("deauth_detector");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    if (deauth_detector_active) {
        MY_LOG_INFO(TAG, "Deauth detector already active. Use 'stop' to stop it first.");
        return 1;
    }
    
    if (sniffer_active) {
        MY_LOG_INFO(TAG, "Regular sniffer is active. Use 'stop' to stop it first.");
        return 1;
    }
    
    if (sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer Dog is active. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset selected mode state
    deauth_detector_selected_mode = false;
    deauth_detector_selected_channels_count = 0;
    memset(deauth_detector_selected_channels, 0, sizeof(deauth_detector_selected_channels));
    
    // MODE B: With network indices (e.g., deauth_detector 1 3)
    if (argc > 1) {
        // Check if scan was performed
        if (!g_scan_done || g_scan_count == 0) {
            MY_LOG_INFO(TAG, "No scan results available. Run 'scan_networks' first.");
            return 1;
        }
        
        MY_LOG_INFO(TAG, "Starting Deauth Detector in SELECTED mode...");
        
        // Parse indices and extract unique channels
        for (int i = 1; i < argc; i++) {
            int user_idx = atoi(argv[i]);
            int idx = user_idx - 1; // Convert from 1-based (user) to 0-based (internal)
            
            // Validate index
            if (idx < 0 || idx >= (int)g_scan_count) {
                MY_LOG_INFO(TAG, "Invalid index %d (valid: 1-%d), skipping", user_idx, g_scan_count);
                continue;
            }
            
            wifi_ap_record_t *ap = &g_scan_results[idx];
            int channel = ap->primary;
            
            // Check if channel already in list
            bool channel_exists = false;
            for (int j = 0; j < deauth_detector_selected_channels_count; j++) {
                if (deauth_detector_selected_channels[j] == channel) {
                    channel_exists = true;
                    break;
                }
            }
            
            if (!channel_exists && deauth_detector_selected_channels_count < MAX_AP_CNT) {
                deauth_detector_selected_channels[deauth_detector_selected_channels_count++] = channel;
                MY_LOG_INFO(TAG, "  Added: %s (ch %d)", ap->ssid, channel);
            }
        }
        
