Smethan/projectZero/ESP32C5/main/main.c
static int cmd_led(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: led set <on|off> | led level <1-100> | led read");
        return 1;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: led set <on|off>");
            return 1;
        }

        if (strcasecmp(argv[2], "on") == 0) {
            esp_err_t err = led_set_enabled(true);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to enable LED: %s", esp_err_to_name(err));
                return 1;
            }
            err = led_set_idle();
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to set LED idle color: %s", esp_err_to_name(err));
                return 1;
            }
            led_persist_state();
            MY_LOG_INFO(TAG, "LED turned on (brightness %u%%)", led_brightness_percent);
            return 0;
        } else if (strcasecmp(argv[2], "off") == 0) {
            esp_err_t err = led_set_enabled(false);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to disable LED: %s", esp_err_to_name(err));
                return 1;
            }
            led_persist_state();
            MY_LOG_INFO(TAG, "LED turned off (previous brightness %u%% stored)", led_brightness_percent);
            return 0;
        }

        MY_LOG_INFO(TAG, "Usage: led set <on|off>");
        return 1;
    }

    if (strcasecmp(argv[1], "level") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: led level <1-100>");
            return 1;
        }

        int level = atoi(argv[2]);
        if (level < (int)LED_BRIGHTNESS_MIN || level > (int)LED_BRIGHTNESS_MAX) {
            MY_LOG_INFO(TAG, "Brightness must be between %u and %u", LED_BRIGHTNESS_MIN, LED_BRIGHTNESS_MAX);
            return 1;
        }

        esp_err_t err = led_set_brightness((uint8_t)level);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to set LED brightness: %s", esp_err_to_name(err));
            return 1;
        }
        led_persist_state();

        if (led_is_enabled()) {
            MY_LOG_INFO(TAG, "LED brightness set to %d%%", level);
        } else {
            MY_LOG_INFO(TAG, "LED brightness set to %d%% (LED currently off)", level);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        MY_LOG_INFO(TAG, "LED status: %s, brightness %u%%", led_is_enabled() ? "on" : "off", led_brightness_percent);
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: led set <on|off> | led level <1-100> | led read");
    return 1;
}

static int cmd_channel_time(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms> | channel_time read <min|max>");
        return 1;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 4) {
            MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms>");
            return 1;
        }
        
        int value = atoi(argv[3]);
        if (value < 1) {
            MY_LOG_INFO(TAG, "Value must be at least 1 ms");
            return 1;
        }

        if (strcasecmp(argv[2], "min") == 0) {
            if (value > CHANNEL_TIME_MIN_LIMIT) {
                MY_LOG_INFO(TAG, "Value %d exceeds limit, setting to max allowed %d ms", value, CHANNEL_TIME_MIN_LIMIT);
                value = CHANNEL_TIME_MIN_LIMIT;
            }
            g_scan_min_channel_time = (uint32_t)value;
            if (g_scan_min_channel_time > g_scan_max_channel_time) {
                g_scan_max_channel_time = g_scan_min_channel_time;
                MY_LOG_INFO(TAG, "Min channel time set to %u ms (max adjusted to %u ms)", 
                            (unsigned int)g_scan_min_channel_time, (unsigned int)g_scan_max_channel_time);
            } else {
                MY_LOG_INFO(TAG, "Min channel time set to %u ms", (unsigned int)g_scan_min_channel_time);
            }
            channel_time_persist_state();
            return 0;
        } else if (strcasecmp(argv[2], "max") == 0) {
            if (value > CHANNEL_TIME_MAX_LIMIT) {
                MY_LOG_INFO(TAG, "Value %d exceeds limit, setting to max allowed %d ms", value, CHANNEL_TIME_MAX_LIMIT);
                value = CHANNEL_TIME_MAX_LIMIT;
            }
            g_scan_max_channel_time = (uint32_t)value;
            if (g_scan_max_channel_time < g_scan_min_channel_time) {
                g_scan_min_channel_time = g_scan_max_channel_time;
                MY_LOG_INFO(TAG, "Max channel time set to %u ms (min adjusted to %u ms)", 
                            (unsigned int)g_scan_max_channel_time, (unsigned int)g_scan_min_channel_time);
            } else {
                MY_LOG_INFO(TAG, "Max channel time set to %u ms", (unsigned int)g_scan_max_channel_time);
            }
            channel_time_persist_state();
            return 0;
        }
        MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms>");
        return 1;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: channel_time read <min|max>");
            return 1;
        }
        if (strcasecmp(argv[2], "min") == 0) {
            MY_LOG_INFO(TAG, "%u", (unsigned int)g_scan_min_channel_time);
            return 0;
        } else if (strcasecmp(argv[2], "max") == 0) {
            MY_LOG_INFO(TAG, "%u", (unsigned int)g_scan_max_channel_time);
            return 0;
        }
        MY_LOG_INFO(TAG, "Usage: channel_time read <min|max>");
        return 1;
    }

    MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms> | channel_time read <min|max>");
    return 1;
}

static boot_action_config_t* boot_get_action_slot(const char* which) {
    if (which == NULL) {
        return NULL;
    }
    if (strcasecmp(which, "short") == 0) {
        return &boot_config.short_press;
    }
    if (strcasecmp(which, "long") == 0) {
        return &boot_config.long_press;
    }
    return NULL;
}

static int cmd_boot_button(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: boot_button read | boot_button list | boot_button set <short|long> <command[, command...]> | boot_button status <short|long> <on|off>");
        return 1;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        boot_config_print();
        return 0;
    }

