Smethan/projectZero/ESP32C5/main/main.c
    if (strcasecmp(argv[1], "list") == 0) {
        boot_list_allowed_commands();
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 4) {
            MY_LOG_INFO(TAG, "Usage: boot_button set <short|long> <command[, command...]>");
            boot_list_allowed_commands();
            return 1;
        }
        boot_action_config_t* slot = boot_get_action_slot(argv[2]);
        if (slot == NULL) {
            MY_LOG_INFO(TAG, "Unknown target '%s' (use short|long)", argv[2]);
            return 1;
        }

        char flow[BOOTCFG_CMD_MAX_LEN];
        if (!boot_build_command_flow_from_argv(argc, argv, 3, flow, sizeof(flow))) {
            MY_LOG_INFO(TAG, "Boot flow too long (max %d chars)", BOOTCFG_CMD_MAX_LEN - 1);
            return 1;
        }

        char detail[BOOTCFG_CMD_MAX_LEN];
        boot_flow_validation_result_t validation = boot_validate_command_flow(flow, detail, sizeof(detail));
        if (validation == BOOT_FLOW_INVALID_COMMAND) {
            MY_LOG_INFO(TAG, "Command '%s' not allowed", detail);
            boot_list_allowed_commands();
            return 1;
        }
        if (validation != BOOT_FLOW_VALID) {
            MY_LOG_INFO(TAG, "Malformed boot flow. Separate commands with commas.");
            boot_list_allowed_commands();
            return 1;
        }

        strlcpy(slot->command, flow, sizeof(slot->command));
        boot_config_persist();
        boot_config_print();
        return 0;
    }

    if (strcasecmp(argv[1], "status") == 0) {
        if (argc < 4) {
            MY_LOG_INFO(TAG, "Usage: boot_button status <short|long> <on|off>");
            return 1;
        }
        boot_action_config_t* slot = boot_get_action_slot(argv[2]);
        if (slot == NULL) {
            MY_LOG_INFO(TAG, "Unknown target '%s' (use short|long)", argv[2]);
            return 1;
        }
        if (strcasecmp(argv[3], "on") == 0) {
            slot->enabled = true;
        } else if (strcasecmp(argv[3], "off") == 0) {
            slot->enabled = false;
        } else {
            MY_LOG_INFO(TAG, "Status must be on|off");
            return 1;
        }
        boot_config_persist();
        boot_config_print();
        return 0;
    }

    MY_LOG_INFO(TAG, "Unknown subcommand. Use: read | list | set | status");
    return 1;
}

static int cmd_vendor(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: vendor set <on|off> | vendor read");
        return 1;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: vendor set <on|off>");
            return 1;
        }

        bool enable;
        if (strcasecmp(argv[2], "on") == 0) {
            enable = true;
        } else if (strcasecmp(argv[2], "off") == 0) {
            enable = false;
        } else {
            MY_LOG_INFO(TAG, "Usage: vendor set <on|off>");
            return 1;
        }

        vendor_set_enabled(enable);
        if (enable && sd_card_mounted) {
            ensure_vendor_file_checked();
        }

        MY_LOG_INFO(TAG, "Vendor scan: %s", vendor_is_enabled() ? "on" : "off");
        if (vendor_is_enabled()) {
            if (!sd_card_mounted) {
                MY_LOG_INFO(TAG, "Vendor file: waiting for SD card");
            } else {
                MY_LOG_INFO(TAG, "Vendor file: %s (%u entries)",
                            vendor_file_present ? "available" : "missing",
                            (unsigned int)vendor_record_count);
            }
        }
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (vendor_is_enabled() && sd_card_mounted) {
            ensure_vendor_file_checked();
        }
        MY_LOG_INFO(TAG, "Vendor scan: %s", vendor_is_enabled() ? "on" : "off");
        if (vendor_is_enabled()) {
            if (!sd_card_mounted) {
                MY_LOG_INFO(TAG, "Vendor file: waiting for SD card");
            } else {
                MY_LOG_INFO(TAG, "Vendor file: %s (%u entries)",
                            vendor_file_present ? "available" : "missing",
                            (unsigned int)vendor_record_count);
            }
        }
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: vendor set <on|off> | vendor read");
    return 1;
}

static int cmd_display(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: display set <auto|ssd1306|sh1107|sh1106|unit_lcd> | display read");
        return 1;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        display_type_t detected = oled_display_get_type();
        const char *detected_name = "none";
        switch (detected) {
            case DISPLAY_SSD1306: detected_name = "ssd1306"; break;
            case DISPLAY_SH1107: detected_name = "sh1107"; break;
            case DISPLAY_SH1106: detected_name = "sh1106"; break;
            case DISPLAY_UNIT_LCD: detected_name = "unit_lcd"; break;
            case DISPLAY_NONE:
            default: detected_name = "none"; break;
        }
        MY_LOG_INFO(TAG, "Display mode: %s", display_mode_to_str(display_forced_mode));
        MY_LOG_INFO(TAG, "Detected now: %s (addr raw 0x%02X / 7-bit 0x%02X)",
                    detected_name,
                    (int)oled_display_get_i2c_addr_raw(),
                    (int)oled_display_get_i2c_addr_7bit());
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: display set <auto|ssd1306|sh1107|sh1106|unit_lcd>");
            return 1;
        }
        display_type_t mode = DISPLAY_NONE;
        if (!display_mode_from_str(argv[2], &mode)) {
            MY_LOG_INFO(TAG, "Unknown mode '%s'. Use: auto|ssd1306|sh1107|sh1106|unit_lcd", argv[2]);
            return 1;
        }
        display_forced_mode = mode;
        oled_display_set_forced_type(display_forced_mode);
        display_mode_save_to_nvs(display_forced_mode);
        MY_LOG_INFO(TAG, "Display mode saved: %s", display_mode_to_str(display_forced_mode));
        MY_LOG_INFO(TAG, "Reboot required to re-initialize display driver");
        return 0;
    }

