Smethan/projectZero/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Usage: display set <auto|ssd1306|sh1107|sh1106|unit_lcd> | display read");
    return 1;
}

// Command: start_karma - Starts portal with SSID from probe list
static int cmd_start_karma(int argc, char **argv)
{
    oled_display_update_full("> Karma Attack",
        argc >= 2 ? argv[1] : "  No index",
        "  Fake AP up", "  Capturing...");
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_karma <index>");
        MY_LOG_INFO(TAG, "Example: start_karma 2");
        MY_LOG_INFO(TAG, "Use 'list_probes' to see available SSIDs with their indexes");
        return 1;
    }
    
    // Check if we have any probes captured
    if (probe_request_count == 0) {
        MY_LOG_INFO(TAG, "No probe requests captured. Use 'start_sniffer' to collect data first.");
        return 1;
    }
    
    // Parse the index argument
    int target_index = atoi(argv[1]);
    
    if (target_index < 1) {
        MY_LOG_INFO(TAG, "Invalid index %d. Must be >= 1", target_index);
        MY_LOG_INFO(TAG, "Use 'list_probes' to see available indexes");
        return 1;
    }
    
    // Find the N-th unique SSID (same logic as list_probes)
    int unique_count = 0;
    char *selected_ssid = NULL;
    
    for (int i = 0; i < probe_request_count; i++) {
        probe_request_t *probe = &probe_requests[i];
        
        // Check if this SSID has already been seen
        bool already_seen = false;
        for (int j = 0; j < i; j++) {
            if (strcmp(probe->ssid, probe_requests[j].ssid) == 0) {
                already_seen = true;
                break;
            }
        }
        
        // If not seen yet, it's a unique SSID
        if (!already_seen) {
            unique_count++;
            if (unique_count == target_index) {
                selected_ssid = probe->ssid;
                break;
            }
        }
    }
    
    if (selected_ssid == NULL) {
        MY_LOG_INFO(TAG, "Invalid index %d. Valid range: 1-%d", target_index, unique_count);
        MY_LOG_INFO(TAG, "Use 'list_probes' to see available indexes");
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Starting Karma attack with SSID: %s", selected_ssid);
    
    {
        char karma_l2[64];
        snprintf(karma_l2, sizeof(karma_l2), ">> %s", selected_ssid);
        oled_display_update_full("> Karma Attack", karma_l2, "  Fake AP up", "  Capturing...");
    }
    
    karma_mode_active = true;
    
    // Prepare arguments for cmd_start_portal
    char *portal_argv[2];
    portal_argv[0] = "start_portal";
    portal_argv[1] = selected_ssid;
    
    // Call cmd_start_portal with the selected SSID
    return cmd_start_portal(2, portal_argv);
}

// Load preset SSIDs from /sdcard/lab/ssid.txt
static int load_ssid_presets(char ssids[][MAX_SSID_NAME_LEN + 1], int max_entries) {
    if (max_entries <= 0) {
        return 0;
    }

    FILE *f = fopen(SSID_PRESET_PATH, "r");
    if (f == NULL) {
        return -1;
    }

    char line[96];
    int count = 0;
    while ((count < max_entries) && fgets(line, sizeof(line), f)) {
        char *start = line;
        while (*start && isspace((unsigned char)*start)) {
            start++;
        }
        if (*start == '\0') {
            continue;
        }
        char *end = start + strlen(start);
        while (end > start && (end[-1] == '\n' || end[-1] == '\r')) {
            *--end = '\0';
        }
        while (end > start && isspace((unsigned char)end[-1])) {
            *--end = '\0';
        }
        if (*start == '\0') {
            continue;
        }
        size_t len = strlen(start);
        if (len > MAX_SSID_NAME_LEN) {
            start[MAX_SSID_NAME_LEN] = '\0';
        }
        strncpy(ssids[count], start, MAX_SSID_NAME_LEN);
        ssids[count][MAX_SSID_NAME_LEN] = '\0';
        count++;
    }

    fclose(f);
    return count;
}

static void report_ssid_file_status(void) {
    char ssids[MAX_SSID_PRESETS][MAX_SSID_NAME_LEN + 1];
    int count = load_ssid_presets(ssids, MAX_SSID_PRESETS);
    if (count < 0) {
        MY_LOG_INFO(TAG, "ssid.txt not found - manual SSID entry only");
        return;
    }
    MY_LOG_INFO(TAG, "ssid.txt found with %d preset SSID(s)", count);
}

static void ensure_ssids_file(void) {
    FILE *f = fopen(SSIDS_FILE_PATH, "r");
    if (f == NULL) {
        f = fopen(SSIDS_FILE_PATH, "w");
        if (f) {
            fclose(f);
            sd_sync();
            MY_LOG_INFO(TAG, "ssids.txt created (empty)");
        } else {
            MY_LOG_INFO(TAG, "Failed to create ssids.txt");
        }
        return;
    }
    int count = 0;
    char line[96];
    while (fgets(line, sizeof(line), f)) {
        char *s = line;
        while (*s && isspace((unsigned char)*s)) s++;
        char *e = s + strlen(s);
        while (e > s && (e[-1] == '\n' || e[-1] == '\r')) *--e = '\0';
        while (e > s && isspace((unsigned char)e[-1])) *--e = '\0';
        if (*s != '\0') count++;
    }
    fclose(f);
    MY_LOG_INFO(TAG, "ssids.txt found with %d SSID(s)", count);
}

// Command: list_ssid - Lists SSIDs from ssid.txt on SD card
static int cmd_list_ssid(int argc, char **argv)
{
    (void)argc; (void)argv;

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }

    char ssids[MAX_SSID_PRESETS][MAX_SSID_NAME_LEN + 1];
    int count = load_ssid_presets(ssids, MAX_SSID_PRESETS);
    if (count < 0) {
        MY_LOG_INFO(TAG, "ssid.txt not found on SD card.");
        return 0;
    }

    if (count == 0) {
        MY_LOG_INFO(TAG, "ssid.txt is empty - manual SSID entry only.");
        return 0;
    }

    MY_LOG_INFO(TAG, "SSID presets from ssid.txt:");
    for (int i = 0; i < count; i++) {
        printf("%d %s\n", i + 1, ssids[i]);
    }

    return 0;
}

static int cmd_list_ssids(int argc, char **argv)
{
    (void)argc; (void)argv;

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    FILE *f = fopen(SSIDS_FILE_PATH, "r");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "ssids.txt not found on SD card.");
        return 0;
    }

