Smethan/projectZero/ESP32C5/main/main.c
    char line[96];
    int idx = 0;
    while (fgets(line, sizeof(line), f)) {
        char *start = line;
        while (*start && isspace((unsigned char)*start)) start++;
        char *end = start + strlen(start);
        while (end > start && (end[-1] == '\n' || end[-1] == '\r')) *--end = '\0';
        while (end > start && isspace((unsigned char)end[-1])) *--end = '\0';
        if (*start == '\0') continue;
        idx++;
        printf("%d %s\n", idx, start);
    }
    fclose(f);

    if (idx == 0) {
        MY_LOG_INFO(TAG, "ssids.txt is empty.");
    }
    return 0;
}

static int cmd_add_ssid(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: add_ssid <SSID>");
        return 1;
    }

    int len = strlen(argv[1]);
    if (len == 0 || len > MAX_SSID_NAME_LEN) {
        MY_LOG_INFO(TAG, "SSID length must be 1-%d characters", MAX_SSID_NAME_LEN);
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    FILE *f = fopen(SSIDS_FILE_PATH, "a");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open ssids.txt for writing");
        return 1;
    }
    fprintf(f, "%s\n", argv[1]);
    fclose(f);
    sd_sync();

    MY_LOG_INFO(TAG, "Added SSID: %s", argv[1]);
    return 0;
}

static int cmd_remove_ssid(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: remove_ssid <index>");
        return 1;
    }

    int target = atoi(argv[1]);
    if (target < 1) {
        MY_LOG_INFO(TAG, "Index must be >= 1");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char lines[MAX_SSID_PRESETS][MAX_SSID_NAME_LEN + 1];
    int count = 0;
    {
        FILE *rf = fopen(SSIDS_FILE_PATH, "r");
        if (rf == NULL) {
            MY_LOG_INFO(TAG, "ssids.txt not found on SD card.");
            return 1;
        }
        char line[96];
        while (count < MAX_SSID_PRESETS && fgets(line, sizeof(line), rf)) {
            char *s = line;
            while (*s && isspace((unsigned char)*s)) s++;
            char *e = s + strlen(s);
            while (e > s && (e[-1] == '\n' || e[-1] == '\r')) *--e = '\0';
            while (e > s && isspace((unsigned char)e[-1])) *--e = '\0';
            if (*s == '\0') continue;
            strncpy(lines[count], s, MAX_SSID_NAME_LEN);
            lines[count][MAX_SSID_NAME_LEN] = '\0';
            count++;
        }
        fclose(rf);
    }

    if (target > count) {
        MY_LOG_INFO(TAG, "Index %d out of range (1-%d)", target, count);
        return 1;
    }

    MY_LOG_INFO(TAG, "Removing SSID %d: %s", target, lines[target - 1]);

    FILE *f = fopen(SSIDS_FILE_PATH, "w");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open ssids.txt for writing");
        return 1;
    }
    for (int i = 0; i < count; i++) {
        if (i == target - 1) continue;
        fprintf(f, "%s\n", lines[i]);
    }
    fclose(f);
    sd_sync();

    MY_LOG_INFO(TAG, "SSID removed. %d SSIDs remaining.", count - 1);
    return 0;
}

// Command: sd_status - Fast SD card presence check (no mount/init)
static int cmd_sd_status(int argc, char **argv)
{
    (void)argc; (void)argv;
    struct stat st;
    if (stat("/sdcard", &st) == 0) {
        MY_LOG_INFO(TAG, "SD_OK");
    } else {
        MY_LOG_INFO(TAG, "SD_NONE");
    }
    return 0;
}

// Command: list_sd - Lists HTML files on SD card
static int cmd_list_sd(int argc, char **argv)
{
    (void)argc; (void)argv;
    
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }
    
    DIR *dir = opendir("/sdcard/lab/htmls");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/htmls directory. Error: %d (%s)", errno, strerror(errno));
        return 1;
    }
    
    sd_html_count = 0;
    struct dirent *entry;
    
    while ((entry = readdir(dir)) != NULL && sd_html_count < MAX_HTML_FILES) {
        // Skip directories and special entries
        if (entry->d_type == DT_DIR) {
            continue;
        }
        
        // Skip macOS metadata files (._filename or _filename in MS-DOS 8.3)
        if (entry->d_name[0] == '.' || entry->d_name[0] == '_') {
            continue;
        }
        
        // Check if file ends with .html or .htm (case insensitive)
        size_t len = strlen(entry->d_name);
        bool is_html = false;
        
        if (len > 5) {
            const char *ext = entry->d_name + len - 5;
            if (strcasecmp(ext, ".html") == 0) {
                is_html = true;
            }
        }
        
        if (!is_html && len > 4) {
            const char *ext = entry->d_name + len - 4;
            if (strcasecmp(ext, ".htm") == 0) {
                is_html = true;
            }
        }
        
        if (is_html) {
            strncpy(sd_html_files[sd_html_count], entry->d_name, MAX_HTML_FILENAME - 1);
            sd_html_files[sd_html_count][MAX_HTML_FILENAME - 1] = '\0';
            sd_html_count++;
        }
    }
    
    closedir(dir);
    
    if (sd_html_count == 0) {
        MY_LOG_INFO(TAG, "No HTML files found on SD card.");
        return 0;
    }
    
    MY_LOG_INFO(TAG, "HTML files found on SD card:");
    for (int i = 0; i < sd_html_count; i++) {
        printf("%d %s\n", i + 1, sd_html_files[i]);
    }
    
    return 0;
}

// Command: show_pass - Prints password log contents from SD card
static int cmd_show_pass(int argc, char **argv)
{
    const char *target = "portal";
    if (argc >= 2 && argv[1] != NULL && argv[1][0] != '\0') {
        target = argv[1];
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }

    const char *path = "/sdcard/lab/portals.txt";
    if (strcasecmp(target, "evil") == 0 || strcasecmp(target, "eviltwin") == 0) {
        path = "/sdcard/lab/eviltwin.txt";
    }

    FILE *file = fopen(path, "r");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "%s not found on SD card.", path);
        return 0;
    }

    char line[128];
    bool has_lines = false;
    while (fgets(line, sizeof(line), file) != NULL) {
        has_lines = true;
        printf("%s", line);
    }
    fclose(file);

    if (!has_lines) {
        MY_LOG_INFO(TAG, "%s is empty.", path);
    }

