Smethan/projectZero/ESP32C5/main/main.c
    return 0;
}

static bool build_sd_path(char *dest, size_t dest_size, const char *input_path)
{
    if (!dest || dest_size == 0 || !input_path || input_path[0] == '\0') {
        return false;
    }

    if (input_path[0] == '/') {
        strncpy(dest, input_path, dest_size - 1);
        dest[dest_size - 1] = '\0';
    } else {
        snprintf(dest, dest_size, "/sdcard/%s", input_path);
    }

    size_t len = strlen(dest);
    while (len > 1 && dest[len - 1] == '/') {
        dest[--len] = '\0';
    }

    return dest[0] != '\0';
}

// Command: list_dir [path] - Lists files inside a directory on SD card
static int cmd_list_dir(int argc, char **argv)
{
    const char *input_path = (argc >= 2) ? argv[1] : "lab/handshakes";
    char full_path[SD_PATH_MAX];

    if (!build_sd_path(full_path, sizeof(full_path), input_path)) {
        MY_LOG_INFO(TAG, "Invalid path provided.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    DIR *dir = opendir(full_path);
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open %s. Error: %d (%s)", full_path, errno, strerror(errno));
        return 1;
    }

    MY_LOG_INFO(TAG, "Files in %s:", full_path);

    struct dirent *entry;
    int file_count = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (entry->d_name[0] == '.' || entry->d_name[0] == '_') {
            continue;
        }
        file_count++;
        printf("%d %s\n", file_count, entry->d_name);
    }

    closedir(dir);

    if (file_count == 0) {
        MY_LOG_INFO(TAG, "No files found in %s", full_path);
    } else {
        MY_LOG_INFO(TAG, "Found %d file(s) in %s", file_count, full_path);
    }

    return 0;
}

// Command: file_delete <path> - Deletes a file on SD card
static int cmd_file_delete(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: file_delete <path>");
        MY_LOG_INFO(TAG, "Example: file_delete lab/handshakes/sample.pcap");
        return 1;
    }

    char full_path[SD_PATH_MAX];
    if (!build_sd_path(full_path, sizeof(full_path), argv[1])) {
        MY_LOG_INFO(TAG, "Invalid path provided.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    struct stat st;
    if (stat(full_path, &st) != 0) {
        MY_LOG_INFO(TAG, "File not found: %s (errno: %d)", full_path, errno);
        return 1;
    }

    if (S_ISDIR(st.st_mode)) {
        MY_LOG_INFO(TAG, "Refusing to delete directory: %s", full_path);
        return 1;
    }

    if (unlink(full_path) != 0) {
        MY_LOG_INFO(TAG, "Failed to delete %s: %s", full_path, strerror(errno));
        return 1;
    }
    sd_sync();

    MY_LOG_INFO(TAG, "Deleted %s", full_path);
    return 0;
}

// Command: select_html [index] - Loads HTML file from SD card
static int cmd_select_html(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: select_html <index>");
        MY_LOG_INFO(TAG, "Run list_sd first to see available HTML files.");
        return 1;
    }
    
    int index = atoi(argv[1]) - 1; // Convert from 1-based to 0-based
    
    if (index < 0 || index >= sd_html_count) {
        MY_LOG_INFO(TAG, "Invalid index. Run list_sd to see available files.");
        return 1;
    }
    
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }
    
    char filepath[128];
    snprintf(filepath, sizeof(filepath), "/sdcard/lab/htmls/%s", sd_html_files[index]);
    
    // Open file and get size
    FILE *f = fopen(filepath, "r");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open file: %s", filepath);
        return 1;
    }
    
    // Get file size
    fseek(f, 0, SEEK_END);
    long fsize = ftell(f);
    fseek(f, 0, SEEK_SET);
    
    if (fsize <= 0 || fsize > 800000) { // Limit to 800KB
        MY_LOG_INFO(TAG, "File size invalid or too large: %ld bytes", fsize);
        fclose(f);
        return 1;
    }
    
    // Free previous custom HTML if exists
    if (custom_portal_html != NULL) {
        free(custom_portal_html);
        custom_portal_html = NULL;
    }
    
    // Allocate memory and read file
    custom_portal_html = (char*)malloc(fsize + 1);
    if (custom_portal_html == NULL) {
        MY_LOG_INFO(TAG, "Failed to allocate memory for HTML file.");
        fclose(f);
        return 1;
    }
    
    size_t bytes_read = fread(custom_portal_html, 1, fsize, f);
    custom_portal_html[bytes_read] = '\0';
    fclose(f);
    
    MY_LOG_INFO(TAG, "Loaded HTML file: %s (%u bytes)", sd_html_files[index], (unsigned int)bytes_read);
    MY_LOG_INFO(TAG, "Portal will now use this custom HTML.");
    
    return 0;
}

// ----------------------------------------------------------------
// Chunked base64 HTML transfer protocol:
//   set_html_begin           — clear buffer, start accumulating
//   set_html <base64_chunk>  — append chunk to accumulator
//   set_html_end             — decode accumulated base64 → custom_portal_html
// ----------------------------------------------------------------

// Command: set_html_begin — initialise the base64 accumulator
static int cmd_set_html_begin(int argc, char **argv)
{
    (void)argc; (void)argv;

    // Free any previous accumulator
    if (html_b64_buf) {
        heap_caps_free(html_b64_buf);
        html_b64_buf = NULL;
    }
    html_b64_len = 0;
    html_b64_cap = HTML_B64_ALLOC;
    // Allocate in PSRAM to avoid DRAM heap fragmentation
    html_b64_buf = (char *)heap_caps_malloc(html_b64_cap, MALLOC_CAP_SPIRAM);
    if (!html_b64_buf) {
        // Fallback to internal RAM if no PSRAM
        html_b64_buf = (char *)malloc(html_b64_cap);
    }
    if (!html_b64_buf) {
        MY_LOG_INFO(TAG, "set_html_begin: malloc failed (%u)", (unsigned)html_b64_cap);
        html_b64_active = false;
        return 1;
    }
    html_b64_buf[0] = '\0';
    html_b64_active = true;
    MY_LOG_INFO(TAG, "set_html_begin: ready to receive base64 chunks (%uKB buffer)",
                (unsigned)(html_b64_cap / 1024));
    return 0;
}

// Command: set_html <data>
// Two modes:
//   1. Chunked base64: call set_html_begin first, then set_html <b64>, then set_html_end
//   2. Inline raw HTML: set_html <html>...</html>  (no set_html_begin needed)
static int cmd_set_html(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: set_html <html_or_base64_chunk>");
        MY_LOG_INFO(TAG, "  Inline:  set_html <html>...</html>");
        MY_LOG_INFO(TAG, "  Chunked: set_html_begin, set_html <b64>, set_html_end");
        return 1;
    }

    // Mode 1: chunked base64 transfer in progress
    if (html_b64_active && html_b64_buf) {
        for (int i = 1; i < argc; i++) {
            size_t frag_len = strlen(argv[i]);
            if (html_b64_len + frag_len + 1 > html_b64_cap) {
                MY_LOG_INFO(TAG, "set_html: buffer full (%u/%u bytes)",
                            (unsigned)html_b64_len, (unsigned)html_b64_cap);
                return 1;
            }
            memcpy(html_b64_buf + html_b64_len, argv[i], frag_len);
            html_b64_len += frag_len;
            html_b64_buf[html_b64_len] = '\0';
        }
        return 0;   // silent success — avoid flooding serial with ACKs
    }

