Smethan/projectZero/ESP32C5/main/main.c
    // Mode 2: inline raw HTML (no set_html_begin needed)
    size_t total_len = 0;
    for (int i = 1; i < argc; i++) {
        total_len += strlen(argv[i]) + 1;
    }

    if (custom_portal_html != NULL) {
        free(custom_portal_html);
        custom_portal_html = NULL;
    }

    custom_portal_html = (char *)malloc(total_len + 1);
    if (custom_portal_html == NULL) {
        MY_LOG_INFO(TAG, "Failed to allocate memory for HTML.");
        return 1;
    }

    custom_portal_html[0] = '\0';
    for (int i = 1; i < argc; i++) {
        strcat(custom_portal_html, argv[i]);
        if (i < argc - 1) {
            strcat(custom_portal_html, " ");
        }
    }

    MY_LOG_INFO(TAG, "Custom HTML set (%u bytes). Portal/Evil Twin/Karma will use this HTML.",
                (unsigned)strlen(custom_portal_html));
    return 0;
}

// Command: set_html_end — decode accumulated base64 and set custom_portal_html
static int cmd_set_html_end(int argc, char **argv)
{
    (void)argc; (void)argv;

    if (!html_b64_active || !html_b64_buf || html_b64_len == 0) {
        MY_LOG_INFO(TAG, "set_html_end: no data received — nothing to decode");
        html_b64_active = false;
        return 1;
    }
    html_b64_active = false;

    MY_LOG_INFO(TAG, "set_html_end: decoding %u base64 bytes...", (unsigned)html_b64_len);

    // Calculate decoded size
    size_t decoded_len = 0;
    int ret = mbedtls_base64_decode(NULL, 0, &decoded_len,
                                     (const unsigned char *)html_b64_buf, html_b64_len);
    // mbedtls returns MBEDTLS_ERR_BASE64_BUFFER_TOO_SMALL when just probing size — that's OK
    if (decoded_len == 0) {
        MY_LOG_INFO(TAG, "set_html_end: base64 decode size probe failed");
        heap_caps_free(html_b64_buf); html_b64_buf = NULL; html_b64_len = 0;
        return 1;
    }
    if (decoded_len > HTML_MAX_DECODED) {
        MY_LOG_INFO(TAG, "set_html_end: HTML too large (%u bytes, max %u)",
                    (unsigned)decoded_len, (unsigned)HTML_MAX_DECODED);
        heap_caps_free(html_b64_buf); html_b64_buf = NULL; html_b64_len = 0;
        return 1;
    }

    // Allocate decoded buffer in PSRAM (+1 for NUL)
    char *decoded = (char *)heap_caps_malloc(decoded_len + 1, MALLOC_CAP_SPIRAM);
    if (!decoded) {
        decoded = (char *)malloc(decoded_len + 1);
    }
    if (!decoded) {
        MY_LOG_INFO(TAG, "set_html_end: malloc failed for decoded HTML (%u bytes)",
                    (unsigned)decoded_len);
        heap_caps_free(html_b64_buf); html_b64_buf = NULL; html_b64_len = 0;
        return 1;
    }

    size_t olen = 0;
    ret = mbedtls_base64_decode((unsigned char *)decoded, decoded_len + 1, &olen,
                                 (const unsigned char *)html_b64_buf, html_b64_len);
    // Free accumulator — no longer needed
    heap_caps_free(html_b64_buf);
    html_b64_buf = NULL;
    html_b64_len = 0;
    html_b64_cap = 0;

    if (ret != 0) {
        MY_LOG_INFO(TAG, "set_html_end: base64 decode error (%d)", ret);
        heap_caps_free(decoded);
        return 1;
    }
    decoded[olen] = '\0';

    // Swap into custom_portal_html (free works for both PSRAM and internal)
    if (custom_portal_html) {
        free(custom_portal_html);
        custom_portal_html = NULL;
    }
    custom_portal_html = decoded;

    MY_LOG_INFO(TAG, "Custom HTML set (%u bytes). Portal/Evil Twin/Karma will use this HTML.",
                (unsigned)olen);
    return 0;
}

static void gps_raw_task(void *pvParameters) {
    (void)pvParameters;

    MY_LOG_INFO(TAG, "GPS raw reader started. Use 'stop' to exit.");

    while (gps_raw_active && !operation_stop_requested) {
        int len = uart_read_bytes(GPS_UART_NUM, (uint8_t *)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(500));
        if (len > 0) {
            wardrive_gps_buffer[len] = '\0';
            char *line = strtok(wardrive_gps_buffer, "\r\n");
            while (line != NULL) {
                MY_LOG_INFO(TAG, "[GPS RAW] %s", line);
                line = strtok(NULL, "\r\n");
            }
        }
    }

    gps_raw_active = false;
    operation_stop_requested = false;
    gps_raw_task_handle = NULL;
    MY_LOG_INFO(TAG, "GPS raw reader stopped.");
    vTaskDelete(NULL);
}

static int cmd_gps_set(int argc, char **argv) {
    if (argc < 2 || argv[1] == NULL) {
        printf("[GPSCFG] module=%s\n", gps_get_module_name(current_gps_module));
        printf("[GPSCFG] baud=%d\n", gps_get_baud_for_module(current_gps_module));
        printf("[GPSCFG] external=%s\n", gps_module_uses_external_feed(current_gps_module) ? "yes" : "no");
        printf("[GPSCFG] position_command=%s\n", gps_external_position_command_name(current_gps_module));
        printf("[GPSCFG] END\n");
        MY_LOG_INFO(TAG, "Current GPS module: %s (baud %d)",
                    gps_get_module_name(current_gps_module),
                    gps_get_baud_for_module(current_gps_module));
        return 0;
    }

    gps_module_t selected = current_gps_module;
    if (strcasecmp(argv[1], "m5") == 0 || strcasecmp(argv[1], "m5stack") == 0 || strcasecmp(argv[1], "m5stackgps1.1") == 0 || strcasecmp(argv[1], "m5stackgpsv11") == 0) {
        selected = GPS_MODULE_M5STACK_GPS_V11;
    } else if (strcasecmp(argv[1], "atgm") == 0 || strcasecmp(argv[1], "atgm336h") == 0) {
        selected = GPS_MODULE_ATGM336H;
    } else if (strcasecmp(argv[1], "external") == 0 || strcasecmp(argv[1], "ext") == 0 ||
               strcasecmp(argv[1], "usb") == 0 || strcasecmp(argv[1], "tab") == 0 ||
               strcasecmp(argv[1], "tab5") == 0) {
        selected = GPS_MODULE_EXTERNAL;
    } else if (strcasecmp(argv[1], "cap") == 0 || strcasecmp(argv[1], "external_cap") == 0 ||
               strcasecmp(argv[1], "lora_cap") == 0 || strcasecmp(argv[1], "adv_cap") == 0) {
        selected = GPS_MODULE_EXTERNAL_CAP;
    } else {
        MY_LOG_INFO(TAG, "Unknown module '%s'. Use 'm5', 'atgm', 'external' (usb alias) or 'cap'.", argv[1]);
        return 1;
    }

    current_gps_module = selected;
    if (gps_module_uses_external_feed(current_gps_module)) {
        gps_sync_from_selected_external_source();
    }
    gps_save_state_to_nvs();
    printf("[GPSCFG] module=%s\n", gps_get_module_name(current_gps_module));
    printf("[GPSCFG] baud=%d\n", gps_get_baud_for_module(current_gps_module));
    printf("[GPSCFG] external=%s\n", gps_module_uses_external_feed(current_gps_module) ? "yes" : "no");
    printf("[GPSCFG] position_command=%s\n", gps_external_position_command_name(current_gps_module));
    printf("[GPSCFG] END\n");
    MY_LOG_INFO(TAG, "GPS module set to %s (baud %d). Restart GPS tasks if running.",
                gps_get_module_name(current_gps_module),
                gps_get_baud_for_module(current_gps_module));
    return 0;
}

static int cmd_set_gps_position(int argc, char **argv) {
    if (argc == 1) {
        external_gps_position.valid = false;
        if (current_gps_module == GPS_MODULE_EXTERNAL) {
            gps_sync_from_selected_external_source();
        }
        oled_display_update_full("> GPS External", "  Fix cleared", "", "  No fix");
        MY_LOG_INFO(TAG, "External GPS fix cleared (no fix).");
        return 0;
    }

