Smethan/projectZero/ESP32C5/main/main.c
    if (argc < 3 || argc > 5 || argv[1] == NULL || argv[2] == NULL) {
        MY_LOG_INFO(TAG, "Usage: set_gps_position <lat> <lon> [alt] [acc]");
        MY_LOG_INFO(TAG, "Usage: set_gps_position   (no args = lost fix)");
        return 1;
    }

    char *endptr = NULL;
    float lat = strtof(argv[1], &endptr);
    if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || !isfinite(lat)) {
        MY_LOG_INFO(TAG, "Invalid latitude: '%s'", argv[1]);
        return 1;
    }

    endptr = NULL;
    float lon = strtof(argv[2], &endptr);
    if (endptr == argv[2] || (endptr != NULL && *endptr != '\0') || !isfinite(lon)) {
        MY_LOG_INFO(TAG, "Invalid longitude: '%s'", argv[2]);
        return 1;
    }

    if (lat < -90.0f || lat > 90.0f) {
        MY_LOG_INFO(TAG, "Latitude out of range (-90..90): %.7f", lat);
        return 1;
    }
    if (lon < -180.0f || lon > 180.0f) {
        MY_LOG_INFO(TAG, "Longitude out of range (-180..180): %.7f", lon);
        return 1;
    }

    float alt = external_gps_position.altitude;
    float acc = (external_gps_position.accuracy > 0.0f) ? external_gps_position.accuracy : 5.0f;

    if (argc >= 4 && argv[3] != NULL) {
        endptr = NULL;
        alt = strtof(argv[3], &endptr);
        if (endptr == argv[3] || (endptr != NULL && *endptr != '\0') || !isfinite(alt)) {
            MY_LOG_INFO(TAG, "Invalid altitude: '%s'", argv[3]);
            return 1;
        }
    }

    if (argc >= 5 && argv[4] != NULL) {
        endptr = NULL;
        acc = strtof(argv[4], &endptr);
        if (endptr == argv[4] || (endptr != NULL && *endptr != '\0') || !isfinite(acc) || acc < 0.0f) {
            MY_LOG_INFO(TAG, "Invalid accuracy: '%s' (must be >= 0)", argv[4]);
            return 1;
        }
    }

    external_gps_position.latitude = lat;
    external_gps_position.longitude = lon;
    external_gps_position.altitude = alt;
    external_gps_position.accuracy = acc;
    external_gps_position.valid = true;

    if (current_gps_module == GPS_MODULE_EXTERNAL) {
        gps_sync_from_selected_external_source();
    }

    MY_LOG_INFO(TAG, "External GPS updated: Lat=%.7f Lon=%.7f Alt=%.2fm Acc=%.2fm",
                external_gps_position.latitude, external_gps_position.longitude,
                external_gps_position.altitude, external_gps_position.accuracy);

    {
        char oled_lat[20], oled_lon[20];
        snprintf(oled_lat, sizeof(oled_lat), "  Lat %.4f", lat);
        snprintf(oled_lon, sizeof(oled_lon), "  Lon %.4f", lon);
        oled_display_update_full("> GPS External", oled_lat, oled_lon, "  Fix set");
    }

    if (current_gps_module != GPS_MODULE_EXTERNAL) {
        MY_LOG_INFO(TAG, "Note: current module is %s. Run 'gps_set external' to use this feed in wardrive.",
                    gps_get_module_name(current_gps_module));
    }
    return 0;
}

static int cmd_set_gps_position_cap(int argc, char **argv) {
    if (argc == 1) {
        external_cap_gps_position.valid = false;
        if (gps_module_uses_external_cap_feed(current_gps_module)) {
            gps_sync_from_selected_external_source();
        }
        oled_display_update_full("> GPS CAP Feed", "  Fix cleared", "", "  No fix");
        MY_LOG_INFO(TAG, "External CAP GPS fix cleared (no fix).");
        return 0;
    }

    if (argc < 3 || argc > 5 || argv[1] == NULL || argv[2] == NULL) {
        MY_LOG_INFO(TAG, "Usage: set_gps_position_cap <lat> <lon> [alt] [acc]");
        MY_LOG_INFO(TAG, "Usage: set_gps_position_cap   (no args = lost fix)");
        return 1;
    }

    char *endptr = NULL;
    float lat = strtof(argv[1], &endptr);
    if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || !isfinite(lat)) {
        MY_LOG_INFO(TAG, "Invalid latitude: '%s'", argv[1]);
        return 1;
    }

    endptr = NULL;
    float lon = strtof(argv[2], &endptr);
    if (endptr == argv[2] || (endptr != NULL && *endptr != '\0') || !isfinite(lon)) {
        MY_LOG_INFO(TAG, "Invalid longitude: '%s'", argv[2]);
        return 1;
    }

    if (lat < -90.0f || lat > 90.0f) {
        MY_LOG_INFO(TAG, "Latitude out of range (-90..90): %.7f", lat);
        return 1;
    }
    if (lon < -180.0f || lon > 180.0f) {
        MY_LOG_INFO(TAG, "Longitude out of range (-180..180): %.7f", lon);
        return 1;
    }

    float alt = external_cap_gps_position.altitude;
    float acc = (external_cap_gps_position.accuracy > 0.0f) ? external_cap_gps_position.accuracy : 5.0f;

    if (argc >= 4 && argv[3] != NULL) {
        endptr = NULL;
        alt = strtof(argv[3], &endptr);
        if (endptr == argv[3] || (endptr != NULL && *endptr != '\0') || !isfinite(alt)) {
            MY_LOG_INFO(TAG, "Invalid altitude: '%s'", argv[3]);
            return 1;
        }
    }

    if (argc >= 5 && argv[4] != NULL) {
        endptr = NULL;
        acc = strtof(argv[4], &endptr);
        if (endptr == argv[4] || (endptr != NULL && *endptr != '\0') || !isfinite(acc) || acc < 0.0f) {
            MY_LOG_INFO(TAG, "Invalid accuracy: '%s' (must be >= 0)", argv[4]);
            return 1;
        }
    }

    external_cap_gps_position.latitude = lat;
    external_cap_gps_position.longitude = lon;
    external_cap_gps_position.altitude = alt;
    external_cap_gps_position.accuracy = acc;
    external_cap_gps_position.valid = true;

    if (gps_module_uses_external_cap_feed(current_gps_module)) {
        gps_sync_from_selected_external_source();
    }

    MY_LOG_INFO(TAG, "External CAP GPS updated: Lat=%.7f Lon=%.7f Alt=%.2fm Acc=%.2fm",
                external_cap_gps_position.latitude, external_cap_gps_position.longitude,
                external_cap_gps_position.altitude, external_cap_gps_position.accuracy);

    {
        char oled_lat[20], oled_lon[20];
        snprintf(oled_lat, sizeof(oled_lat), "  Lat %.4f", external_cap_gps_position.latitude);
        snprintf(oled_lon, sizeof(oled_lon), "  Lon %.4f", external_cap_gps_position.longitude);
        oled_display_update_full("> GPS CAP Feed", oled_lat, oled_lon, "  Fix set");
    }

    if (!gps_module_uses_external_cap_feed(current_gps_module)) {
        MY_LOG_INFO(TAG, "Note: current module is %s. Run 'gps_set cap' to use this feed in wardrive.",
                    gps_get_module_name(current_gps_module));
    }
    return 0;
}

// Wardrive task function (runs in background)
static void wardrive_task(void *pvParameters) {
    (void)pvParameters;
    
