Smethan/projectZero/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Wardrive task started.");
    
    // Set LED to indicate wardrive mode
    esp_err_t led_err = led_set_color(0, 255, 255); // Cyan
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for wardrive: %s", esp_err_to_name(led_err));
    }
    
    // Find the next file number by scanning existing files
    wardrive_file_counter = find_next_wardrive_file_number();
    MY_LOG_INFO(TAG, "Next wardrive file will be: w%d.log", wardrive_file_counter);
    
    // Wait for GPS fix before starting
    MY_LOG_INFO(TAG, "Waiting for GPS fix...");
    oled_display_update_full("> Wardrive", "  Waiting GPS...", "  Fix needed", "");
    if (!wait_for_gps_fix(120)) {  // Wait up to 120 seconds for GPS fix
        MY_LOG_INFO(TAG, "Warning: No GPS fix obtained, not continuing without GPS data - please ensure clear view of the sky and try again.");
        oled_display_update_full("> Wardrive", "  No GPS fix!", "  Stopping...", "");
        operation_stop_requested = true;
    } else {
        MY_LOG_INFO(TAG, "GPS fix obtained: Lat=%.7f Lon=%.7f", 
                   current_gps.latitude, current_gps.longitude);
        oled_display_update_full("> Wardrive", "  GPS fix OK!", "  Starting scans", "");
    }
    
    MY_LOG_INFO(TAG, "Wardrive started. Use 'stop' command to stop.");
    
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    // Main wardrive loop (runs until user stops)
    int scan_counter = 0;
    while (wardrive_active && !operation_stop_requested) {
        // Check for stop request at the beginning of loop
        if (operation_stop_requested || !wardrive_active) {
            MY_LOG_INFO(TAG, "Wardrive: Stop requested, terminating...");
            operation_stop_requested = false;
            wardrive_active = false;
            break;
        }
        // Read GPS from selected source or pause if external fix is lost.
        if (external_feed) {
            gps_sync_from_selected_external_source();
            if (!current_gps.valid) {
                MY_LOG_INFO(TAG, "GPS fix lost! Pausing wardrive...");
                oled_display_update_full("> Wardrive", "  GPS fix lost!", "  Pausing...", "");
                while (!current_gps.valid && wardrive_active && !operation_stop_requested) {
                    gps_sync_from_selected_external_source();
                    vTaskDelay(pdMS_TO_TICKS(200));
                }
                if (operation_stop_requested || !wardrive_active) {
                    break;
                }
                MY_LOG_INFO(TAG, "GPS fix recovered: Lat=%.7f Lon=%.7f. Resuming wardrive.",
                            current_gps.latitude, current_gps.longitude);
                oled_display_update_full("> Wardrive", "  GPS recovered!", "  Resuming...", "");
            }
        } else {
            int len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(100));
            if (len > 0) {
                wardrive_gps_buffer[len] = '\0';
                char* line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) {
                    if (parse_gps_nmea(line)) {
                        MY_LOG_INFO(TAG, "GPS: Lat=%.7f Lon=%.7f Alt=%.1fm Acc=%.1fm",
                                   current_gps.latitude, current_gps.longitude,
                                   current_gps.altitude, current_gps.accuracy);
                    }
                    line = strtok(NULL, "\r\n");
                }
            }
        }

        float gps_lat = current_gps.latitude;
        float gps_lon = current_gps.longitude;
        float gps_alt = current_gps.altitude;
        float gps_acc = current_gps.accuracy;
        bool gps_valid_for_cycle = current_gps.valid;
        
        // Scan WiFi networks
        wifi_scan_config_t scan_cfg = {
            .ssid = NULL,
            .bssid = NULL,
            .channel = 0,
            .show_hidden = true,
            .scan_type = WIFI_SCAN_TYPE_ACTIVE,
            .scan_time.active.min = 120,
            .scan_time.active.max = 700,
        };
        
        // Perform blocking scan to ensure results are ready before logging
        if (operation_stop_requested) {
            break;
        }
        esp_err_t scan_err = esp_wifi_scan_start(&scan_cfg, true);
        if (scan_err != ESP_OK) {
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }
        
        // If driver reported failure or no results, try a blocking fallback scan
        uint16_t scan_count = 0;
        esp_wifi_scan_get_ap_num(&scan_count);
        if ((scan_count == 0) || (g_last_scan_status != 0)) {
            wifi_scan_config_t fb_cfg = scan_cfg;
            fb_cfg.scan_time.active.min = 120;
            fb_cfg.scan_time.active.max = 700;
            esp_err_t fb = esp_wifi_scan_start(&fb_cfg, true); // blocking
            if (fb != ESP_OK) {
                continue;
            }
            scan_count = MAX_AP_CNT;
            esp_wifi_scan_get_ap_records(&scan_count, wardrive_scan_results);
        } else {
            scan_count = MAX_AP_CNT;
            esp_wifi_scan_get_ap_records(&scan_count, wardrive_scan_results);
        }

        // If still no records, fall back to the buffer populated by the event handler
        if (scan_count == 0 && g_scan_count > 0) {
            if (g_scan_count > MAX_AP_CNT) {
                scan_count = MAX_AP_CNT;
            } else {
                scan_count = g_scan_count;
            }
            memcpy(wardrive_scan_results, g_scan_results, scan_count * sizeof(wifi_ap_record_t));
        }

        MY_LOG_INFO(TAG, "Wardrive: scan_count=%u (status=%" PRIu32 ")", scan_count, g_last_scan_status);
        
        // Create filename (keep it simple for FAT filesystem)
        char filename[64];
        snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d.log", wardrive_file_counter);
        
        // Check if /sdcard/lab/wardrives directory is accessible
        struct stat st;
        if (stat("/sdcard/lab/wardrives", &st) != 0) {
            MY_LOG_INFO(TAG, "Error: /sdcard/lab/wardrives directory not accessible");
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        
        // Open file for appending
        FILE *file = fopen(filename, "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to open file %s, errno: %d (%s)", filename, errno, strerror(errno));
            
