Smethan/projectZero/ESP32C5/main/main.c
            // Try creating file with different approach
            file = fopen(filename, "w");
            if (file == NULL) {
                MY_LOG_INFO(TAG, "Failed to create file %s, errno: %d (%s)", filename, errno, strerror(errno));
                vTaskDelay(pdMS_TO_TICKS(1000));
                continue;
            }
            MY_LOG_INFO(TAG, "Successfully created file %s", filename);
        }
        
        // Write header if file is new
        fseek(file, 0, SEEK_END);
        if (ftell(file) == 0) {
            fprintf(file, "WigleWifi-1.6,appRelease=v1.1,model=Gen4,release=v1.0,device=Gen4Board,display=SPI TFT,board=ESP32C5,brand=Laboratorium\n");
            fprintf(file, "MAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type\n");
        }
        
        // Get timestamp
        char timestamp[32];
        get_timestamp_string(timestamp, sizeof(timestamp));
        
        // Process scan results
        for (int i = 0; i < scan_count; i++) {
            wifi_ap_record_t *ap = &wardrive_scan_results[i];
            
            // Format MAC address
            char mac_str[18];
            snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                    ap->bssid[0], ap->bssid[1], ap->bssid[2],
                    ap->bssid[3], ap->bssid[4], ap->bssid[5]);
            
            // Escape SSID for CSV
            char escaped_ssid[64];
            escape_csv_field((const char*)ap->ssid, escaped_ssid, sizeof(escaped_ssid));
            
            // Get auth mode string
            const char* auth_mode = get_auth_mode_wiggle(ap->authmode);
            int wifi_freq_mhz = wigle_wifi_channel_to_frequency_mhz(ap->primary);
            
            // Format line for Wiggle format
            char line[512];
            if (gps_valid_for_cycle) {
                snprintf(line, sizeof(line), 
                        "%s,%s,[%s],%s,%d,%d,%d,%.7f,%.7f,%.2f,%.2f,,,WIFI\n",
                        mac_str, escaped_ssid, auth_mode, timestamp,
                        ap->primary, wifi_freq_mhz, ap->rssi,
                        gps_lat, gps_lon, gps_alt, gps_acc);
            } else {
                snprintf(line, sizeof(line), 
                        "%s,%s,[%s],%s,%d,%d,%d,0.0000000,0.0000000,0.00,0.00,,,WIFI\n",
                        mac_str, escaped_ssid, auth_mode, timestamp,
                        ap->primary, wifi_freq_mhz, ap->rssi);
            }
            
            // Write to file and print to UART
            fprintf(file, "%s", line);
            printf("%s", line);
        }
        
        // Close file to ensure data is written
        fclose(file);
        sd_sync();
        
        if (scan_count > 0) {
            MY_LOG_INFO(TAG, "Logged %d networks to %s", scan_count, filename);
        }
        
        scan_counter++;
        
        {
            char wd_l2[64], wd_l3[64], wd_l4[64];
            snprintf(wd_l2, sizeof(wd_l2), "  Scan #%d", scan_counter);
            snprintf(wd_l3, sizeof(wd_l3), "  %d nets logged", scan_count);
            snprintf(wd_l4, sizeof(wd_l4), "  w%d.log", wardrive_file_counter);
            oled_display_update_full("> Wardrive", wd_l2, wd_l3, wd_l4);
        }
        
        // Check for stop command
        if (operation_stop_requested || !wardrive_active) {
            MY_LOG_INFO(TAG, "Wardrive: Stop requested, terminating...");
            wardrive_active = false;
            operation_stop_requested = false;
            break;
        }
        
        // Yield to allow console processing
        taskYIELD();
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Wait 5 seconds between scans
    }
    
    // Clear LED after wardrive finishes
    led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after wardrive: %s", esp_err_to_name(led_err));
    }
    
    wardrive_active = false;
    wardrive_task_handle = NULL;
    MY_LOG_INFO(TAG, "Wardrive stopped after %d scans. Last file: w%d.log", scan_counter, wardrive_file_counter);
    
    vTaskDelete(NULL); // Delete this task
}

static int cmd_start_gps_raw(int argc, char **argv) {
    {
        const char *mod = gps_get_module_name(current_gps_module);
        oled_display_update_full("> GPS Raw", "  NMEA output", mod, "  Streaming...");
    }
    log_memory_info("start_gps_raw");

    if (gps_module_uses_external_feed(current_gps_module)) {
        MY_LOG_INFO(TAG, "start_gps_raw is unavailable in external GPS modes. Use '%s' instead.",
                    gps_external_position_command_name(current_gps_module));
        return 1;
    }

    int baud = gps_get_baud_for_module(current_gps_module);
    if (argc >= 2 && argv[1] != NULL) {
        char *endptr = NULL;
        long val = strtol(argv[1], &endptr, 10);
        if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || val <= 0) {
            MY_LOG_INFO(TAG, "Invalid baud rate '%s'. Use numeric value, e.g. 9600 or 115200.", argv[1]);
            return 1;
        }
        baud = (int)val;
    }

    if (gps_raw_active || gps_raw_task_handle != NULL) {
        MY_LOG_INFO(TAG, "GPS raw reader already running. Use 'stop' to stop it first.");
        return 1;
    }

    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start GPS raw while wardrive is active. Use 'stop' to stop wardrive first.");
        return 1;
    }

    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;

    esp_err_t ret = init_gps_uart(baud);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize GPS UART: %s", esp_err_to_name(ret));
        return 1;
    }

    gps_raw_active = true;
    BaseType_t result = xTaskCreate(
        gps_raw_task,
        "gps_raw_task",
        4096,
        NULL,
        4,
        &gps_raw_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create GPS raw task!");
        gps_raw_active = false;
        gps_raw_task_handle = NULL;
        return 1;
    }

    MY_LOG_INFO(TAG, "GPS raw reader started at %d baud (%s). Use 'stop' to stop.",
                baud,
                gps_get_module_name(current_gps_module));
    return 0;
}

static int cmd_start_wardrive(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Wardrive", "  GPS + WiFi", "  Logging to SD", "  Active...");
    log_memory_info("start_wardrive");
    
