Smethan/projectZero/ESP32C5/main/main.c
    return 0;
}

// ============================================================================
// BLE Scanner Functions (NimBLE)
// ============================================================================

/**
 * Check if BLE device was already found (for deduplication)
 */
static bool bt_is_device_found(const uint8_t *addr)
{
    for (int i = 0; i < bt_found_device_count; i++) {
        if (memcmp(bt_found_devices[i], addr, 6) == 0) {
            return true;
        }
    }
    return false;
}

/**
 * Find device index by MAC address in bt_devices array
 * Returns -1 if not found
 */
static int bt_find_device_index(const uint8_t *addr)
{
    for (int i = 0; i < bt_device_count; i++) {
        if (memcmp(bt_devices[i].addr, addr, 6) == 0) {
            return i;
        }
    }
    return -1;
}

static bool bt_grow_storage_if_needed(int required_count)
{
    if (required_count <= bt_device_capacity && required_count <= bt_found_device_capacity) {
        return true;
    }

    int new_capacity = bt_device_capacity > bt_found_device_capacity ? bt_device_capacity : bt_found_device_capacity;
    if (new_capacity <= 0) {
        new_capacity = BT_INITIAL_CAPACITY;
    }
    while (new_capacity < required_count) {
        new_capacity *= 2;
    }

    uint8_t (*new_found_devices)[6] = heap_caps_calloc(new_capacity, sizeof(*bt_found_devices), MALLOC_CAP_SPIRAM);
    if (!new_found_devices) {
        MY_LOG_INFO(TAG, "Failed to grow BLE dedup buffer to %d entries", new_capacity);
        return false;
    }

    bt_device_info_t *new_bt_devices = heap_caps_calloc(new_capacity, sizeof(bt_device_info_t), MALLOC_CAP_SPIRAM);
    if (!new_bt_devices) {
        free(new_found_devices);
        MY_LOG_INFO(TAG, "Failed to grow BLE device buffer to %d entries", new_capacity);
        return false;
    }

    if (bt_found_devices && bt_found_device_count > 0) {
        memcpy(new_found_devices, bt_found_devices,
               (size_t)bt_found_device_count * sizeof(*bt_found_devices));
    }
    if (bt_devices && bt_device_count > 0) {
        memcpy(new_bt_devices, bt_devices,
               (size_t)bt_device_count * sizeof(bt_device_info_t));
    }

    free(bt_found_devices);
    free(bt_devices);
    bt_found_devices = new_found_devices;
    bt_devices = new_bt_devices;
    bt_found_device_capacity = new_capacity;
    bt_device_capacity = new_capacity;
    MY_LOG_INFO(TAG, "BLE device buffers grown to %d entries", new_capacity);
    return true;
}

/**
 * Add BLE device to found list
 */
static bool bt_add_found_device(const uint8_t *addr)
{
    if (!bt_grow_storage_if_needed(bt_found_device_count + 1)) {
        return false;
    }
    memcpy(bt_found_devices[bt_found_device_count], addr, 6);
    bt_found_device_count++;
    return true;
}

/**
 * Reset BLE scan counters
 */
static void bt_reset_counters(void)
{
    bt_airtag_count = 0;
    bt_smarttag_count = 0;
    bt_found_device_count = 0;
    bt_device_count = 0;
    if (bt_found_devices && bt_found_device_capacity > 0) {
        memset(bt_found_devices, 0, (size_t)bt_found_device_capacity * sizeof(*bt_found_devices));
    }
    if (bt_devices && bt_device_capacity > 0) {
        memset(bt_devices, 0, (size_t)bt_device_capacity * sizeof(bt_device_info_t));
    }
}

/**
 * Format BLE MAC address to string
 */
static void bt_format_addr(const uint8_t *addr, char *str)
{
    sprintf(str, "%02X:%02X:%02X:%02X:%02X:%02X",
            addr[5], addr[4], addr[3], addr[2], addr[1], addr[0]);
}

static int wigle_wifi_channel_to_frequency_mhz(int channel)
{
    if (channel == 14) {
        return 2484;
    }
    if (channel >= 1 && channel <= 13) {
        return 2407 + (channel * 5);
    }
    if (channel >= 32 && channel <= 177) {
        return 5000 + (channel * 5);
    }
    return 0;
}

static double gps_distance_meters(double lat1, double lon1, double lat2, double lon2)
{
    const double earth_radius_m = 6371000.0;
    const double deg_to_rad = 0.017453292519943295;
    double dlat = (lat2 - lat1) * deg_to_rad;
    double dlon = (lon2 - lon1) * deg_to_rad;
    double a_lat1 = lat1 * deg_to_rad;
    double a_lat2 = lat2 * deg_to_rad;
    double sin_dlat = sin(dlat / 2.0);
    double sin_dlon = sin(dlon / 2.0);
    double a = sin_dlat * sin_dlat +
               cos(a_lat1) * cos(a_lat2) * sin_dlon * sin_dlon;
    double c = 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
    return earth_radius_m * c;
}

static bool wardrive_trace_init_file(const char *path)
{
    FILE *file = fopen(path, "w");
    if (!file) {
        return false;
    }

    fprintf(file, "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n");
    fprintf(file, "<kml xmlns=\"http://www.opengis.net/kml/2.2\">\n");
    fprintf(file, "<Document>\n");
    fprintf(file, "  <name>Wardrive Promisc Trace</name>\n");
    fprintf(file, "  <Style id=\"traceLine\">\n");
    fprintf(file, "    <LineStyle><color>ff00ffff</color><width>4</width></LineStyle>\n");
    fprintf(file, "  </Style>\n");
    fprintf(file, "  <Placemark>\n");
    fprintf(file, "    <name>Wardrive Trace</name>\n");
    fprintf(file, "    <styleUrl>#traceLine</styleUrl>\n");
    fprintf(file, "    <LineString>\n");
    fprintf(file, "      <tessellate>1</tessellate>\n");
    fprintf(file, "      <coordinates>\n");
    fclose(file);
    return true;
}

static bool wardrive_trace_append_point(const char *path, double lat, double lon, double alt)
{
    FILE *file = fopen(path, "a");
    if (!file) {
        return false;
    }
    fprintf(file, "        %.7f,%.7f,%.2f\n", lon, lat, alt);
    fclose(file);
    return true;
}

static void wardrive_trace_finalize_file(const char *path)
{
    FILE *file = fopen(path, "a");
    if (!file) {
        return;
    }
    fprintf(file, "      </coordinates>\n");
    fprintf(file, "    </LineString>\n");
    fprintf(file, "  </Placemark>\n");
    fprintf(file, "</Document>\n");
    fprintf(file, "</kml>\n");
    fclose(file);
}

/**
 * Parse MAC address string to bytes (format: XX:XX:XX:XX:XX:XX)
 * Returns true if parsing successful
 */
static bool bt_parse_mac(const char *str, uint8_t *mac)
{
    unsigned int values[6];
    if (sscanf(str, "%02X:%02X:%02X:%02X:%02X:%02X",
               &values[0], &values[1], &values[2],
               &values[3], &values[4], &values[5]) != 6) {
        // Try lowercase
        if (sscanf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
                   &values[0], &values[1], &values[2],
                   &values[3], &values[4], &values[5]) != 6) {
            return false;
        }
    }
    
    // Store in reverse order (BLE format)
    for (int i = 0; i < 6; i++) {
        mac[5 - i] = (uint8_t)values[i];
    }
    
