Smethan/projectZero/ESP32C5/main/main.c
    // Add to found devices list
    if (!bt_add_found_device(desc->addr.val)) {
        return 0;
    }
    
    // Store device info
    if (!bt_grow_storage_if_needed(bt_device_count + 1)) {
        return 0;
    }
    bt_device_info_t *dev = &bt_devices[bt_device_count];
    memcpy(dev->addr, desc->addr.val, 6);
    dev->rssi = desc->rssi;
    dev->name[0] = '\0';
    dev->company_id = 0;
    dev->is_airtag = false;
    dev->is_smarttag = false;
    dev->needs_log = true;          // pending first write to SD
    dev->last_logged_valid = false;
    dev->as_first_us = esp_timer_get_time();
    dev->as_last_us = dev->as_first_us;
    dev->as_has_origin = false;
    dev->as_max_dist_m = 0.0;
    dev->as_alerted = false;
    if (antisurv_active && current_gps.valid) {
        dev->as_origin_lat = current_gps.latitude;
        dev->as_origin_lon = current_gps.longitude;
        dev->as_has_origin = true;
    }
    
    // Extract device name if available (standard AD field)
    bool has_name = (fields.name != NULL && fields.name_len > 0);
    if (has_name) {
        int name_len = fields.name_len < 31 ? fields.name_len : 31;
        memcpy(dev->name, fields.name, name_len);
        dev->name[name_len] = '\0';
    }
    
    // Check for AirTag using raw payload (Marauder method)
    if (bt_is_airtag_payload(desc->data, desc->length_data)) {
        dev->is_airtag = true;
        bt_airtag_count++;
    }
    
    // Check manufacturer data for SmartTag and company ID
    if (fields.mfg_data != NULL && fields.mfg_data_len >= 2) {
        dev->company_id = fields.mfg_data[0] | (fields.mfg_data[1] << 8);
        
        if (!dev->is_airtag && bt_is_samsung_smarttag(fields.mfg_data, fields.mfg_data_len)) {
            dev->is_smarttag = true;
            bt_smarttag_count++;
        }
    }
    
    bt_device_count++;
    
    return 0;
}

/**
 * Start BLE scanning - full duty cycle (for dedicated BT scan commands)
 */
static int bt_start_scan(void)
{
    struct ble_gap_disc_params scan_params = {
        .itvl = 0x60,             // 60ms interval (0x60 * 0.625ms)
        .window = 0x60,           // 60ms window = continuous listening
        .filter_policy = BLE_HCI_SCAN_FILT_NO_WL,
        .limited = 0,
        .passive = 0,             // ACTIVE scan - critical for Scan Response names
        .filter_duplicates = 0,   // We handle duplicates ourselves
    };

    int rc = ble_gap_disc(BLE_OWN_ADDR_PUBLIC, BLE_HS_FOREVER, &scan_params,
                          bt_gap_event_callback, NULL);
    return rc;
}

/**
 * Start BLE scanning with reduced duty cycle for WiFi coexistence.
 * Uses ~25% duty cycle (40ms window / 160ms interval) so the shared
 * ESP32-C5 radio spends most of its time on WiFi promiscuous capture.
 */
static int bt_start_scan_coex(void)
{
    struct ble_gap_disc_params scan_params = {
        .itvl = 0x100,            // 160ms interval (0x100 * 0.625ms)
        .window = 0x40,           // 40ms window  -> ~25% duty cycle
        .filter_policy = BLE_HCI_SCAN_FILT_NO_WL,
        .limited = 0,
        .passive = 0,
        .filter_duplicates = 0,
    };

    int rc = ble_gap_disc(BLE_OWN_ADDR_PUBLIC, BLE_HS_FOREVER, &scan_params,
                          bt_gap_event_callback, NULL);
    return rc;
}

/**
 * Stop BLE scanning
 */
static void bt_stop_scan(void)
{
    ble_gap_disc_cancel();
}

/**
 * NimBLE host sync callback
 */
static void bt_on_sync(void)
{
    ESP_LOGI(TAG, "BLE Host synchronized");
    nimble_initialized = true;
}

/**
 * NimBLE host reset callback
 */
static void bt_on_reset(int reason)
{
    ESP_LOGE(TAG, "BLE Host reset, reason: %d", reason);
    nimble_initialized = false;
}

/**
 * NimBLE host task
 */
static void nimble_host_task(void *param)
{
    ESP_LOGI(TAG, "NimBLE host task started");
    nimble_port_run();
    nimble_port_freertos_deinit();
}

/**
 * Initialize NimBLE stack (called once)
 */
static esp_err_t bt_nimble_init(void)
{
    if (nimble_initialized) {
        return ESP_OK;
    }
    
    esp_err_t ret = nimble_port_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "NimBLE port init failed: %d", ret);
        return ret;
    }
    
    // Configure BLE host callbacks
    ble_hs_cfg.sync_cb = bt_on_sync;
    ble_hs_cfg.reset_cb = bt_on_reset;

    // Initialize GAP and GATT service
    ble_svc_gap_init();
    ble_svc_gatt_init();

    // Start NimBLE host task
    nimble_port_freertos_init(nimble_host_task);
    
    // Wait for sync (max 3 seconds)
    for (int i = 0; i < 30 && !nimble_initialized; i++) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    if (!nimble_initialized) {
        ESP_LOGE(TAG, "NimBLE failed to sync");
        return ESP_FAIL;
    }
    
    return ESP_OK;
}

/**
 * Deinitialize NimBLE stack
 */
static void bt_nimble_deinit(void)
{
    if (!nimble_initialized) {
        return;
    }
    
    // Stop any active scanning
    bt_scan_active = false;
    bt_airtag_scan_active = false;
    bt_stop_scan();
    
    // Wait for scan task to finish
    if (bt_scan_task_handle != NULL) {
        for (int i = 0; i < 20 && bt_scan_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(100));
        }
    }
    
    // Stop NimBLE host task
    nimble_port_stop();
    vTaskDelay(pdMS_TO_TICKS(100));
    
    // Deinitialize NimBLE port and controller (required for reinit)
    nimble_port_deinit();
    
    nimble_initialized = false;
    MY_LOG_INFO(TAG, "NimBLE stopped");
}

/**
 * Stop BLE scanner (called from cmd_stop)
 */
static void bt_scan_stop(void)
{
    if (!bt_scan_active && !bt_airtag_scan_active && bt_scan_task_handle == NULL) {
        return;
    }
    
    bt_scan_active = false;
    bt_airtag_scan_active = false;
    bt_stop_scan();
    
    // Wait for task to finish
    for (int i = 0; i < 40 && bt_scan_task_handle != NULL; i++) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    
    if (bt_scan_task_handle != NULL) {
        vTaskDelete(bt_scan_task_handle);
        bt_scan_task_handle = NULL;
    }
    
    MY_LOG_INFO(TAG, "BLE scanner stopped.");
}

/**
 * Task for one-time BLE scan (scan_bt command)
 */
static void bt_scan_task(void *pvParameters)
{
    bt_reset_counters();
    
    MY_LOG_INFO(TAG, "BLE scan starting (10 seconds)...");
    
    int rc = bt_start_scan();
    if (rc != 0) {
        MY_LOG_INFO(TAG, "BLE scan start failed: %d", rc);
        bt_scan_active = false;
        bt_scan_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
