Smethan/projectZero/ESP32C5/main/main.c
    // Scan for 10 seconds with light blue LED blinking
    bool led_on = false;
    for (int i = 0; i < 100 && bt_scan_active; i++) {
        // Toggle LED every 500ms (every 5 iterations)
        if (i % 5 == 0) {
            led_on = !led_on;
            if (led_on) {
                led_set_color(100, 200, 255); // Light blue
            } else {
                led_clear();
            }
        }
        if (i % 10 == 0) {
            char ble_l2[64], ble_l3[64], ble_l4[64];
            snprintf(ble_l2, sizeof(ble_l2), "  Scanning %d/10s", i / 10);
            snprintf(ble_l3, sizeof(ble_l3), "  %d devices", bt_device_count);
            snprintf(ble_l4, sizeof(ble_l4), "  AT:%d ST:%d", bt_airtag_count, bt_smarttag_count);
            oled_display_update_full("> BLE Scan", ble_l2, ble_l3, ble_l4);
        }
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    // Restore idle LED
    led_set_idle();
    
    bt_stop_scan();
    bt_scan_active = false;
    
    {
        char ble_l3[64], ble_l4[64];
        snprintf(ble_l3, sizeof(ble_l3), "  %d devices", bt_device_count);
        snprintf(ble_l4, sizeof(ble_l4), "  AT:%d ST:%d", bt_airtag_count, bt_smarttag_count);
        oled_display_update_full("> BLE Scan", "  Scan done!", ble_l3, ble_l4);
    }
    
    // Print results
    MY_LOG_INFO(TAG, "");
    MY_LOG_INFO(TAG, "=== BLE Scan Results ===");
    MY_LOG_INFO(TAG, "Found %d devices:", bt_device_count);
    MY_LOG_INFO(TAG, "");
    
    for (int i = 0; i < bt_device_count; i++) {
        bt_device_info_t *dev = &bt_devices[i];
        char addr_str[18];
        bt_format_addr(dev->addr, addr_str);
        
        char type_str[32] = "";
        if (dev->is_airtag) {
            strcpy(type_str, " [AirTag]");
        } else if (dev->is_smarttag) {
            strcpy(type_str, " [SmartTag]");
        }
        
        if (dev->name[0] != '\0') {
            MY_LOG_INFO(TAG, "%3d. %s  RSSI: %d dBm  Name: %s%s", 
                       i + 1, addr_str, dev->rssi, dev->name, type_str);
        } else {
            MY_LOG_INFO(TAG, "%3d. %s  RSSI: %d dBm%s", 
                       i + 1, addr_str, dev->rssi, type_str);
        }
    }
    
    MY_LOG_INFO(TAG, "");
    MY_LOG_INFO(TAG, "Summary: %d AirTags, %d SmartTags, %d total devices",
               bt_airtag_count, bt_smarttag_count, bt_device_count);
    
    bt_scan_task_handle = NULL;
    vTaskDelete(NULL);
}

/**
 * Task for continuous AirTag scan (scan_airtag command)
 */
static void bt_airtag_scan_task(void *pvParameters)
{
    MY_LOG_INFO(TAG, "AirTag scanner starting (continuous)...");
    MY_LOG_INFO(TAG, "Output format: <airtag_count>,<smarttag_count>");
    MY_LOG_INFO(TAG, "Use 'stop' command to stop scanning.");
    MY_LOG_INFO(TAG, "");
    
    int at_cycle = 0;
    
    while (bt_airtag_scan_active && !operation_stop_requested) {
        bt_reset_counters();
        at_cycle++;
        
        int rc = bt_start_scan();
        if (rc != 0) {
            MY_LOG_INFO(TAG, "BLE scan start failed: %d", rc);
            break;
        }
        
        // Scan for 10 seconds with light blue LED blinking
        bool led_on = false;
        for (int i = 0; i < 100 && bt_airtag_scan_active && !operation_stop_requested; i++) {
            // Toggle LED every 500ms (every 5 iterations)
            if (i % 5 == 0) {
                led_on = !led_on;
                if (led_on) {
                    led_set_color(100, 200, 255); // Light blue
                } else {
                    led_clear();
                }
            }
            if (i % 20 == 0) {
                char at_l2[64], at_l4[64];
                snprintf(at_l2, sizeof(at_l2), "  Cycle #%d", at_cycle);
                snprintf(at_l4, sizeof(at_l4), "  AT:%d ST:%d", bt_airtag_count, bt_smarttag_count);
                oled_display_update_full("> AirTag Scan", at_l2, "  Scanning...", at_l4);
            }
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        
        bt_stop_scan();
        
        if (!bt_airtag_scan_active || operation_stop_requested) {
            break;
        }
        
        // Output in requested format: airtag_count,smarttag_count
        printf("%d,%d\n", bt_airtag_count, bt_smarttag_count);
        
        {
            char at_l3[64];
            snprintf(at_l3, sizeof(at_l3), "  AT:%d ST:%d", bt_airtag_count, bt_smarttag_count);
            oled_display_update_full("> AirTag Scan", "  Cycle done", at_l3, "  Next cycle...");
        }
        
        // Immediately start next scan cycle (no wait)
    }
    
    // Restore idle LED
    led_set_idle();
    
    bt_airtag_scan_active = false;
    bt_scan_task_handle = NULL;
    MY_LOG_INFO(TAG, "AirTag scanner stopped.");
    vTaskDelete(NULL);
}

/**
 * Task for MAC tracking mode (scan_bt with MAC argument)
 * Scans every 10 seconds and outputs RSSI for the tracked MAC
 */
static void bt_tracking_task(void *pvParameters)
{
    char mac_str[18];
    bt_format_addr(bt_tracking_mac, mac_str);
    
    MY_LOG_INFO(TAG, "Tracking %s (10s intervals)...", mac_str);
    MY_LOG_INFO(TAG, "Use 'stop' command to stop tracking.");
    MY_LOG_INFO(TAG, "");
    
    while (bt_scan_active && !operation_stop_requested) {
        // Reset tracking state
        bt_tracking_found = false;
        bt_tracking_rssi = 0;
        
        int rc = bt_start_scan();
        if (rc != 0) {
            MY_LOG_INFO(TAG, "BLE scan start failed: %d", rc);
            break;
        }
        
        // Scan for 10 seconds with light blue LED blinking
        bool led_on = false;
        for (int i = 0; i < 100 && bt_scan_active && !operation_stop_requested; i++) {
            // Toggle LED every 500ms (every 5 iterations)
            if (i % 5 == 0) {
                led_on = !led_on;
                if (led_on) {
                    led_set_color(100, 200, 255); // Light blue
                } else {
                    led_clear();
                }
            }
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        
