Smethan/projectZero/ESP32C5/main/main.c
        bt_stop_scan();
        
        if (!bt_scan_active || operation_stop_requested) {
            break;
        }
        
        // Output result
        if (bt_tracking_found) {
            if (bt_tracking_name[0] != '\0') {
                printf("%s  RSSI: %d dBm  Name: %s\n", mac_str, bt_tracking_rssi, bt_tracking_name);
            } else {
                printf("%s  RSSI: %d dBm\n", mac_str, bt_tracking_rssi);
            }
        } else {
            printf("%s  not found\n", mac_str);
        }
    }
    
    // Restore idle LED
    led_set_idle();
    
    bt_tracking_mode = false;
    bt_scan_active = false;
    bt_scan_task_handle = NULL;
    MY_LOG_INFO(TAG, "MAC tracking stopped.");
    vTaskDelete(NULL);
}

/**
 * Command: scan_bt - One-time BLE device scan
 * With MAC argument: continuous tracking of specific device
 * 
 * Usage:
 *   scan_bt              - One-time 10s scan, show all devices
 *   scan_bt XX:XX:XX:XX:XX:XX - Continuous tracking of specific MAC (2s intervals)
 */
static int cmd_scan_bt(int argc, char **argv)
{
    if (argc > 1) {
        oled_display_update_full("> BLE Track", argv[1], "  Tracking MAC", "  Scanning...");
    } else {
        oled_display_update_full("> BLE Scan", "  Discovering...", "  10s scan time", "  Working...");
    }
    log_memory_info("scan_bt");
    
    // Ensure BLE is initialized (may reboot if WiFi was active)
    if (!ensure_ble_mode()) {
        return 1;
    }
    
    if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) {
        MY_LOG_INFO(TAG, "BLE scan already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    bt_scan_active = true;
    operation_stop_requested = false;
    
    // Check if MAC argument provided
    if (argc > 1) {
        // Tracking mode - parse MAC address
        if (!bt_parse_mac(argv[1], bt_tracking_mac)) {
            MY_LOG_INFO(TAG, "Invalid MAC address format. Use XX:XX:XX:XX:XX:XX");
            bt_scan_active = false;
            return 1;
        }
        
        bt_tracking_mode = true;
        bt_tracking_found = false;
        bt_tracking_rssi = 0;
        bt_tracking_name[0] = '\0';
        
        BaseType_t task_ret = xTaskCreate(
            bt_tracking_task,
            "bt_tracking_task",
            4096,
            NULL,
            5,
            &bt_scan_task_handle
        );
        
        if (task_ret != pdPASS) {
            bt_scan_active = false;
            bt_tracking_mode = false;
            MY_LOG_INFO(TAG, "Failed to create MAC tracking task");
            return 1;
        }
    } else {
        // Normal scan mode
        bt_tracking_mode = false;
        
        BaseType_t task_ret = xTaskCreate(
            bt_scan_task,
            "bt_scan_task",
            4096,
            NULL,
            5,
            &bt_scan_task_handle
        );
        
        if (task_ret != pdPASS) {
            bt_scan_active = false;
            MY_LOG_INFO(TAG, "Failed to create BLE scan task");
            return 1;
        }
    }
    
    return 0;
}

/**
 * Command: scan_airtag - Continuous AirTag/SmartTag scanning
 */
static int cmd_scan_airtag(int argc, char **argv)
{
    (void)argc; (void)argv;
    oled_display_update_full("> AirTag Scan", "  Apple+Samsung", "  Continuous", "  Scanning...");
    log_memory_info("scan_airtag");
    
    // Ensure BLE is initialized (may reboot if WiFi was active)
    if (!ensure_ble_mode()) {
        return 1;
    }
    
    if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) {
        MY_LOG_INFO(TAG, "BLE scan already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    bt_airtag_scan_active = true;
    operation_stop_requested = false;
    
    BaseType_t task_ret = xTaskCreate(
        bt_airtag_scan_task,
        "bt_airtag_task",
        4096,
        NULL,
        5,
        &bt_scan_task_handle
    );
    
    if (task_ret != pdPASS) {
        bt_airtag_scan_active = false;
        MY_LOG_INFO(TAG, "Failed to create AirTag scan task");
        return 1;
    }
    
    return 0;
}

// ============================================================================

// --- nRF24 jammer commands ---
static int cmd_init_nrf24(int argc, char **argv) {
    (void)argc; (void)argv;
    bool ok = nrf24_jammer_init();
    if (ok) {
        printf("[NRF24] detected (init OK) - SCK=6 MOSI=7 MISO=2 CS=3 CE=4\n");
        oled_display_update_full("> NRF24", "  Module OK", "", "  > Ready");
    } else {
        printf("[NRF24] not detected - check wiring/power (3.3V + cap)\n");
        oled_display_update_full("> NRF24", "  NOT detected", "  check wiring", "  > Idle");
    }
    return 0;
}

static int cmd_start_jammer24(int argc, char **argv) {
    nrf24_jam_band_t band = JAM_ALL;
    if (argc >= 2 && argv[1] != NULL) {
        if (strcasecmp(argv[1], "ble") == 0) band = JAM_BLE;
        else if (strcasecmp(argv[1], "bt") == 0) band = JAM_BT;
        else if (strcasecmp(argv[1], "wifi") == 0) band = JAM_WIFI;
        else if (strcasecmp(argv[1], "drone") == 0) band = JAM_DRONE;
        else if (strcasecmp(argv[1], "all") == 0) band = JAM_ALL;
        else {
            printf("[NRF24] unknown band '%s' (use ble|bt|wifi|drone|all)\n", argv[1]);
            return 1;
        }
    }

    if (!nrf24_jammer_start(band)) {
        printf("[NRF24] failed to start - run init_nrf24 first, or jammer already running\n");
        return 1;
    }

    const char *name = nrf24_jammer_band_name(band);
    printf("nRF24 jammer started (band=%s). Use 'stop' to end.\n", name);
    char line2[24];
    snprintf(line2, sizeof(line2), "  band=%s", name);
    oled_display_update_full("> JAMMING 2.4G", line2, "", "  > stop to end");
    return 0;
}

// --- Command registration in esp_console ---
static void register_commands(void)
{
    const esp_console_cmd_t scan_cmd = {
        .command = "scan_networks",
        .help = "Starts background network scan",
        .hint = NULL,
        .func = &cmd_scan_networks,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&scan_cmd));

    const esp_console_cmd_t show_scan_cmd = {
        .command = "show_scan_results",
        .help = "Shows results from last network scan",
        .hint = NULL,
        .func = &cmd_show_scan_results,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&show_scan_cmd));

