Smethan/projectZero/ESP32C5/main/main.c
    const esp_console_cmd_t deauth_cmd = {
        .command = "start_deauth",
        .help = "Starts Deauth attack.",
        .hint = NULL,
        .func = &cmd_start_deauth,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&deauth_cmd));

    const esp_console_cmd_t handshake_cmd = {
        .command = "start_handshake",
        .help = "Starts WPA Handshake capture attack. With selected networks: attacks only those. Without: scans every 5min and attacks all.",
        .hint = NULL,
        .func = &cmd_start_handshake,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&handshake_cmd));

    const esp_console_cmd_t save_handshake_cmd = {
        .command = "save_handshake",
        .help = "Manually saves captured handshake to SD card (only if complete 4-way handshake).",
        .hint = NULL,
        .func = &cmd_save_handshake,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&save_handshake_cmd));

    const esp_console_cmd_t handshake_serial_cmd = {
        .command = "start_handshake_serial",
        .help = "Captures WPA handshakes (sniffer mode) and dumps PCAP/HCCAPX as base64 via serial. No SD card needed.",
        .hint = NULL,
        .func = &cmd_start_handshake_serial,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&handshake_serial_cmd));

    const esp_console_cmd_t wpasec_key_cmd = {
        .command = "wpasec_key",
        .help = "Set/read wpa-sec.stanev.org API key: wpasec_key set <key> | wpasec_key read",
        .hint = NULL,
        .func = &cmd_wpasec_key,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wpasec_key_cmd));

    const esp_console_cmd_t wpasec_upload_cmd = {
        .command = "wpasec_upload",
        .help = "Upload all .pcap handshakes from SD card to wpa-sec.stanev.org",
        .hint = NULL,
        .func = &cmd_wpasec_upload,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wpasec_upload_cmd));

    const esp_console_cmd_t wigle_key_cmd = {
        .command = "wigle_key",
        .help = "Set/read/clear WiGLE API credentials: wigle_key set <api_name> <api_token> | wigle_key read | wigle_key clear",
        .hint = NULL,
        .func = &cmd_wigle_key,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wigle_key_cmd));

    const esp_console_cmd_t wigle_upload_cmd = {
        .command = "wigle_upload",
        .help = "Upload Wardrive files to WiGLE: wigle_upload [file1 file2 ...|all] (no args = pending only)",
        .hint = NULL,
        .func = &cmd_wigle_upload,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wigle_upload_cmd));

    const esp_console_cmd_t wdgwars_key_cmd = {
        .command = "wdgwars_key",
        .help = "Set/read/clear WDGWars API key: wdgwars_key set <key> | wdgwars_key read | wdgwars_key clear",
        .hint = NULL,
        .func = &cmd_wdgwars_key,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wdgwars_key_cmd));

    const esp_console_cmd_t wdgwars_upload_cmd = {
        .command = "wdgwars_upload",
        .help = "Upload Wardrive files to WDGWars: wdgwars_upload [file1 file2 ...|all] (no args = pending only)",
        .hint = NULL,
        .func = &cmd_wdgwars_upload,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wdgwars_upload_cmd));

    const esp_console_cmd_t upload_state_cmd = {
        .command = "upload_state",
        .help = "Print/clear local wardrive upload manifest: upload_state [clear]",
        .hint = NULL,
        .func = &cmd_upload_state,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&upload_state_cmd));

    const esp_console_cmd_t wardrive_files_cmd = {
        .command = "wardrive_files",
        .help = "List wardrive files with local stats and upload status",
        .hint = NULL,
        .func = &cmd_wardrive_files,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wardrive_files_cmd));

    const esp_console_cmd_t wardrive_cleanup_cmd = {
        .command = "wardrive_cleanup",
        .help = "Dry-run or move wardrive files by upload status: wardrive_cleanup <service> <status> [move [destination]]",
        .hint = "<wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]",
        .func = &cmd_wardrive_cleanup,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wardrive_cleanup_cmd));

    const esp_console_cmd_t wardrive_fix_cmd = {
        .command = "wardrive_fix",
        .help = "Create a soft-fixed WigleWifi copy: wardrive_fix <file>",
        .hint = NULL,
        .func = &cmd_wardrive_fix,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wardrive_fix_cmd));

       const esp_console_cmd_t sae_overflow_cmd = {
        .command = "sae_overflow",
        .help = "Starts SAE WPA3 Client Overflow attack.",
        .hint = NULL,
        .func = &cmd_start_sae_overflow,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&sae_overflow_cmd));

    const esp_console_cmd_t blackout_cmd = {
        .command = "start_blackout",
        .help = "Starts blackout attack - scans all networks every 3 minutes, sorts by channel, attacks all",
        .hint = NULL,
        .func = &cmd_start_blackout,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&blackout_cmd));

    const esp_console_cmd_t beacon_spam_cmd = {
        .command = "start_beacon_spam",
        .help = "Spam beacon frames with fake SSIDs on various channels",
        .hint = "\"SSID1\" \"SSID2\" ...",
        .func = &cmd_start_beacon_spam,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&beacon_spam_cmd));

    const esp_console_cmd_t beacon_spam_ssids_cmd = {
        .command = "start_beacon_spam_ssids",
        .help = "Beacon spam with all SSIDs from /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_start_beacon_spam_ssids,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&beacon_spam_ssids_cmd));

