Smethan/projectZero/ESP32C5/main/main.c
    const esp_console_cmd_t wifi_disconnect_cmd = {
        .command = "wifi_disconnect",
        .help = "Disconnect from current AP (STA)",
        .hint = NULL,
        .func = &cmd_wifi_disconnect,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&wifi_disconnect_cmd));

    const esp_console_cmd_t ota_check_cmd = {
        .command = "ota_check",
        .help = "Check GitHub release and apply OTA update (requires WiFi)",
        .hint = NULL,
        .func = &cmd_ota_check,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ota_check_cmd));

    const esp_console_cmd_t ota_list_cmd = {
        .command = "ota_list",
        .help = "List recent GitHub releases (first 10)",
        .hint = NULL,
        .func = &cmd_ota_list,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ota_list_cmd));

    const esp_console_cmd_t ota_channel_cmd = {
        .command = "ota_channel",
        .help = "Get/set OTA channel: ota_channel [main|dev]",
        .hint = NULL,
        .func = &cmd_ota_channel,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ota_channel_cmd));

    const esp_console_cmd_t ota_info_cmd = {
        .command = "ota_info",
        .help = "Show OTA partition info",
        .hint = NULL,
        .func = &cmd_ota_info,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ota_info_cmd));

    const esp_console_cmd_t ota_boot_cmd = {
        .command = "ota_boot",
        .help = "Set boot partition: ota_boot <ota_0|ota_1>",
        .hint = NULL,
        .func = &cmd_ota_boot,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ota_boot_cmd));

    const esp_console_cmd_t list_hosts_cmd = {
        .command = "list_hosts",
        .help = "Scan local network via ARP and list discovered hosts",
        .hint = NULL,
        .func = &cmd_list_hosts,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_hosts_cmd));

    const esp_console_cmd_t list_hosts_vendor_cmd = {
        .command = "list_hosts_vendor",
        .help = "Scan local network via ARP and list discovered hosts with vendor names",
        .hint = NULL,
        .func = &cmd_list_hosts_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_hosts_vendor_cmd));

    const esp_console_cmd_t nmap_cmd = {
        .command = "start_nmap",
        .help = "Port scan: start_nmap [quick|medium|heavy] [IP]",
        .hint = NULL,
        .func = &cmd_start_nmap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&nmap_cmd));

    const esp_console_cmd_t arp_ban_cmd = {
        .command = "arp_ban",
        .help = "ARP poison a device to disconnect it: arp_ban <MAC> [IP]",
        .hint = "<MAC> [IP]",
        .func = &cmd_arp_ban,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&arp_ban_cmd));

    const esp_console_cmd_t reboot_cmd = {
        .command = "reboot",
        .help = "Device reboot to start from scratch",
        .hint = NULL,
        .func = &cmd_reboot,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&reboot_cmd));

    const esp_console_cmd_t ping_cmd = {
        .command = "ping",
        .help = "Connectivity test: prints pong",
        .hint = NULL,
        .func = &cmd_ping,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&ping_cmd));

    const esp_console_cmd_t version_cmd = {
        .command = "version",
        .help = "Print firmware version",
        .hint = NULL,
        .func = &cmd_version,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&version_cmd));

    const esp_console_cmd_t list_sd_cmd = {
        .command = "list_sd",
        .help = "Lists HTML files on SD card",
        .hint = NULL,
        .func = &cmd_list_sd,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_sd_cmd));

    const esp_console_cmd_t sd_status_cmd = {
        .command = "sd_status",
        .help = "Fast SD card presence check (no init/mount)",
        .hint = NULL,
        .func = &cmd_sd_status,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&sd_status_cmd));

    const esp_console_cmd_t show_pass_cmd = {
        .command = "show_pass",
        .help = "Prints password log: show_pass [portal|evil]",
        .hint = NULL,
        .func = &cmd_show_pass,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&show_pass_cmd));

    const esp_console_cmd_t list_dir_cmd = {
        .command = "list_dir",
        .help = "List files inside a directory on SD card: list_dir [path]",
        .hint = NULL,
        .func = &cmd_list_dir,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_dir_cmd));

    const esp_console_cmd_t list_ssid_cmd = {
        .command = "list_ssid",
        .help = "Lists SSIDs from /sdcard/lab/ssid.txt",
        .hint = NULL,
        .func = &cmd_list_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_ssid_cmd));

    const esp_console_cmd_t list_ssids_cmd = {
        .command = "list_ssids",
        .help = "Lists SSIDs from /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_list_ssids,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&list_ssids_cmd));

    const esp_console_cmd_t add_ssid_cmd = {
        .command = "add_ssid",
        .help = "Add SSID to /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_add_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&add_ssid_cmd));

    const esp_console_cmd_t remove_ssid_cmd = {
        .command = "remove_ssid",
        .help = "Remove SSID by index from /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_remove_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&remove_ssid_cmd));

    const esp_console_cmd_t file_delete_cmd = {
        .command = "file_delete",
        .help = "Delete a file on SD card: file_delete <path>",
        .hint = NULL,
        .func = &cmd_file_delete,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&file_delete_cmd));

    const esp_console_cmd_t select_html_cmd = {
        .command = "select_html",
        .help = "Load custom HTML from SD card: select_html <index>",
        .hint = NULL,
        .func = &cmd_select_html,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&select_html_cmd));

    const esp_console_cmd_t set_html_begin_cmd = {
        .command = "set_html_begin",
        .help = "Start chunked HTML transfer (base64). Follow with set_html <chunk> then set_html_end",
        .hint = NULL,
        .func = &cmd_set_html_begin,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&set_html_begin_cmd));

    const esp_console_cmd_t set_html_cmd = {
        .command = "set_html",
        .help = "Append base64 chunk during HTML transfer: set_html <base64_chunk>",
        .hint = NULL,
        .func = &cmd_set_html,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&set_html_cmd));

