Smethan/projectZero/ESP32C5/main/main.c
    const esp_console_cmd_t set_html_end_cmd = {
        .command = "set_html_end",
        .help = "Finish chunked HTML transfer — decode and activate custom portal HTML",
        .hint = NULL,
        .func = &cmd_set_html_end,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&set_html_end_cmd));

    // BLE Scanner commands
    const esp_console_cmd_t scan_bt_cmd = {
        .command = "scan_bt",
        .help = "One-time BLE device scan (10 seconds)",
        .hint = NULL,
        .func = &cmd_scan_bt,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&scan_bt_cmd));

    const esp_console_cmd_t scan_airtag_cmd = {
        .command = "scan_airtag",
        .help = "Continuous AirTag/SmartTag scan (outputs count every 30s)",
        .hint = NULL,
        .func = &cmd_scan_airtag,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(sw_register_command(&scan_airtag_cmd));

}

void app_main(void) {


    // printf("Heap regions:\n");
    // printf("  DRAM total: %u KB\n", (unsigned)(heap_caps_get_total_size(MALLOC_CAP_8BIT) / 1024));
    // printf("  IRAM total: %u KB\n", (unsigned)(heap_caps_get_total_size(MALLOC_CAP_EXEC) / 1024));
    // heap_caps_print_heap_info(MALLOC_CAP_DEFAULT);

    printf("\n\n=== APP_MAIN START (v" JANOS_VERSION ") ===\n");
    
    // Suppress WiFi internal WARNING logs (phy rate, etc.) - show only errors
    esp_log_level_set("wifi", ESP_LOG_ERROR);
    
    // Suppress SD card initialization errors (we handle them gracefully with our own message)
    esp_log_level_set("sdmmc_sd", ESP_LOG_NONE);
    esp_log_level_set("vfs_fat_sdmmc", ESP_LOG_NONE);
    esp_log_level_set("spi_common", ESP_LOG_NONE);

 #ifdef CONFIG_SPIRAM
//     printf("Step 1: Manual PSRAM init\n");
    
    // Manual PSRAM initialization (CONFIG_SPIRAM_BOOT_INIT=n)
    esp_err_t ret1 = esp_psram_init();
    if (ret1 == ESP_OK) {
        size_t psram_size = esp_psram_get_size();
        (void)psram_size;
        //printf("PSRAM initialized successfully, size: %zu bytes\n", psram_size);
        
        //printf("Step 2: Test PSRAM malloc\n");
        void* ptr = heap_caps_malloc(1024, MALLOC_CAP_SPIRAM);
        if (ptr != NULL) {
            //printf("Malloc from PSRAM succeeded\n");
            heap_caps_free(ptr);
        } else {
            printf("Malloc from PSRAM failed\n");
        }
        
        //printf("Step 2b: Allocate buffers in PSRAM\n");
        if (!init_psram_buffers()) {
            printf("FATAL: PSRAM buffer allocation failed!\n");
            return;
        }
        //printf("PSRAM buffers allocated (~110 KB)\n");
    } else {
        printf("PSRAM init failed: %s (continuing without PSRAM)\n", esp_err_to_name(ret1));
    }
#else
    printf("PSRAM support disabled in config\n");
#endif

    // NVS must be ready before loading persisted display mode.
    ESP_ERROR_CHECK(nvs_flash_init());
    display_mode_load_from_nvs();
    oled_display_set_forced_type(display_forced_mode);

    // Initialize display module (auto-detect SSD1306 / SH1107 / SH1106 / Unit LCD)
    oled_display_init();
    {
        const char *display_name = "NONE";
        char display_desc[64];
        int disp_addr7 = oled_display_get_i2c_addr_7bit();
        int disp_addr_raw = oled_display_get_i2c_addr_raw();
        snprintf(display_desc, sizeof(display_desc), "not detected");
        switch (oled_display_get_type()) {
            case DISPLAY_SSD1306:
                display_name = "SSD1306";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_SH1107:
                display_name = "SH1107";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_SH1106:
                display_name = "SH1106";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_UNIT_LCD:
                display_name = "UNIT_LCD";
                snprintf(display_desc, sizeof(display_desc), "addr 0x%02X", disp_addr7);
                break;
            case DISPLAY_NONE:
            default:
                display_name = "NONE";
                snprintf(display_desc, sizeof(display_desc), "check display wiring / I2C");
                break;
        }
        MY_LOG_INFO(TAG, "Display: %s", display_name);
    }
    oled_display_update_full("> JanOS v" JANOS_VERSION, "  Booting...", "", "");
    vTaskDelay(pdMS_TO_TICKS(80));

//     printf("Step 3: Init NVS\n");
    ota_load_channel_from_nvs();
    wpasec_load_key_from_nvs();
    wigle_load_key_from_nvs();
    wdgwars_load_key_from_nvs();
    ota_mark_valid_if_pending();
    ota_log_boot_info();
    //printf("NVS initialized OK\n");

    channel_time_load_state_from_nvs();
    wardrive_config_load_from_nvs();
    wardrive_blacklist_load();
    gps_load_state_from_nvs();
    led_load_state_from_nvs();
    oled_display_update_full(NULL, "  NVS: OK", "  Init LED...", "");
    vTaskDelay(pdMS_TO_TICKS(60));
    MY_LOG_INFO(TAG, "GPS: %s", gps_get_module_name(current_gps_module));

    //printf("Step 4: Init LED strip\n");
    // 1. LED strip configuration
    led_strip_config_t strip_cfg = {
        .strip_gpio_num            = NEOPIXEL_GPIO,
        .max_leds                  = LED_COUNT,
        .led_model                 = LED_MODEL_WS2812,
        .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
        .flags.invert_out          = false,
    };

    // 2. LED Strip RMT configuration
    led_strip_rmt_config_t rmt_cfg = {
        .clk_src        = RMT_CLK_SRC_DEFAULT,
        .resolution_hz  = RMT_RES_HZ,
        .flags.with_dma = false,
    };

    // 3. strip instance (non-fatal on failure)
    esp_err_t led_init_err = led_strip_new_rmt_device(&strip_cfg, &rmt_cfg, &strip);
    if (led_init_err != ESP_OK) {
        ESP_LOGE(TAG, "LED strip init failed on GPIO %d (model %s): %s",
                 strip_cfg.strip_gpio_num,
                 "WS2812",
                 esp_err_to_name(led_init_err));
        strip = NULL;
        led_initialized = false;
    } else {
        led_initialized = true;
        led_boot_sequence();
    }
    //printf("Step 6: Vendor load state\n");
    oled_display_update_full(NULL, "  NVS: OK", "  LED: OK", "  Init SD...");
    vTaskDelay(pdMS_TO_TICKS(60));
    vendor_load_state_from_nvs();
    vendor_last_valid = false;
    vendor_last_hit = false;
    vendor_lookup_buffer[0] = '\0';
    vendor_file_checked = false;
    vendor_file_present = false;
    vendor_record_count = 0;
    //printf("Step 7: Boot config load\n");
    boot_config_load_from_nvs();

    // Note: WiFi and BLE are initialized lazily on first command that needs them
    // This saves memory and allows SD card to work properly
    //printf("Radio init: deferred (lazy initialization)\n");
    
    // Show memory status at boot
    log_memory_info("BOOT");

    MY_LOG_INFO(TAG,"JanOS version: " JANOS_VERSION);


    esp_console_repl_t *repl = NULL;
    esp_console_repl_config_t repl_config = ESP_CONSOLE_REPL_CONFIG_DEFAULT();
    // Keep REPL stable for heavier TLS-based commands triggered directly from CLI.
    repl_config.task_stack_size = 8192;
    MY_LOG_INFO(TAG,"Type 'help' to list all commands.");

    repl_config.prompt = ">";
    repl_config.max_cmdline_length = 8192;  // native USB OTA: 4KiB base64 plus identity/CRC

    esp_console_register_help_command();
    register_commands();

#if CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG
    esp_console_dev_usb_serial_jtag_config_t hw_config = ESP_CONSOLE_DEV_USB_SERIAL_JTAG_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_usb_serial_jtag(&hw_config, &repl_config, &repl));
#else
    esp_console_dev_uart_config_t hw_config = ESP_CONSOLE_DEV_UART_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_uart(&hw_config, &repl_config, &repl));
#endif

    linenoiseSetHintsCallback((linenoiseHintsCallback *)&janos_console_hint);

    ESP_ERROR_CHECK(esp_console_start_repl(repl));
    vTaskDelay(pdMS_TO_TICKS(500));

    gpio_config_t boot_button_config = {
        .pin_bit_mask = 1ULL << BOOT_BUTTON_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&boot_button_config));

    if (boot_button_task_handle == NULL) {
        BaseType_t boot_task_created = xTaskCreate(
            boot_button_task,
            "boot_button",
            BOOT_BUTTON_TASK_STACK_SIZE,
            NULL,
            BOOT_BUTTON_TASK_PRIORITY,
            &boot_button_task_handle
        );
        if (boot_task_created != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create boot button task");
            boot_button_task_handle = NULL;
        }
    }
    
    // Initialize SD card and create necessary directories
    esp_err_t sd_init_ret = init_sd_card();
    if (sd_init_ret == ESP_OK) {
        create_sd_directories();
        upload_state_ensure_file();
        report_ssid_file_status();
        ensure_ssids_file();
        if (vendor_is_enabled()) {
            ensure_vendor_file_checked();
        }
        // Check for wpa-sec API key file on SD card
        {
            FILE *wf = fopen("/sdcard/lab/wpa-sec.txt", "r");
            if (wf) {
                static char line[256];
                memset(line, 0, sizeof(line));
                if (fgets(line, sizeof(line), wf)) {
                    // Strip trailing newline/carriage return
                    size_t ln = strlen(line);
                    while (ln > 0 && (line[ln - 1] == '\n' || line[ln - 1] == '\r')) {
                        line[--ln] = '\0';
                    }
                    if (ln > 0) {
                        if (wpasec_save_key_to_nvs(line)) {
                            MY_LOG_INFO(TAG, "wpa-sec key updated from SD card into NVS.");
                        } else {
                            MY_LOG_INFO(TAG, "Failed to save wpa-sec key from SD card to NVS.");
                        }
                    }
                }
                fclose(wf);
            }
        }
        oled_display_update_full(NULL, "  SD: mounted", "  All systems OK", "");
    } else {
        oled_display_update_full(NULL, "  SD: MISSING!", "  No file save", "");
    }
    vTaskDelay(pdMS_TO_TICKS(400));
    
