Smethan/projectZero/ESP32C5/main/main.c
static void sniffer_process_scan_results(void) {
    if (!g_scan_done || g_scan_count == 0) {
        return;
    }
    
    MY_LOG_INFO(TAG, "Processing %u scan results for sniffer...", g_scan_count);
    
    int added_count = 0;
    
    // Add new APs from scan results (don't clear existing data)
    for (int i = 0; i < g_scan_count && sniffer_ap_count < MAX_SNIFFER_APS; i++) {
        wifi_ap_record_t *scan_ap = &g_scan_results[i];
        
        // Check if AP already exists in sniffer_aps
        bool ap_exists = false;
        for (int j = 0; j < sniffer_ap_count; j++) {
            if (memcmp(sniffer_aps[j].bssid, scan_ap->bssid, 6) == 0) {
                ap_exists = true;
                // Update info but keep clients
                sniffer_aps[j].channel = scan_ap->primary;
                sniffer_aps[j].rssi = scan_ap->rssi;
                sniffer_aps[j].last_seen = esp_timer_get_time() / 1000;
                break;
            }
        }
        
        // Add new AP if not present
        if (!ap_exists) {
            sniffer_ap_t *new_ap = &sniffer_aps[sniffer_ap_count++];
            memcpy(new_ap->bssid, scan_ap->bssid, 6);
            strncpy(new_ap->ssid, (char*)scan_ap->ssid, sizeof(new_ap->ssid) - 1);
            new_ap->ssid[sizeof(new_ap->ssid) - 1] = '\0';
            new_ap->channel = scan_ap->primary;
            new_ap->authmode = scan_ap->authmode;
            new_ap->rssi = scan_ap->rssi;
            new_ap->client_count = 0;
            new_ap->last_seen = esp_timer_get_time() / 1000;
            added_count++;
        }
    }
    
    MY_LOG_INFO(TAG, "Sniffer: added %d new APs, total %d APs in database", added_count, sniffer_ap_count);
}

static void sniffer_merge_scan_results(void) {
    if (!g_scan_done || g_scan_count == 0) {
        return;
    }

    MY_LOG_INFO(TAG, "Merging %u scan results into sniffer list...", g_scan_count);

    for (int i = 0; i < g_scan_count; i++) {
        wifi_ap_record_t *scan_ap = &g_scan_results[i];
        int existing = -1;

        for (int j = 0; j < sniffer_ap_count; j++) {
            if (memcmp(sniffer_aps[j].bssid, scan_ap->bssid, 6) == 0) {
                existing = j;
                break;
            }
        }

        if (existing >= 0) {
            sniffer_ap_t *sniffer_ap = &sniffer_aps[existing];
            strncpy(sniffer_ap->ssid, (char*)scan_ap->ssid, sizeof(sniffer_ap->ssid) - 1);
            sniffer_ap->ssid[sizeof(sniffer_ap->ssid) - 1] = '\0';
            sniffer_ap->channel = scan_ap->primary;
            sniffer_ap->authmode = scan_ap->authmode;
            sniffer_ap->rssi = scan_ap->rssi;
            sniffer_ap->last_seen = esp_timer_get_time() / 1000; // ms
            continue;
        }

        if (sniffer_ap_count >= MAX_SNIFFER_APS) {
            continue;
        }

        sniffer_ap_t *sniffer_ap = &sniffer_aps[sniffer_ap_count++];
        memset(sniffer_ap, 0, sizeof(*sniffer_ap));
        memcpy(sniffer_ap->bssid, scan_ap->bssid, 6);
        strncpy(sniffer_ap->ssid, (char*)scan_ap->ssid, sizeof(sniffer_ap->ssid) - 1);
        sniffer_ap->ssid[sizeof(sniffer_ap->ssid) - 1] = '\0';
        sniffer_ap->channel = scan_ap->primary;
        sniffer_ap->authmode = scan_ap->authmode;
        sniffer_ap->rssi = scan_ap->rssi;
        sniffer_ap->client_count = 0;
        sniffer_ap->last_seen = esp_timer_get_time() / 1000; // ms
    }

    MY_LOG_INFO(TAG, "Sniffer list now has %d APs", sniffer_ap_count);
}

static void sniffer_init_selected_networks(void) {
    if (g_selected_count == 0 || !g_scan_done) {
        MY_LOG_INFO(TAG, "Cannot initialize selected networks - no selection or scan data");
        return;
    }
    
    MY_LOG_INFO(TAG, "Initializing sniffer for %d selected networks...", g_selected_count);
    
    // Only clear channel list, NOT sniffer_aps data (preserve all captured clients)
    sniffer_selected_channels_count = 0;
    memset(sniffer_selected_channels, 0, sizeof(sniffer_selected_channels));
    
    // Build channel list and ensure selected networks exist in sniffer_aps
    for (int i = 0; i < g_selected_count; i++) {
        int idx = g_selected_indices[i];
        if (idx < 0 || idx >= (int)g_scan_count) {
            MY_LOG_INFO(TAG, "Warning: Invalid selected index %d, skipping", idx);
            continue;
        }
        
        wifi_ap_record_t *scan_ap = &g_scan_results[idx];
        
        // Add channel to hop list
        bool channel_exists = false;
        for (int j = 0; j < sniffer_selected_channels_count; j++) {
            if (sniffer_selected_channels[j] == scan_ap->primary) {
                channel_exists = true;
                break;
            }
        }
        if (!channel_exists && sniffer_selected_channels_count < MAX_AP_CNT) {
            sniffer_selected_channels[sniffer_selected_channels_count++] = scan_ap->primary;
        }
        
        // Ensure this AP exists in sniffer_aps (add only if not present)
        bool ap_exists = false;
        for (int j = 0; j < sniffer_ap_count; j++) {
            if (memcmp(sniffer_aps[j].bssid, scan_ap->bssid, 6) == 0) {
                ap_exists = true;
                // Update info but keep clients
                sniffer_aps[j].channel = scan_ap->primary;
                sniffer_aps[j].rssi = scan_ap->rssi;
                sniffer_aps[j].last_seen = esp_timer_get_time() / 1000;
                break;
            }
        }
        if (!ap_exists && sniffer_ap_count < MAX_SNIFFER_APS) {
            sniffer_ap_t *new_ap = &sniffer_aps[sniffer_ap_count++];
            memcpy(new_ap->bssid, scan_ap->bssid, 6);
            strncpy(new_ap->ssid, (char*)scan_ap->ssid, sizeof(new_ap->ssid) - 1);
            new_ap->ssid[sizeof(new_ap->ssid) - 1] = '\0';
            new_ap->channel = scan_ap->primary;
            new_ap->authmode = scan_ap->authmode;
            new_ap->rssi = scan_ap->rssi;
            new_ap->client_count = 0;
            new_ap->last_seen = esp_timer_get_time() / 1000;
        }
        
