Smethan/projectZero/ESP32C5/main/main.c
    // Check if this is a deauthentication frame
    // Frame Control: Type=0 (Management), Subtype=12 (Deauthentication)
    // Frame Control byte 0: 0xC0 = (subtype << 4) | (type << 2) = (12 << 4) | (0 << 2) = 0xC0
    uint8_t frame_type = frame[0] & 0xFC;
    if (frame_type != 0xC0) {
        return; // Not a deauthentication frame
    }
    
    // Extract BSSID (Address 3 in management frames)
    // 802.11 header: FC(2) + Duration(2) + Addr1(6) + Addr2(6) + Addr3(6) + SeqCtl(2)
    // Addr3 is at offset 16
    const uint8_t *bssid_mac = &frame[16];
    
    // Get RSSI from rx_ctrl
    int rssi = pkt->rx_ctrl.rssi;
    
    // Lookup SSID by BSSID from scan results
    const char *ssid = deauth_detector_find_ssid_by_bssid(bssid_mac);
    const char *ap_name = (ssid && ssid[0] != '\0') ? ssid : "<Unknown>";
    
    // Throttle LED flash - only flash red if 100ms passed since last flash
    // This prevents RMT channel conflicts when deauth frames come rapidly
    static int64_t last_led_flash_time = 0;
    int64_t now = esp_timer_get_time() / 1000; // ms
    
    if (now - last_led_flash_time >= 100) {
        (void)led_set_color(255, 0, 0); // Red flash
        last_led_flash_time = now;
    }
    
    // Update shared OLED state for task to render
    snprintf((char *)dd_oled_ssid, sizeof(dd_oled_ssid), "%s", ap_name);
    snprintf((char *)dd_oled_bssid, sizeof(dd_oled_bssid), "%02X:%02X:%02X:%02X:%02X:%02X",
             bssid_mac[0], bssid_mac[1], bssid_mac[2], bssid_mac[3], bssid_mac[4], bssid_mac[5]);
    dd_oled_ch = deauth_detector_current_channel;
    dd_oled_rssi = rssi;
    dd_oled_count++;
    dd_oled_dirty = true;
    
    // Print detection: CHANNEL | AP NAME (MAC) | RSSI
    MY_LOG_INFO(TAG, "[DEAUTH] CH: %d | AP: %s (%02X:%02X:%02X:%02X:%02X:%02X) | RSSI: %d",
               deauth_detector_current_channel,
               ap_name,
               bssid_mac[0], bssid_mac[1], bssid_mac[2], bssid_mac[3], bssid_mac[4], bssid_mac[5],
               rssi);
    
    // Note: LED reset to yellow is handled by the task after channel hop
}

// === WARDRIVE HELPER FUNCTIONS ===

static const char *gps_get_module_name(gps_module_t module) {
    switch (module) {
        case GPS_MODULE_M5STACK_GPS_V11:
            return "M5StackGPS1.1";
        case GPS_MODULE_EXTERNAL:
            return "External";
        case GPS_MODULE_EXTERNAL_CAP:
            return "ExternalCap";
        case GPS_MODULE_ATGM336H:
        default:
            return "ATGM336H";
    }
}

static bool gps_module_uses_external_feed(gps_module_t module) {
    return (module == GPS_MODULE_EXTERNAL || module == GPS_MODULE_EXTERNAL_CAP);
}

static bool gps_module_uses_external_cap_feed(gps_module_t module) {
    return module == GPS_MODULE_EXTERNAL_CAP;
}

static const char *gps_external_position_command_name(gps_module_t module) {
    return gps_module_uses_external_cap_feed(module) ? "set_gps_position_cap" : "set_gps_position";
}

static void gps_sync_from_selected_external_source(void) {
    if (!gps_module_uses_external_feed(current_gps_module)) {
        return;
    }

    if (gps_module_uses_external_cap_feed(current_gps_module)) {
        current_gps = external_cap_gps_position;
    } else {
        current_gps = external_gps_position;
    }
}

static int gps_get_baud_for_module(gps_module_t module) {
    switch (module) {
        case GPS_MODULE_M5STACK_GPS_V11:
            return GPS_BAUD_M5STACK;
        case GPS_MODULE_EXTERNAL:
        case GPS_MODULE_EXTERNAL_CAP:
            // In external mode wardrive does not read GPS UART. Keep safe fallback.
            return GPS_BAUD_ATGM336H;
        case GPS_MODULE_ATGM336H:
        default:
            return GPS_BAUD_ATGM336H;
    }
}

static esp_err_t init_gps_uart(int baud_rate) {
    int effective_baud = (baud_rate > 0) ? baud_rate : GPS_BAUD_ATGM336H;
    uart_config_t uart_config = {
        .baud_rate = effective_baud,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    // Always reinstall driver to ensure clean queues when switching modules/baud without reboot
    if (gps_uart_initialized) {
        uart_driver_delete(GPS_UART_NUM);
        gps_uart_initialized = false;
    }

    esp_err_t err = uart_driver_install(GPS_UART_NUM, GPS_BUF_SIZE * 2, 0, 0, NULL, 0);
    if (err != ESP_OK) {
        return err;
    }
    gps_uart_initialized = true;

    err = uart_param_config(GPS_UART_NUM, &uart_config);
    if (err != ESP_OK) {
        return err;
    }

    err = uart_set_pin(GPS_UART_NUM, GPS_TX_PIN, GPS_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    if (err != ESP_OK) {
        return err;
    }

    err = uart_set_baudrate(GPS_UART_NUM, effective_baud);
    if (err != ESP_OK) {
        return err;
    }

    uart_flush_input(GPS_UART_NUM);
    return ESP_OK;
}

static void gps_save_state_to_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "GPS cfg NVS open failed: %s", esp_err_to_name(err));
        return;
    }
    err = nvs_set_u8(handle, GPS_NVS_KEY_MODULE, (uint8_t)current_gps_module);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "GPS cfg NVS save failed: %s", esp_err_to_name(err));
    }
}

static void gps_load_state_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "GPS cfg NVS read open failed: %s", esp_err_to_name(err));
        return;
    }
    uint8_t module_val = (uint8_t)current_gps_module;
    err = nvs_get_u8(handle, GPS_NVS_KEY_MODULE, &module_val);
    nvs_close(handle);
    if (err == ESP_OK && module_val <= GPS_MODULE_EXTERNAL_CAP) {
        current_gps_module = (gps_module_t)module_val;
    }
}

// Flush FAT filesystem buffers to SD card to ensure metadata consistency.
// ESP-IDF newlib does not implement POSIX sync(), so we force a flush by
// opening a temporary file, calling fsync() on its descriptor (which
// triggers FatFs f_sync and flushes the FAT table), then removing it.
static void sd_sync(void) {
    int fd = open("/sdcard/.sync", O_WRONLY | O_CREAT | O_TRUNC, 0644);
    if (fd >= 0) {
        fsync(fd);
        close(fd);
        unlink("/sdcard/.sync");
    }
}

