Smethan/projectZero/ESP32C5/main/main.c
// Safely unmount SD card and restart to prevent FAT filesystem corruption
static void safe_restart(void) {
    if (sd_card_mounted && sd_card_handle) {
        MY_LOG_INFO(TAG, "Unmounting SD card before restart...");
        esp_vfs_fat_sdcard_unmount("/sdcard", sd_card_handle);
        sd_card_mounted = false;
        sd_card_handle = NULL;
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    esp_restart();
}

static esp_err_t init_sd_card(void) {
    esp_err_t ret;
    
    // Check if SD card is already mounted
    if (sd_card_mounted) {
        return ESP_OK;
    }
    if (sd_last_init_error != ESP_OK) {
        return sd_last_init_error;
    }
    
    // Options for mounting the filesystem (optimized for low memory)
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,  // Don't format automatically to save memory
        .max_files = 5,                   // Increased to 5 for password logging
        .allocation_unit_size = 0,        // Use default (512 bytes) to save memory
        .disk_status_check_enable = false
    };
    
    const char mount_point[] = "/sdcard";
    
    // Configure SPI bus (balanced for SD card requirements and memory)
    spi_bus_config_t bus_cfg = {
        .mosi_io_num = SD_MOSI_PIN,
        .miso_io_num = SD_MISO_PIN,
        .sclk_io_num = SD_CLK_PIN,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,  // SD card needs at least 4KB for sector operations
    };
    
    ret = spi_bus_initialize(SPI2_HOST, &bus_cfg, SPI_DMA_CH_AUTO);  // DMA required for SD card
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        MY_LOG_INFO(TAG, "Failed to initialize SPI bus: %s", esp_err_to_name(ret));
        return ret;
    }
    
    // Initialize the SD card host
    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    host.slot = SPI2_HOST;
    
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs = SD_CS_PIN;
    slot_config.host_id = host.slot;

    // Some cards are unstable at higher SPI clock rates during init.
    const int mount_freqs_khz[] = {SDMMC_FREQ_DEFAULT, 10000, 4000};
    const size_t mount_freqs_count = sizeof(mount_freqs_khz) / sizeof(mount_freqs_khz[0]);
    int attempted_freqs[3] = {0};
    for (size_t i = 0; i < mount_freqs_count; i++) {
        host.max_freq_khz = mount_freqs_khz[i];
        attempted_freqs[i] = host.max_freq_khz;
        ret = esp_vfs_fat_sdspi_mount(mount_point, &host, &slot_config, &mount_config, &sd_card_handle);
        if (ret == ESP_OK) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(60));
    }
    
    if (ret != ESP_OK) {
        sd_last_init_error = ret;
        if (ret == ESP_FAIL) {
            MY_LOG_INFO(TAG, "SD: not mounted (filesystem unsupported/corrupted). File-backed features disabled.");
        } else {
            MY_LOG_INFO(TAG, "SD: not detected (%s after %d/%d/%d kHz). File-backed features disabled.",
                        esp_err_to_name(ret), attempted_freqs[0], attempted_freqs[1], attempted_freqs[2]);
        }
        return ret;
    }
    sd_last_init_error = ESP_OK;
    
    // Print card info (single line)
    uint64_t size_mb = ((uint64_t)sd_card_handle->csd.capacity) * sd_card_handle->csd.sector_size / (1024 * 1024);
    MY_LOG_INFO(TAG, "SD: %s %lluMB", sd_card_handle->cid.name, size_mb);

    // Test file creation to verify write access
    FILE *test_file = fopen("/sdcard/test.txt", "w");
    if (test_file != NULL) {
        fprintf(test_file, "Test write\n");
        fclose(test_file);
        unlink("/sdcard/test.txt");
        sd_sync();
    } else {
        MY_LOG_INFO(TAG, "SD write test failed, errno: %d (%s)", errno, strerror(errno));
    }
    
    // Mark SD card as successfully mounted
    sd_card_mounted = true;
    
    return ESP_OK;
}

static bool sd_mkdir_recursive(const char *path) {
    if (!path || path[0] == '\0') {
        return false;
    }

    char tmp[384];
    if (strlcpy(tmp, path, sizeof(tmp)) >= sizeof(tmp)) {
        return false;
    }

    for (char *p = tmp + 1; *p; p++) {
        if (*p == '/') {
            *p = '\0';
            struct stat st;
            if (stat(tmp, &st) == 0) {
                if (!S_ISDIR(st.st_mode)) {
                    errno = ENOTDIR;
                    return false;
                }
            } else if (mkdir(tmp, 0755) != 0 && errno != EEXIST) {
                return false;
            } else if (stat(tmp, &st) != 0 || !S_ISDIR(st.st_mode)) {
                errno = ENOTDIR;
                return false;
            }
            *p = '/';
        }
    }

    struct stat st;
    if (stat(tmp, &st) == 0) {
        if (S_ISDIR(st.st_mode)) {
            return true;
        }
        errno = ENOTDIR;
        return false;
    }

    if (mkdir(tmp, 0755) != 0 && errno != EEXIST) {
        return false;
    }
    return stat(tmp, &st) == 0 && S_ISDIR(st.st_mode);
}

// Create necessary directories on SD card
static esp_err_t create_sd_directories(void) {
    struct stat st;
    
    static const char * const dirs[] = {
        "/sdcard/lab",
        "/sdcard/lab/htmls",
        "/sdcard/lab/handshakes",
        "/sdcard/lab/wardrives",
        "/sdcard/lab/wardrives/uploaded",
        "/sdcard/lab/pcaps",
    };
    for (int i = 0; i < (int)(sizeof(dirs) / sizeof(dirs[0])); i++) {
        if (!sd_mkdir_recursive(dirs[i])) {
            MY_LOG_INFO(TAG, "mkdir %s failed: %s", dirs[i], strerror(errno));
            return ESP_FAIL;
        }
        if (stat(dirs[i], &st) == 0 && !S_ISDIR(st.st_mode)) {
            MY_LOG_INFO(TAG, "%s exists but is not a directory", dirs[i]);
            return ESP_FAIL;
        }
        if (i == 0 || strcmp(dirs[i], "/sdcard/lab/wardrives") == 0 ||
            strcmp(dirs[i], "/sdcard/lab/wardrives/uploaded") == 0) {
            sd_sync();
        }
    }
    return ESP_OK;
}

static bool parse_gps_nmea(const char* nmea_sentence) {
    if (!nmea_sentence || strlen(nmea_sentence) < 10) {
        return false;
    }
    
    // Parse GPGGA sentence for basic GPS data
    if (strncmp(nmea_sentence, "$GPGGA", 6) == 0 || strncmp(nmea_sentence, "$GNGGA", 6) == 0) {
        char sentence[256];
        strncpy(sentence, nmea_sentence, sizeof(sentence) - 1);
        sentence[sizeof(sentence) - 1] = '\0';
        
        char *token = strtok(sentence, ",");
        int field = 0;
        float lat_deg = 0, lat_min = 0;
        float lon_deg = 0, lon_min = 0;
        char lat_dir = 'N', lon_dir = 'E';
        int quality = 0;
        float altitude = 0;
        float hdop = 1.0;
        
        while (token != NULL) {
            switch (field) {
                case 2: // Latitude DDMM.MMMM
                    if (strlen(token) > 4) {
                        lat_deg = (token[0] - '0') * 10 + (token[1] - '0');
                        lat_min = atof(token + 2);
                    }
                    break;
                case 3: // Latitude direction
                    lat_dir = token[0];
                    break;
                case 4: // Longitude DDDMM.MMMM
                    if (strlen(token) > 5) {
                        lon_deg = (token[0] - '0') * 100 + (token[1] - '0') * 10 + (token[2] - '0');
                        lon_min = atof(token + 3);
                    }
                    break;
                case 5: // Longitude direction
                    lon_dir = token[0];
                    break;
                case 6: // GPS quality
                    quality = atoi(token);
                    break;
                case 7: // Number of satellites
                    current_gps.satellites = atoi(token);
                    break;
                case 8: // HDOP
                    hdop = atof(token);
                    break;
                case 9: // Altitude
                    altitude = atof(token);
                    break;
            }
            token = strtok(NULL, ",");
            field++;
        }
        
        if (quality > 0) {
            // Convert to decimal degrees
            current_gps.latitude = lat_deg + lat_min / 60.0;
            if (lat_dir == 'S') current_gps.latitude = -current_gps.latitude;
            
            current_gps.longitude = lon_deg + lon_min / 60.0;
            if (lon_dir == 'W') current_gps.longitude = -current_gps.longitude;
            
