Smethan/projectZero/ESP32C5/main/main.c
            current_gps.altitude = altitude;
            current_gps.accuracy = hdop * 4.0; // Rough accuracy estimate
            current_gps.valid = true;
            
            return true;
        } else {
            current_gps.satellites = 0;
            current_gps.valid = false;
            return false;
        }
    }
    
    return false;
}

static void get_timestamp_string(char* buffer, size_t size) {
    // For now, use a simple counter-based timestamp
    // In a real implementation, you'd use RTC or NTP time
    static uint32_t timestamp_counter = 0;
    timestamp_counter++;
    
    // Format as a simple date-time string
    snprintf(buffer, size, "2025-09-26 %02d:%02d:%02d", 
             (int)((timestamp_counter / 3600) % 24),
             (int)((timestamp_counter / 60) % 60), 
             (int)(timestamp_counter % 60));
}

static const char* get_auth_mode_wiggle(wifi_auth_mode_t mode) {
    switch(mode) {
        case WIFI_AUTH_OPEN:
            return "Open";
        case WIFI_AUTH_WEP:
            return "WEP";
        case WIFI_AUTH_WPA_PSK:
            return "WPA_PSK";
        case WIFI_AUTH_WPA2_PSK:
            return "WPA2_PSK";
        case WIFI_AUTH_WPA_WPA2_PSK:
            return "WPA_WPA2_PSK";
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return "WPA2_ENTERPRISE";
        case WIFI_AUTH_WPA3_PSK:
            return "WPA3_PSK";
        case WIFI_AUTH_WPA2_WPA3_PSK:
            return "WPA2_WPA3_PSK";
        case WIFI_AUTH_WAPI_PSK:
            return "WAPI_PSK";
        default:
            return "Unknown";
    }
}

static bool wait_for_gps_fix(int timeout_seconds) {
    int elapsed = 0;
    bool infinite = (timeout_seconds <= 0);
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    if (!external_feed) {
        current_gps.valid = false;
    }
    
    if (infinite && external_feed) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (external feed, no timeout, use '%s' or 'stop')...",
                    gps_external_position_command_name(current_gps_module));
    } else if (infinite) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (no timeout, use 'stop' to cancel)...");
    } else if (external_feed) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (external feed, timeout: %d seconds)...", timeout_seconds);
    } else {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (timeout: %d seconds)...", timeout_seconds);
    }
    
    while (infinite || elapsed < timeout_seconds) {
        // Check for stop request
        if (operation_stop_requested) {
            MY_LOG_INFO(TAG, "GPS wait: Stop requested, terminating...");
            return false;
        }

        if (external_feed) {
            gps_sync_from_selected_external_source();
            if (current_gps.valid) {
                return true;
            }
            vTaskDelay(pdMS_TO_TICKS(1000));
        } else {
            // Read GPS data from UART/NMEA source
            int len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(1000));
            if (len > 0) {
                wardrive_gps_buffer[len] = '\0';
                char* line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) {
                    if (parse_gps_nmea(line)) {
                        if (current_gps.valid) {
                            return true;  // GPS fix obtained
                        }
                    }
                    line = strtok(NULL, "\r\n");
                }
            }
        }
        
        elapsed++;
        if (elapsed % 10 == 0) {  // Print status every 10 seconds
            if (infinite) {
                if (external_feed) {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix (external feed)... (%d seconds)", elapsed);
                } else {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix... (%d seconds)", elapsed);
                }
            } else {
                if (external_feed) {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix (external feed)... (%d/%d seconds)", elapsed, timeout_seconds);
                } else {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix... (%d/%d seconds)", elapsed, timeout_seconds);
                }
            }
        }
    }
    
    return false;  // Timeout reached without GPS fix
}

static int find_next_wardrive_file_number(void) {
    int max_number = 0;
    char filename[64];
    MY_LOG_INFO(TAG, "Scanning for existing wardrive log files...");
    // Scan through possible file numbers to find the highest existing one
    for (int i = 1; i <= 9999; i++) {
        snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d.log", i);
        
        struct stat file_stat;
        if (stat(filename, &file_stat) == 0) {
            // File exists, update max_number
            max_number = i;
            MY_LOG_INFO(TAG, "Found existing file: w%d.log", i);
        } else {
            // First non-existing file number, we can break here for efficiency
            break;
        }
    }
    
    int next_number = max_number + 1;
    MY_LOG_INFO(TAG, "Highest existing file number: %d, next will be: %d", max_number, next_number);
    
    return next_number;
}

static int find_next_pcap_file_number(void) {
    int max_number = 0;
    char filename[64];
    for (int i = 1; i <= 9999; i++) {
        snprintf(filename, sizeof(filename), "/sdcard/lab/pcaps/sniff_%d.pcap", i);
        struct stat file_stat;
        if (stat(filename, &file_stat) == 0) {
            max_number = i;
        } else {
            break;
        }
    }
    return max_number + 1;
}

// Save evil twin password to SD card
static void save_evil_twin_password(const char* ssid, const char* password) {
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card for password logging: %s", esp_err_to_name(ret));
        return;
    }
    
    // Check if /sdcard directory is accessible
    struct stat st;
    if (stat("/sdcard", &st) != 0) {
        MY_LOG_INFO(TAG, "Error: /sdcard directory not accessible");
        return;
    }
    
